[
    {
        "input": {
            "案例编号": "病例247",
            "临床资料": "某女，62岁。初诊：1957年1月。主诉及病史：发病十数天，咳逆不能平卧，唾白色泡沫痰。诊查：短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口。脉浮细数而无力。",
            "病机答案": "",
            "病机选项": "A:痰浊;B:耗损心气和心阴;C:食郁于胃;D:少阴伤寒;E:心移热于小肠;F:气阴两亏;G:脾胃湿热;H:阴虚内热;I:肾水不足;J:心气虚",
            "证候答案": "",
            "证候选项": "A:风湿内侵;B:气虚血瘀;C:血虚生风;D:肾元不固;E:虚火牙痛;F:肝气横逆;G:阴亏之体;H:感暑邪;I:复感外邪;J:阴寒内盛",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：此乃肺肾两虚，水饮凌心所致。患者年事已高，肺气虚弱，肾阳不足，导致水液代谢失常，水饮上凌于心，影响心肺功能，出现咳逆不能平卧，唾白色泡沫痰等症状。同时，患者神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，脉浮细数而无力，均为心肺功能衰弱，阳气虚脱之象。治疗应以温补肺肾，化饮降逆，固脱救逆为原则。"
    },
    {
        "input": {
            "案例编号": "病例142",
            "临床资料": "万某，男，45岁。初诊：1977年11月6日。主诉及病史：1个月前因左副鼻窦炎连续注射链霉素7g，引起眩晕耳鸣，走路时摇晃如醉人，并有复视(不走路时没有复视)，至今未愈。经常嗳气上逆，大便干结。已经3个医院神经科检查，无异常发现。诊查：血压100/70mmHg。脉弦细带滑，舌胖，苔微黄而润。",
            "病机答案": "",
            "病机选项": "A:风热外袭;B:络道阻塞;C:脾胃运化失常;D:幽门塞阻;E:肺阴亏损;F:损及肾阴;G:生湿成痰;H:痰浊内蕴;I:心肝血虚火旺;J:清阳失展",
            "证候答案": "",
            "证候选项": "A:下元虚损;B:痰浊上逆;C:湿热蕴积;D:肝郁气滞;E:肝肾阴虚;F:寒热互结;G:心肝阳虚;H:真阴亏损;I:清气不升;J:伤脾胃",
            "临证体会": ""
        },
        "task_5": "辨证：肝胃不和，痰湿中阻\n\n解析：根据万某的临床表现，可以分析如下：\n\n1. 眩晕耳鸣：眩晕是肝阳上亢或痰湿中阻的常见症状，耳鸣多与肝胆火旺或肾精不足有关。但结合其他症状，更倾向于痰湿中阻导致的眩晕耳鸣。\n\n2. 走路时摇晃如醉人：这与痰湿中阻，清阳不升，影响平衡感有关。\n\n3. 复视：复视在中医中多与肝风内动或痰湿阻络有关，但不走路时没有复视，提示可能与痰湿中阻，影响气血运行有关。\n\n4. 嗳气上逆：嗳气是胃气上逆的表现，与肝胃不和有关。\n\n5. 大便干结：大便干结多与津液不足或湿热内蕴有关，结合脉象和舌象，更倾向于痰湿中阻，影响脾胃运化，导致津液不足。\n\n6. 脉弦细带滑，舌胖，苔微黄而润：脉弦细带滑提示肝胃不和，痰湿内阻；舌胖，苔微黄而润，提示体内有湿邪，且湿邪偏重。\n\n综上所述，万某的辨证为肝胃不和，痰湿中阻。治疗上应以疏肝和胃，化痰祛湿为主。"
    },
    {
        "input": {
            "案例编号": "病例23",
            "临床资料": "吴某，男，52岁。初诊:1985年1月10日。主诉及病史:患高血压病十余载。1月3日晚暴怒之后昏然入睡，晨起醒来，即见口眼歪斜(歪向左侧)，嘴角抽搐时作，流涎不止，左半身不利，手指麻木不仁，步履拖拉，膝软无力，言语睿涩，头目眩晕，耳鸣，嗜睡，面红目赤，口苦咽干，心烦易躁，纳可，便干、二日一行，虽经治疗，收效甚微。脉弦劲略滑，舌红体胖且左偏，边有齿痕，苔白腻满布，血压210/110mmHg。",
            "病机答案": "",
            "病机选项": "A:肝风夹痰;B:湿热交蒸肝胆;C:痰湿内盛;D:肝阳化火;E:阴虚阳亢;F:伏湿内蕴;G:神明受扰,;H:气血逆乱;I:气化失调;J:火升风动",
            "证候答案": "",
            "证候选项": "A:肝肾阴虚;B:肝风内动;C:心肾不交;D:卫外不固;E:气阴两伤;F:肝火亢盛;G:湿热郁遏;H:热在气分;I:热伤胃阴;J:风痰窜络",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肝阳上亢，风痰阻络，兼有肝火上炎。\n\n吴某的临床表现符合中医辨证中肝阳上亢的特征，表现为面红目赤、口苦咽干、心烦易躁、脉弦劲略滑，这些都是肝阳上亢的典型症状。同时，口眼歪斜、嘴角抽搐、流涎、左半身不利、手指麻木不仁、步履拖拉、膝软无力、言语不清、头目眩晕、耳鸣等症状，提示风痰阻络，影响了经络的正常运行，导致肢体功能障碍。舌红体胖且左偏、边有齿痕、苔白腻满布，提示体内有痰湿之邪，与风痰阻络相吻合。此外，便干、二日一行，也反映了肝火上炎，影响了大肠的传导功能。综合以上症状，吴某的辨证为肝阳上亢，风痰阻络，兼有肝火上炎。"
    },
    {
        "input": {
            "案例编号": "病例102",
            "临床资料": "黄某，女，39岁。初诊：1973年10月31日。主诉及病史：自诉进食困难，呕吐，胸闷已3月余。患者久有头部太阳穴处刺痛之疾，并觉后脑麻木，耳鸣、似有耳垢闭塞，心悸气促等。近3个月来，觉左喉间似有一物阻碍进食，故不能进有形之食物，仅能吃流质，胸闷痛，嗳气多，时作干呕，食则呕吐，大便溏泄，夜寐不宁，月经量少、色淡，且经行不畅；每次月经来潮上述症状加重。曾在某医院作X线胃肠钡餐检查，诊为“食管中段憩室，冗长十二指肠及双憩室”。诊查：来诊时患者面黄体瘦，精神疲乏，起坐需人扶持，胸胁痛，两足酸软，舌淡红，苔少，脉弦细而迟弱。",
            "病机答案": "",
            "病机选项": "A:痰浊夹肝风上逆;B:脾气散乱;C:心失所养;D:痰阻肺道;E:外邪袭肺;F:风邪伏肺;G:气血两虚;H:胃失和降;I:饮邪化热;J:脏腑失养",
            "证候答案": "",
            "证候选项": "A:肝肾亏虚;B:血不归经;C:阴虚肝郁;D:虚火内扰;E:下虚失摄;F:脾失健运;G:阳明燥实;H:郁而化热;I:胃中虚冷;J:寒饮上逆",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肝郁脾虚，气滞血瘀\n\n患者黄某，女，39岁，长期存在头部太阳穴处刺痛、后脑麻木、耳鸣等症状，近3个月进食困难，胸闷痛，嗳气多，干呕，食则呕吐，大便溏泄，夜寐不宁，月经量少、色淡，经行不畅。这些症状表明患者存在肝气郁结，影响脾胃功能，导致气机不畅，血行受阻，形成气滞血瘀的病理状态。肝郁脾虚，脾胃运化功能减弱，故出现进食困难、呕吐、胸闷等症状。同时，肝气郁结影响血行，导致月经量少、色淡，经行不畅。舌淡红、苔少、脉弦细而迟弱，亦支持肝郁脾虚，气滞血瘀的辨证。"
    },
    {
        "input": {
            "案例编号": "病例10",
            "临床资料": "张某，38岁，已婚。主诉及病史：素禀不充，中气虚弱，已近中年，又复怀孕，今已5个月余。3天来痢下白多赤少，日行七八次，里急后重，小溲黄而短，寒热口干，不思饮纳，头疼泛恶，腰胯酸楚。诊查：脉滑小数、两尺较弱，舌质淡红，苔白而腻。",
            "病机答案": "",
            "病机选项": "A:外邪束表;B:肝郁气滞;C:肾气虚弱;D:素体气虚;E:传化失司;F:脏腑气血功能紊乱;G:痰涎壅积;H:营卫不利;I:湿重于热;J:湿郁化热",
            "证候答案": "",
            "证候选项": "A:痰蒙清窍;B:气血失养;C:血热;D:痰湿内蕴;E:心肝阳虚;F:水血互结;G:湿重于热;H:湿热互结;I:兼感外邪;J:心肾不交",
            "临证体会": ""
        },
        "task_5": "辨证：脾虚湿热，胎气下迫\n\n解析：根据张某的临床资料，可以观察到她有以下症状：痢下白多赤少，日行七八次，里急后重，小溲黄而短，寒热口干，不思饮纳，头疼泛恶，腰胯酸楚。这些症状结合脉滑小数、两尺较弱，舌质淡红，苔白而腻的脉象和舌象，提示存在脾虚湿热的情况。同时，由于她已怀孕5个月，胎气下迫也可能加重了上述症状。因此，辨证为脾虚湿热，胎气下迫。在治疗上，应以健脾利湿、清热解毒、安胎为主，同时注意调养中气，以改善其体质。"
    },
    {
        "input": {
            "案例编号": "病例92",
            "临床资料": "张某，男，19岁。初诊：1963年5月24日。主诉及病史：全身浮肿已5年，经某医院诊断为慢性肾炎，治疗未效，近来症状加剧。诊查：就诊时，除全身浮肿外，兼见大便溏泄，一日数行，小溲短少。时时欲呕，或食入即吐。精神委靡，面色觥白，唇淡不荣，舌苔薄白，脉沉细涩，足胫按之凹陷。尿检：蛋白(++++)，粒状管型(+++)，脓球(+++)，红细胞(++)。",
            "病机答案": "",
            "病机选项": "A:心火又灼肺;B:命门火衰;C:水不涵木;D:肝郁;E:精血不充;F:气血运行不畅;G:肝气不疏;H:清阳不升;I:脾失健运;J:肝阴亏损",
            "证候答案": "",
            "证候选项": "A:肾水无制;B:三阳合病;C:脾肾阳虚;D:肾阴未固;E:湿热下注;F:热病伤阴;G:慢脾风象;H:暑温;I:脾虚不运;J:脾胃虚弱",
            "临证体会": ""
        },
        "task_5": "辨证：此为脾肾阳虚，水湿泛滥之证。患者长期患有慢性肾炎，导致肾阳不足，不能温煦脾土，脾失健运，水湿内停，上泛于肺，下溢于肌肤，故见全身浮肿，小溲短少。脾虚则运化失常，故见大便溏泄，一日数行。肾阳虚衰，不能温煦脏腑，故精神委靡，面色觥白，唇淡不荣。舌苔薄白，脉沉细涩，足胫按之凹陷，均为阳虚水泛之象。尿检异常，蛋白、粒状管型、脓球、红细胞增多，反映肾功能受损，水湿内停，影响肾小球滤过功能。"
    },
    {
        "input": {
            "案例编号": "病例44",
            "临床资料": "李某，男，40岁。初诊:1963年12月12日。主诉及病史:右侧腰部(右肾区)酸痛坠胀5个月许，动则更甚，转侧不利，难以俯仰。X线摄片示右肾下垂(在第3腰椎以下)。某医院认为无有效疗法，乃来求治。诊查:外形不变，叩之痛剧，面色不华，身体较瘦，脉象沉细，苔色淡薄。",
            "病机答案": "",
            "病机选项": "A:炼液为痰;B:气血生化无源;C:肾阳虚弱;D:精血亏损;E:瘀血阻于经隧脉络;F:气血瘀滞;G:脾胃原虚;H:肝郁;I:肾亏;J:脾寒",
            "证候答案": "",
            "证候选项": "A:肝经郁火;B:肾阳虚衰;C:气血两亏;D:脾胃虚弱;E:气血失养;F:血虚兼受风湿之邪;G:热在气分;H:心肺脾(胃)积热;I:气滞血瘀;J:肝阴不足",
            "临证体会": ""
        },
        "task_5": "辨证：肾虚不固，腰府失养之候。\n\n李某的临床表现以右侧腰部酸痛坠胀为主，且症状在活动后加重，转侧不利，难以俯仰，这些都是肾虚导致腰府失养的典型症状。X线摄片显示右肾下垂，进一步证实了肾虚不固的情况。面色不华、身体较瘦、脉象沉细、苔色淡薄等，均提示气血不足，肾精亏损，肾气不固，不能滋养腰部，故出现上述症状。在中医理论中，肾主骨，腰为肾之府，肾虚则腰府失养，故出现腰部酸痛坠胀等症状。治疗上应以补肾固腰，养血安神为主，以期达到固肾强腰，缓解症状的目的。"
    },
    {
        "input": {
            "案例编号": "病例172",
            "临床资料": "葛某，男，34岁。初诊：1959年3月10日。主诉及病史：头昏、腹胀、双下肢浮肿8个月，曾住某县医院，诊断为“肝硬化腹水”，经治疗后有所好转。近2个月来，病情反复，腹胀加重，面部浮肿，尿少，大便稀、有粘液、每日3～6次，饮食精神欠佳，急躁易怒，经抽腹水、注射利尿药等治疗，效果不理想，转住我院。诊查：肖老会诊，症见面色青、气短息微，腹满绷急，脐凸出，腹壁青筋暴露，两胁下深触有较硬包块，腹围96cm，面部及双下肢浮肿。脉弦数，苔白，舌质微红。",
            "病机答案": "",
            "病机选项": "A:水邪泛滥;B:化风;C:风热犯肺;D:水谷精微吸收差;E:肝气郁结;F:湿困经络;G:胁肋内伤;H:横逆犯脾;I:恚怒伤肝;J:肝阴不足",
            "证候答案": "",
            "证候选项": "A:伏风夹瘀;B:水邪泛滥;C:肝肾阴虚;D:肝阴虚;E:肝木乘土;F:脾肾两虚;G:肾亏阴虚;H:肝气犯胃;I:上热下寒;J:湿热中阻",
            "临证体会": ""
        },
        "task_5": "辨证：肝脾失调，湿热内蕴，气滞血瘀，水湿泛滥。\n\n解析：根据葛某的临床表现，可以辨证为肝脾失调，湿热内蕴，气滞血瘀，水湿泛滥。具体分析如下：\n\n1. 肝硬化腹水：肝硬化导致肝功能减退，影响脾的运化功能，脾虚不能运化水湿，湿热内蕴，导致腹水形成，腹胀加重，面部及双下肢浮肿。\n\n2. 脉弦数，苔白，舌质微红：脉弦数提示肝气郁结，湿热内蕴；苔白提示脾虚湿困；舌质微红提示有热象。\n\n3. 急躁易怒：肝气郁结，情绪易波动，急躁易怒。\n\n4. 面色青、气短息微：面色青提示气血运行不畅，气短息微提示气虚。\n\n5. 腹满绷急，脐凸出，腹壁青筋暴露，两胁下深触有较硬包块：腹满绷急、脐凸出、腹壁青筋暴露提示腹水严重，两胁下深触有较硬包块提示肝脾肿大或肝硬化结节。\n\n6. 大便稀、有粘液、每日3～6次：脾虚湿困，运化功能减退，导致大便稀、有粘液。\n\n7. 饮食精神欠佳：肝脾失调，影响消化吸收，导致饮食精神欠佳。\n\n综上所述，葛某的辨证为肝脾失调，湿热内蕴，气滞血瘀，水湿泛滥。治疗上应以疏肝理气、健脾利湿、活血化瘀为主，同时注意调整饮食，避免辛辣刺激食物，保持情绪稳定，适当运动，促进气血运行。"
    },
    {
        "input": {
            "案例编号": "病例40",
            "临床资料": "曾某，女，15岁。初诊：1977年11月28日。主诉及病史：11月19日因患急性咽炎致高烧，体温40℃，右侧颈淋巴结肿大，有压痛。血常规检查：白细胞22600/mm3，中性89%，淋巴11%。用青霉素40万单位，肌内注射，每日2次；链霉素0.5g，肌内注射，每日2次，连用4天，高烧向退。但面目颈项出现浮肿。尿检：蛋白(+)，上皮细胞少数，脓细胞0～6，红细胞少数，颗粒管型0～2;血沉24mm/h，诊断为急性肾炎。诊查：诊时面目轻度浮肿，低烧绵绵(体温37.7℃)，胃纳减少，口生溃疡，头痛，胃脘疼痛，脉细，苔白厚腻。",
            "病机答案": "",
            "病机选项": "A:湿郁生痰;B:血海空虚;C:命门火衰;D:冲任受损;E:神明受扰,;F:神不守舍;G:外邪侵于肺卫;H:肾水不足;I:脾运失健;J:邪毒内陷脾肾",
            "证候答案": "",
            "证候选项": "A:风温时邪;B:脾虚湿滞;C:阳亢风动;D:肝肾亏虚;E:阳明热盛;F:脾失健运;G:暑温;H:热结下焦;I:积郁伤神;J:气血不足",
            "临证体会": ""
        },
        "task_5": "辨证：湿热内蕴，脾肾受损，水湿不化。\n\n分析：曾某，女，15岁，因急性咽炎引发高烧，继而出现面目颈项浮肿，尿检异常，诊断为急性肾炎。中医辨证分析如下：\n\n1. **湿热内蕴**：患者高烧后出现面目浮肿，尿检异常，提示体内湿热之邪未清，湿热内蕴，影响水液代谢，导致水湿不化，表现为浮肿。\n\n2. **脾肾受损**：脾主运化水湿，肾主水液代谢。患者面目浮肿，尿检异常，提示脾肾功能受损，不能正常运化和排泄水液，导致水湿内停。\n\n3. **水湿不化**：湿热之邪与脾肾功能受损共同作用，导致水湿不化，表现为面目浮肿，尿检异常，蛋白尿，上皮细胞、脓细胞和红细胞增多，颗粒管型出现。\n\n4. **低烧绵绵**：低烧绵绵，提示体内仍有邪气未清，湿热之邪持续影响。\n\n5. **胃纳减少，口生溃疡，头痛，胃脘疼痛**：这些症状提示湿热之邪不仅影响水液代谢，还影响脾胃功能，导致消化不良，胃脘不适。\n\n6. **脉细，苔白厚腻**：脉细提示正气不足，苔白厚腻提示湿邪内盛。\n\n综上所述，曾某的辨证为湿热内蕴，脾肾受损，水湿不化，需清热利湿，健脾益肾，以恢复水液代谢平衡，消除浮肿，改善尿检异常。治疗上可考虑使用清热利湿、健脾益肾的中药方剂，如五苓散、苓桂术甘汤等，具体用药需根据患者实际情况调整。"
    },
    {
        "input": {
            "案例编号": "病例242",
            "临床资料": "郭某，女，40岁。初诊：1978年12月30日。主诉及病史：满口糜烂，龈肿舌痛，唇烂咽痛，反复发作，饮食困难，心烦易怒已半年余。内服维生素等效果不显。曾在某医院就诊，诊断为复发性口腔炎，每遇消化不良、胃肠不适、睡眠不安则病情加重。诊查：来诊时患者苦楚难以名状。舌尖、舌边可见红色疮面，上下唇肉及双侧颊粘膜有散在小溃疡，咽红，舌质赤发裂，苔薄黄，脉细数。",
            "病机答案": "",
            "病机选项": "A:虚阳妄动之象;B:内有郁热;C:阴血亏;D:心肺胃之火上炎;E:毒热内迫营血;F:心营亏损;G:虚火上炎;H:水湿交阻;I:风痰交阻;J:血不养筋",
            "证候答案": "",
            "证候选项": "A:气血两亏;B:脑失其养;C:肝肾亏损;D:相火炽盛;E:气脱证;F:暑湿内伏;G:肝火亢盛;H:心肺脾(胃)积热;I:阴虚火旺;J:肾阴偏虚",
            "临证体会": ""
        },
        "task_5": "辨证：心脾积热，阴虚火旺，热毒上炎\n\n解析：根据患者临床表现，满口糜烂，龈肿舌痛，唇烂咽痛，反复发作，饮食困难，心烦易怒，以及舌尖、舌边可见红色疮面，上下唇肉及双侧颊粘膜有散在小溃疡，咽红，舌质赤发裂，苔薄黄，脉细数，这些症状提示心脾积热，阴虚火旺，热毒上炎。心主血脉，脾主运化，心脾积热可致口腔黏膜受损，阴虚火旺则加剧热毒上炎，导致口腔炎症反复发作，疼痛难忍。"
    },
    {
        "input": {
            "案例编号": "病例125",
            "临床资料": "王某，女，35岁。初诊：1975年8月1日。主诉及病史：素有慢性支气管炎，10年来时常咳血。昨起略有咳嗽，痰中带血甚多，胸闷痛，上身热，大便干燥。诊查：苔薄，脉细弦而数。",
            "病机答案": "",
            "病机选项": "A:神明受扰,;B:虚火在上;C:肾气不固;D:灼伤肺络;E:痰瘀为患;F:酒家湿蕴;G:气阴两亏;H:心失所养;I:肾气虚;J:肝火偏旺",
            "证候答案": "",
            "证候选项": "A:湿重于热;B:灼伤阳络;C:心肝阳亢;D:肝火犯肺;E:阳亢风动;F:卫阳不固;G:肝郁气滞;H:湿痰蕴络;I:肝失温养;J:痰湿阻滞经络",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肺热阴虚，血络受损\n\n解析：根据王某的临床表现，她有慢性支气管炎的病史，且有咳血的症状，这在中医辨证中属于肺系疾病。昨起咳嗽加重，痰中带血，胸闷痛，上身热，大便干燥，这些症状提示存在肺热和阴虚的情况。肺热可以导致血络受损，从而引起咳血。同时，大便干燥也反映了体内津液不足，阴虚的状况。脉细弦而数，苔薄，也支持了肺热阴虚的辨证。因此，综合分析，王某的辨证为肺热阴虚，血络受损。治疗上应以清肺热、养阴血、止血为主。"
    },
    {
        "input": {
            "案例编号": "病例303",
            "临床资料": "高某，女，27岁。主诉及病史：月前分娩，娩后2周突觉两下肢痿软无力，不能任地，无法站立及行走。头昏背凉，溺清便溏。近日来病情增剧，双上肢亦感无力，起坐均赖人扶持，生活完全不能自理。诊查：面色跳白，爪甲色淡，舌淡润而色暗，苔薄白，六脉濡细，两尺微涩。",
            "病机答案": "",
            "病机选项": "A:肾病及脾;B:卫阳;C:胃气不降;D:督脉瘀阻;E:气血失调;F:气壅上逆;G:血虚;H:累及中、下二焦;I:脾气不升;J:肾气虚",
            "证候答案": "",
            "证候选项": "A:移热于小肠;B:督脉瘀阻;C:气血失和;D:血虚阳弱;E:肝火犯肺;F:证属肺气肺阴不足;G:痰热上扰;H:寒湿阻滞经脉;I:肝肾两损;J:津气欲脱",
            "临证体会": ""
        },
        "task_5": "辨证：此属产后气血两虚，筋骨失养。\n\n产后本是妇女气血大亏之时，加之分娩过程中的耗损，若调养不当，极易导致气血两虚。气血是人体生命活动的物质基础，尤其对于筋骨肌肉的滋养至关重要。气血不足，不能濡养筋骨，故见四肢痿软无力，不能站立行走。面色㿠白、爪甲色淡、舌淡润而色暗、苔薄白、脉濡细、两尺微涩，均为气血两虚之象。此外，头昏背凉、溺清便溏，亦是气血不足，不能温煦固摄的表现。因此，辨证为产后气血两虚，筋骨失养。治疗当以补益气血、滋养筋骨为主，可选用八珍汤、归脾汤等方剂加减，以期恢复气血，强健筋骨。"
    },
    {
        "input": {
            "案例编号": "病例344",
            "临床资料": "王某，男，3岁。初诊:1960年3月3日。主诉及病史:患儿昨晚起发热，体温38.6℃，伴咳嗽、喷嚏、流涕，大便干，小便黄。诊查:全身皮肤遍起红疹，舌边尖红、苔薄白而干，脉象浮数。",
            "病机答案": "",
            "病机选项": "A:精血不能濡养筋膜;B:津液耗损;C:风温之邪侵袭肺卫;D:营卫不利;E:肾气虚弱;F:热入血络;G:血热不固;H:脾胃受伤;I:脾肾虚寒;J:肝郁",
            "证候答案": "",
            "证候选项": "A:心肾不交;B:肝气犯胃;C:伤肠胃之液;D:气阴两虚;E:热入营血;F:君相火旺;G:肝肾亏虚;H:乳络不通;I:温邪犯肺;J:气滞血瘀",
            "临证体会": ""
        },
        "task_5": "辨证：风热犯肺，夹有燥热。\n\n解析：根据患儿的临床表现，发热、咳嗽、喷嚏、流涕，以及全身皮肤遍起红疹，这些都是风热外感的典型症状。舌边尖红、苔薄白而干，脉象浮数，这些舌脉象也支持了风热犯肺的诊断。此外，大便干、小便黄提示体内有燥热，故辨证为风热犯肺，夹有燥热。治疗上应以疏风清热、润燥解毒为主。"
    },
    {
        "input": {
            "案例编号": "病例265",
            "临床资料": "刘某，女，26岁。初诊：1974年3月8日。主诉及病史：患者于1978年春节饮酒时，误将一杯25%烧碱溶液当酒喝下，遂引起食管溃破，口吐鲜血约150ml，呕吐，不能咽水，壮热烦渴，体温39.5℃。经输液加消炎药治疗，病情得到控制，但遗留吞咽困难，不能吃硬食。胃镜检查提示：食管中段有2.5cm粘膜消失，收缩功能极差，建议赴上级医院治疗。后到河南医学院检查，拍片提示：食管狭窄。须手术治疗，患者深感畏惧，邀余施治。诊查：症见吞咽困难，汤水可下，口干欲饮，大便干结。舌质红，苔薄少津，脉弦细。",
            "病机答案": "",
            "病机选项": "A:气血不能上承于脑;B:风湿痹证迁延不愈;C:肾水不足;D:热盛津伤;E:复感寒邪;F:热入血络;G:气血凝瘀而化热;H:胃失降和;I:清窍受蒙;J:肝郁",
            "证候答案": "",
            "证候选项": "A:脾胃受制;B:阴虚生热夹痰;C:痰热互结;D:心肝阳亢;E:灼伤脉络;F:肝阳上亢;G:气血失和;H:气阴两竭;I:心肾两亏;J:痰浊壅遏",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：热毒伤阴，食管瘀阻\n\n解析：患者因误服强碱性物质导致食管严重损伤，出现食管溃破、出血、高热等症状，经治疗后遗留吞咽困难，不能进食固体食物，此为热毒直接损伤食管黏膜所致。长期的食管狭窄和吞咽困难，加之口干欲饮、大便干结、舌质红、苔薄少津、脉弦细等表现，提示体内阴液受损，热毒未清，食管局部瘀阻。故辨证为热毒伤阴，食管瘀阻。治疗上应以清热解毒、养阴生津、活血化瘀为主，以促进食管黏膜修复，改善吞咽功能。"
    },
    {
        "input": {
            "案例编号": "病例190",
            "临床资料": "杨某，女，32岁。初诊：1962年3月14日。主诉及病史：遇气候变迁，则周身起红斑发痒，甚至昏厥，头晕欲呕、冷汗出，迁延两载。诊查：脉缓小数，舌本红少苔。",
            "病机答案": "",
            "病机选项": "A:脾胃亏损;B:血热不固;C:湿热郁而生毒;D:肾水不足;E:热病伤阴;F:少阳证;G:精血亏损;H:湿热蕴积;I:温病热灼营阴;J:冲任虚衰",
            "证候答案": "",
            "证候选项": "A:肝阴不足;B:湿热郁结;C:气滞血瘀;D:脾阳虚;E:灼伤脉络;F:脾虚生湿;G:肾阴不足;H:肝脾不和;I:肝阳上亢;J:脾胃气虚",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：气血两虚，兼有风热侵袭，卫表不固。\n\n解析：根据杨某的临床表现，她遇到气候变迁时出现红斑、发痒、昏厥、头晕欲呕、冷汗出等症状，结合脉缓小数、舌本红少苔的诊查结果，可以辨证为气血两虚，卫表不固，风热之邪乘虚而入。气血两虚导致身体抵抗力下降，卫表功能减弱，风热之邪易于侵袭，故遇气候变化则症状加重。"
    },
    {
        "input": {
            "案例编号": "病例252",
            "临床资料": "马某，25岁。主诉及病史：体质素弱，骤然血崩不止，唇甲俱白，目合神昏，额汗如珠，手足逆冷。诊查：脉濡舌淡。",
            "病机答案": "",
            "病机选项": "A:血海失营;B:肝肾之阴不足;C:冲任受损;D:血不归经;E:脾不统血;F:痰火互结;G:热病伤阴;H:痰浊阻膈;I:气滞血瘀;J:血虚",
            "证候答案": "",
            "证候选项": "A:血不归经;B:肝肾同病;C:肝气上逆;D:真寒假热;E:湿阻血瘀;F:膀胱失约;G:湿滞停留肠胃;H:清窍失灵;I:肝脾两虚;J:肝气横逆",
            "临证体会": ""
        },
        "task_5": "辨证：气血两脱，脾肾阳虚\n\n马某的临床表现符合中医辨证中的气血两脱，脾肾阳虚。血崩不止，唇甲俱白，目合神昏，额汗如珠，手足逆冷，脉濡舌淡，这些症状都指向了气血严重亏损，脾肾阳气不足。在中医理论中，脾为后天之本，主运化，肾为先天之本，主藏精，两者阳气的不足，导致了气血的生成和固摄功能减弱，从而出现血崩不止等严重症状。治疗上应以补气养血，温阳固脱为主。"
    },
    {
        "input": {
            "案例编号": "病例261",
            "临床资料": "范某，女，25岁。初诊：1977年5月13日。主诉及病史：双眼视力下降伴眼前红绿黑花飞舞3个月余。诊查：视力：右眼远0.5，近0.6;左眼远0.3，近0.3。加镜无助。双眼视神经乳头颜色苍白，鼻侧边界欠清，视网膜血管大小比例正常，网膜未见出血及渗出，黄斑部中心凹光反射清晰。患者情志不舒，神疲纳差，胁痛胸闷，口苦咽干，月经不调；舌质淡红苔薄白，脉弦。西医诊断为视神经萎缩(双眼)。",
            "病机答案": "",
            "病机选项": "A:相火不藏;B:湿热内蕴;C:胆汁外溢;D:痰阻经络;E:卫气虚弱;F:湿浊内盛;G:肝气不舒;H:正气已衰;I:阳气外泄;J:命火衰微",
            "证候答案": "",
            "证候选项": "A:肾元不固;B:心肝阳亢;C:心脾两虚;D:肝旺湿热;E:脾胃不和;F:血不濡筋;G:厥阳升扰;H:热盛动风;I:肝气郁结;J:饮热蕴结",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肝郁脾虚，气血不足，目失所养\n\n解析：根据患者主诉及病史，患者出现双眼视力下降，眼前红绿黑花飞舞，西医诊断为视神经萎缩(双眼)。中医辨证应从患者整体情况出发，结合舌脉及症状进行分析。患者情志不舒，神疲纳差，胁痛胸闷，口苦咽干，月经不调，舌质淡红苔薄白，脉弦，这些症状提示肝郁脾虚，气血不足。肝主目，肝郁脾虚导致气血不足，目失所养，故出现视力下降及眼前飞舞等症状。因此，辨证为肝郁脾虚，气血不足，目失所养。"
    },
    {
        "input": {
            "案例编号": "病例215",
            "临床资料": "陈某，女，3岁。初诊：1967年8月，主诉及病史：患儿3天前起病，发热，头剧痛，呕吐，病情逐渐加重。登门求治于余。诊查：正值8月，气候炎热，患儿高烧40.5℃，无汗，抽风，烦躁，神志不清，目赤直视。舌质红，苔黄腻。腹胀3日未大便，溺赤，纹紫，脉滑数。",
            "病机答案": "",
            "病机选项": "A:内蕴痰湿;B:脾肾两虚;C:腑气不通;D:肾阳不足;E:肝胆气郁化热;F:热毒内燔;G:暑温邪气;H:吐泻复损津液;I:郁火伤津之象;J:风热之邪外袭",
            "证候答案": "",
            "证候选项": "A:肝气郁结;B:暑温动风;C:肝阳上亢;D:脾胃气虚;E:风痰窜络;F:少阳经腑同病;G:水气凌心;H:肝气犯胃;I:气血两亏;J:肝风内动",
            "临证体会": ""
        },
        "task_5": "辨证：此为暑热内闭，热极生风之证。暑为阳邪，其性炎热，易伤津耗气，且暑多挟湿，但此患儿以暑热为主，热邪炽盛，内扰心神，故见高烧、烦躁、神志不清；热极则生风，故见抽风、目赤直视；舌质红、苔黄腻、腹胀、3日未大便、溺赤、纹紫、脉滑数均为热盛之象，其中腹胀、未大便、溺赤、脉滑数提示热邪已深入胃肠，影响消化及排泄功能。因此，辨证为暑热内闭，热极生风。"
    },
    {
        "input": {
            "案例编号": "病例179",
            "临床资料": "李某，男，52岁，主诉及病史：患者体丰腴，嗜茶成癖，每晨起必喝浓茶一大杯，数十年如一日，尝有咳嗽，自恃体健，不以为意。诊查：诉1周来精神困乏，不思饮食，但既未伤食，亦未受凉，不知何以致此。近3日来，更加胸膈闷满，倦怠嗜卧，委靡不振，四肢软弱无力。阵阵咳嗽，痰涎多，滑而易出。切其脉沉濡。视其舌，苔白而腻。",
            "病机答案": "",
            "病机选项": "A:脾胃健运力差;B:痰浊上逆;C:恐伤肾气;D:寒热结滞肠间;E:脾胃阳虚;F:热灼胃中;G:痰湿未化;H:血热不固;I:脾失健运;J:湿郁生痰",
            "证候答案": "",
            "证候选项": "A:三阳合病;B:湿热郁阻三焦;C:湿痰;D:阳虚;E:肝胆湿热;F:血分蕴热;G:肝脾两虚;H:湿热毒邪侵扰心包;I:脾失健运;J:阴耗火动",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：此为脾虚湿盛，痰湿内阻之证。患者长期嗜饮浓茶，损伤脾胃，脾失健运，湿邪内生，聚湿生痰，故见胸膈闷满，倦怠嗜卧，四肢软弱无力，痰涎多而滑易出。脾虚则食欲不振，精神困乏，不思饮食。脉沉濡，舌苔白腻，均为脾虚湿盛之象。治疗当以健脾化湿，理气化痰为法。"
    },
    {
        "input": {
            "案例编号": "病例122",
            "临床资料": "朱某，男，53岁。初诊：1983年6月2日。主诉及病史：患者于2个月前，因洗澡受凉而发热，迄今未得控制，体温为38～39℃。初起热无定时，不恶寒，近1个月来，发热有定时，中午起，入暮退，伴有耳聋、目眩、口苦、咽中干热，脘腹及左下腹作胀，胃纳欠馨，无恶心呕吐，二便正常。曾有肝硬化、脾切除史。诊查：舌红苔薄黄，脉弦数。",
            "病机答案": "",
            "病机选项": "A:肝木上亢;B:痰湿内阻;C:脾胃阳虚;D:阳明承气证;E:肺失肃降;F:久咳肺气先虚;G:湿热留恋气分;H:少阳证;I:胃火实;J:脾脏阳气亏虚",
            "证候答案": "",
            "证候选项": "A:暑温;B:冲任受损;C:气血两亏;D:少阳阳明合病;E:风邪外束;F:脾胃受制;G:阴虚内热;H:虚风内动;I:气虚血弱;J:肝脾不调",
            "临证体会": ""
        },
        "task_5": "辨证：此为湿热内蕴，肝胆失疏之证。患者因洗澡受凉后发热，且热无定时，后转为定时发热，中午起，入暮退，此为湿热郁蒸，邪热伏于半表半里之象。耳聋、目眩、口苦、咽中干热，为肝胆湿热上扰清窍之征。脘腹及左下腹作胀，胃纳欠馨，提示湿热阻滞中焦，影响脾胃运化。舌红苔薄黄，脉弦数，亦为湿热内蕴，肝胆失疏的脉象和舌象特征。患者有肝硬化、脾切除史，更易导致湿热内生，肝胆疏泄失常。故辨证为湿热内蕴，肝胆失疏之证。"
    },
    {
        "input": {
            "案例编号": "病例351",
            "临床资料": "刘某，女，52岁。初诊:1977年4月9日。主诉及病史:1976年12月开始阴道出现不规则出血，1977年3月7日经某医院诊断为子宫体腺瘤，于4月8日手术。手术中出血甚多，曾输血3000ml。手术后小便点滴俱无，出现恶心呕吐，曾用西药利尿脱水剂速尿及甘露醇等，28小时后小便仍点滴俱无。检查血二氧化碳结合力为33~36容积%，非蛋白氮102mg%，诊断为急性肾功能衰竭、酸中毒，于4月9日下午请急会诊。诊查:患者呈急性病容，恶心呕吐，小便点滴俱无。脉沉细无力而数，舌胖嫩，色稍青紫，苔薄白而润稍粘，汗多。",
            "病机答案": "",
            "病机选项": "A:气血两虚;B:血瘀;C:肺气闭塞不能通调水道;D:阳明脉虚;E:瘀血阻滞胞脉;F:肾水不足;G:肝气不疏;H:失于治节;I:肾病及脾;J:湿热内郁",
            "证候答案": "",
            "证候选项": "A:肝肾阴虚;B:暑湿郁于阳明之腑;C:木火刑金;D:气阴两虚兼血瘀;E:肝风上扰;F:湿浊凝聚;G:瘀血阻塞清窍;H:脾肾虚衰;I:肾阴不充;J:气血失和",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：气阴两虚，血瘀水停\n\n解析：根据刘某的临床表现，手术后出现急性肾功能衰竭、酸中毒，表现为小便点滴俱无，恶心呕吐，脉沉细无力而数，舌胖嫩，色稍青紫，苔薄白而润稍粘，汗多，这些症状提示气阴两虚。气虚不能推动血液运行，阴虚则血液黏稠，加之手术大量出血，导致血瘀，血瘀又影响水液代谢，形成水停，故辨证为气阴两虚，血瘀水停。"
    },
    {
        "input": {
            "案例编号": "病例266",
            "临床资料": "孙某，女，38岁。初诊：1978年11月3日。主诉及病史：乙型脑炎后遗症已3个多月。1978年8月21日，突然出现发热头痛，继而高烧昏迷、抽搐，经县某医院诊断为乙型脑炎。经中西药治疗20余日，神志清醒，抽搐停止，仍有低烧；又治疗一个半月，体温正常，逐渐可以站立和行走，但出现心急烦躁，坐立不宁，通宵不眠，说话不清，语无伦次，记忆力丧失，一般文字和熟人均不认识。经洛阳地区精神病院检查诊断为乙型脑炎后遗症。曾服氯丙嗪等无效而来求诊。诊查：症见心急烦躁，坐立不宁，乱走不停，说话不清，问答语无伦次，好哭泣，记忆力丧失，一般文字和熟人均不识，失眠，恐惧，无意识动作不休，如手摸头发，捂眼等。无食欲，需强制饮食，1日3～4两，口干不欲饮水，四肢有时轻度抽搐。面色眺白，身体消瘦，神志呆痴，表情急躁不安，舌苔薄黄少津，舌质淡暗，舌体胖大，脉象细滑而数。",
            "病机答案": "",
            "病机选项": "A:肾阳虚;B:余热未清;C:气壅上逆;D:湿与热结;E:湿热郁阻中焦;F:血海空虚;G:痰湿未化;H:脾胃虚弱;I:心脾受伤;J:耗损肺肾之气阴",
            "证候答案": "",
            "证候选项": "A:肝血瘀阻;B:风湿流窜经络;C:痰蒙清窍;D:搏于血脉;E:高热伤津;F:湿痰阻滞经络;G:风痰阻络;H:热深厥深;I:痰饮化热;J:肝失温养",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：心脾两虚，肝风内扰，兼有余热未清。\n\n解析：根据孙某的临床表现，可以观察到她有心急烦躁、坐立不宁、乱走不停、说话不清、记忆力丧失、失眠、恐惧、无意识动作不休等症状，这些都是心脾两虚的表现。心主神明，脾主运化，心脾两虚则神志失养，故出现记忆力丧失、神志呆痴、表情急躁不安等症状。同时，肝风内扰表现为四肢有时轻度抽搐，这也是肝风内动的特征。此外，舌苔薄黄少津、舌质淡暗、舌体胖大、脉象细滑而数，提示体内仍有余热未清，热邪扰动心神，加重了病情。因此，综合分析，孙某的辨证为心脾两虚，肝风内扰，兼有余热未清。治疗上应以补益心脾、清热熄风、安神定志为主。"
    },
    {
        "input": {
            "案例编号": "病例34",
            "临床资料": "薛某，男，51岁。初诊:1985年2月4日。主诉及病史:平时血压低，白细胞减少，经服中药后，恙情已有好转。近因工作劳累，血压又见下降，且多在晚间或夜间发病，初感腰酸，继而少腹膜胀、气多，约半小时缓解。西医确诊为:腹型癫痫，但治疗效果不显。诊查:兹诊脉象缓弦无力，舌质淡白少苔。",
            "病机答案": "",
            "病机选项": "A:肝气横逆;B:脾阳司运化之职;C:血虚;D:肝气不疏;E:气化无力;F:风温之邪侵袭肺卫;G:气阴两虚;H:命火衰微;I:痰热结聚;J:外感疫毒入里",
            "证候答案": "",
            "证候选项": "A:肾水无制;B:心包肝胆热迫;C:肾气不足;D:气滞血瘀;E:脾阳虚;F:脾肾阳虚;G:脾失统摄;H:肝郁痰浊;I:阴虚肺燥;J:气化不利",
            "临证体会": ""
        },
        "task_5": "辨证：脾肾阳虚，气机升降失常\n\n解析：薛某，男，51岁，主诉及病史显示其平时血压低，白细胞减少，近因劳累导致血压下降，伴有腰酸、少腹胀满、气多等症状，且症状多在晚间或夜间发作，西医诊断为腹型癫痫，但治疗效果不佳。从中医角度分析，脉象缓弦无力，舌质淡白少苔，提示脾肾阳虚，气机升降失常。脾为后天之本，主运化水谷精微，肾为先天之本，主藏精，主水，主纳气。脾肾阳虚，气机升降失常，导致水谷精微运化失常，气机不畅，故出现腰酸、少腹胀满、气多等症状。夜间为阴盛之时，脾肾阳虚，阴盛则阳衰，故症状多在晚间或夜间发作。治疗应以温补脾肾，调和气机为主。"
    },
    {
        "input": {
            "案例编号": "病例317",
            "临床资料": "周某，女，50岁。初诊：1978年10月9日。主诉及病史：干咳，入夜尤甚，咳时无痰，胸中闷胀。诊查：唇舌及咽喉灼干，声音略带嘶哑，心烦，食欲减退，无苔，脉数无力。",
            "病机答案": "",
            "病机选项": "A:气血两虚;B:肾亏;C:寒湿之邪乘虚侵袭;D:虚热内灼;E:心火又灼肺;F:湿聚痰生;G:气血两虚;H:气虚血衰;I:肺阴虚;J:脾失健运",
            "证候答案": "",
            "证候选项": "A:上热下寒;B:肝肾阴虚;C:肝肾亏虚;D:湿热内蕴;E:气郁血虚;F:命火虚衰;G:肝火犯肺;H:肝肾两损;I:燥热伤津;J:上焦肺失肃降",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肺阴不足，燥热伤肺。此患者干咳无痰，夜间加重，唇舌咽喉干燥，声音嘶哑，心烦，食欲减退，无苔，脉数无力，均为肺阴亏损，燥热内生之象。肺阴不足，不能滋润肺络，故干咳；燥热伤肺，津液被耗，故唇舌咽喉干燥；燥热上扰，故心烦；肺与大肠相表里，肺燥则影响食欲；无苔，脉数无力，均为阴虚内热之征。治疗当以滋阴润肺，清燥养阴为主。"
    },
    {
        "input": {
            "案例编号": "病例163",
            "临床资料": "卢某，女，65岁。初诊：1962年11月8日。主诉及病史：病员于1951年曾患肺结核吐血，经治疗后，吐血止而咳嗽频发。1959年喉头部位开始生一小包，辗转求医，未见效验。最近喉头包块已渐大如核桃，吞咽和发音困难，经西医诊断为喉结核。诊查：就诊时，病员项下生瘰，按之甚坚硬，右手小指亦有核肿现象，其胁下亦有肿块，但时聚时散。声音嘶哑，咳吐稠痰，脉象细数，舌苔白厚。",
            "病机答案": "",
            "病机选项": "A:湿浊凝滞;B:脾运失健;C:肝气不疏;D:表里不清;E:痰阻肺道;F:热结膀胱;G:气滞血瘀;H:阴虚生热;I:阴精消烁;J:浊阴不降",
            "证候答案": "",
            "证候选项": "A:少阳阳明合病;B:肝血瘀阻;C:阴虚生热夹痰;D:肝阳上亢;E:风寒湿痹;F:内夹积滞;G:肠胃湿热;H:阴亏之体;I:湿热中阻;J:内伤阳络",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：此为痰凝血瘀，肺肾阴虚之证。病员曾患肺结核，病久伤阴，肺肾阴虚，阴虚则生内热，热灼津液，津液不能上承，聚而为痰，痰随气机升降，上壅于喉，故喉头生核，声音嘶哑；肺失宣降，故咳嗽频发，咳吐稠痰；肾阴不足，虚火上炎，亦可致喉核肿大。此外，阴虚血燥，血行不畅，瘀血内停，故胁下时有肿块；脉细数，舌苔白厚，均为阴虚内热，痰湿内蕴之象。右手小指核肿，亦为痰湿凝聚局部之表现。治疗当滋阴清热，化痰散结，活血化瘀。"
    },
    {
        "input": {
            "案例编号": "病例176",
            "临床资料": "张某，男，3岁。主诉及病史:患儿受凉伤食，发热汗出，气逆咳嗽，病已7日。曾服疏表宣肺之剂多付，病有增无减，每日午后壮热尤甚，彻夜咳嗽不休，不能合目。诊查:小便黄少，大便秘结3日。舌苔微黄而燥，指纹色紫，脉滑数。",
            "病机答案": "",
            "病机选项": "A:肝阳上扰清窍;B:外邪袭肺;C:入里化热;D:阳明热炽;E:湿热内蕴;F:热毒水湿上攻;G:胃中失和;H:神不守舍;I:炼液为痰;J:损伤中气",
            "证候答案": "",
            "证候选项": "A:热利伤津;B:气血两虚;C:阳明燥实;D:清窍失灵;E:湿热闭于气分;F:外感夹滞;G:胃热炽盛;H:移热于小肠;I:脾湿内盛;J:气滞血瘀",
            "临证体会": ""
        },
        "task_5": "辨证：表邪未解，里热已成，肺胃热盛。\n\n解析：患儿受凉伤食后出现发热汗出、气逆咳嗽，且病程已7日，说明表邪虽在，但已逐渐内传。午后壮热尤甚，彻夜咳嗽不休，不能合目，提示里热已盛，影响肺的宣降功能。小便黄少，大便秘结3日，舌苔微黄而燥，指纹色紫，脉滑数，均为里热炽盛的表现，尤其是肺胃热盛的特征。因此，辨证为表邪未解，里热已成，肺胃热盛。治疗上应考虑清热解毒，宣肺化痰，同时兼顾解表。"
    },
    {
        "input": {
            "案例编号": "病例207",
            "临床资料": "李某，女，4岁半。初诊：1984年2月27日。主诉及病史：患儿于1983年11月2日始发热，伴小便频数，短涩疼痛。某医院诊为急性肾炎、急性尿路感染，经中西药治疗，症状稍缓，但未痊愈。1984年2月23日夜间，突发神昏，失语，摇头等症状，经中西药治疗无效，于2月27日请张老会诊。诊查：身热不退，朝轻暮重，神识昏蒙，时清时昧，失语，摇头，呵欠频作，肢体萎软，呕恶厌食，二便失禁。舌淡红、苔白腻脉细弦。",
            "病机答案": "",
            "病机选项": "A:脾不健运;B:湿热蒙蔽心窍;C:湿热留恋气分;D:脾胃虚弱;E:营血不足;F:肝肾之阴不足;G:痰浊内蕴;H:瘀血阻于经隧脉络;I:气血虚损;J:冲气上逆",
            "证候答案": "",
            "证候选项": "A:痰郁化热;B:春温夹湿;C:热伤胃阴;D:脾阳虚;E:湿热内蕴;F:风痰窜络;G:酒湿阻络;H:疏泄失于条达;I:气滞血瘀;J:卫外不固",
            "临证体会": ""
        },
        "task_5": "辨证：湿热内蕴，蒙蔽心包，肝风内动。\n\n解析：根据患儿的临床表现，可以辨证为湿热内蕴，蒙蔽心包，肝风内动。具体分析如下：\n\n1. 身热不退，朝轻暮重：提示体内有湿热之邪，且湿热之邪随日间阴阳变化而有轻重之分，暮时阳气内敛，湿热之邪易盛。\n\n2. 神识昏蒙，时清时昧：湿热之邪上扰心神，蒙蔽心包，导致神志不清，时而清醒，时而昏蒙。\n\n3. 失语，摇头，呵欠频作：肝风内动，影响语言功能，摇头和呵欠频作是肝风内动的表现。\n\n4. 肢体萎软，呕恶厌食，二便失禁：湿热之邪影响脾胃功能，导致肢体无力，消化不良，二便失禁。\n\n5. 舌淡红、苔白腻脉细弦：舌象提示体内有湿邪，脉象细弦提示肝风内动。\n\n综上所述，患儿的病情属于湿热内蕴，蒙蔽心包，肝风内动的证候。治疗上应以清热利湿，开窍醒神，平肝熄风为原则。"
    },
    {
        "input": {
            "案例编号": "病例119",
            "临床资料": "张某，男，40岁。主诉及病史：患者平素嗜好烟酒，于5年前开始出现肛门周围皮肤阵发性发痒，每次发作约2～3分钟，未进行治疗。近1年来痒痛逐渐加剧，痒比痛重，常用手搔抓止痒，经西药外用无效。伴见胸闷不适，纳谷不香，坐卧不安。诊查：口苦，舌质淡，苔黄腻，脉弦数。肛门周围皮肤粗糙变厚，苔藓样变，有抓痕，皲裂，分泌物多色黄而腥臭。",
            "病机答案": "",
            "病机选项": "A:下元虚寒;B:心阴;C:虚热上蒸;D:心神亏虚;E:湿热内生;F:热邪伤阴;G:肝郁;H:湿郁生痰;I:脾胃虚弱;J:痰湿未化",
            "证候答案": "",
            "证候选项": "A:肾水不足;B:湿热郁结;C:上热下寒;D:心肺脾(胃)积热;E:浊湿阻滞中焦;F:虚风内动;G:湿痰化燥;H:湿热下注膀胱;I:脾虚湿热下注;J:脾胃虚弱",
            "临证体会": ""
        },
        "task_5": "辨证：湿热下注，蕴结肛周，肌肤失养\n\n解析：根据患者临床表现，可以辨证为湿热下注，蕴结肛周，肌肤失养。患者长期嗜好烟酒，易致湿热内生，湿热下注肛门周围，导致皮肤瘙痒、疼痛，且伴有胸闷不适、纳谷不香、坐卧不安等湿热内蕴的症状。口苦、舌质淡、苔黄腻、脉弦数均为湿热内蕴的表现。肛门周围皮肤粗糙变厚、苔藓样变、抓痕、皲裂、分泌物多色黄而腥臭，均为湿热蕴结肛周，肌肤失养所致。治疗上应以清热利湿、养血润燥为主，可选用龙胆泻肝汤加减，以清热利湿，养血润燥，缓解肛周湿热症状。同时，建议患者戒烟限酒，调整饮食结构，避免辛辣刺激食物，保持肛周清洁干燥，以促进病情恢复。"
    },
    {
        "input": {
            "案例编号": "病例256",
            "临床资料": "陈某，男，46岁。初诊：1976年11月25日。主诉及病史：1976年11月10日起畏寒发热，头痛身痛，咳嗽吐稀白痰。前医认为感冒而用发散药未效，仍然畏冷寒战，咳嗽咯痰增多。11月18日晨起咯吐咖啡色脓样痰约100ml，且右胸疼痛，食欲减退，全身乏力，口干尿黄，大便结。11月22日在某医院胸透发现右侧第1前肋间有较大的厚壁透光区。11月24日又拍胸片，证实为右上肺脓疡。于1976年11月25日急诊住入我院，邀余会诊。诊查：患者舌质红，苔白腻，脉弦数，体温38.6℃。",
            "病机答案": "",
            "病机选项": "A:脾胃不健;B:血虚生热;C:痰热壅肺;D:阴虚肺燥;E:肾病及脾;F:脾气虚;G:下元亏损;H:肝肺被伤;I:湿滞未净;J:痰瘀交阻",
            "证候答案": "",
            "证候选项": "A:血溢气虚;B:风痰阻络;C:肝郁气滞;D:痰热壅肺;E:痰热结聚;F:灼伤阳络;G:肾水无制;H:湿热结滞肠道;I:肺气郁闭;J:伤寒夹食之证",
            "临证体会": ""
        },
        "task_5": "辨证：此乃肺热蕴结，痰瘀互阻之证。患者畏寒发热，咳嗽吐稀白痰，后转为咯吐咖啡色脓样痰，右胸疼痛，食欲减退，全身乏力，口干尿黄，大便结，舌质红，苔白腻，脉弦数，体温38.6℃，皆为肺部感染化脓，热毒内盛，痰湿阻滞，气血运行不畅之象。肺主气，司呼吸，肺热痰瘀互阻，影响肺气宣降，故见咳嗽、胸痛等症状。热毒内盛，耗伤津液，故见口干尿黄。大便结为热邪伤津，肠道失润所致。综上所述，此为肺热痰瘀互阻之证。治疗当以清热解毒，化痰散结，活血通络为法。"
    },
    {
        "input": {
            "案例编号": "病例60",
            "临床资料": "费某，男，30岁。初诊:1970年3月20日。主诉及病史:患者于某日晚11时，突发呼嚎，自诉喉中有痰梗塞，呼吸不利，旋即不语，陷入昏迷，次日清晨送往本院抢救，在来院途中四肢抽搐，发作频繁，约有6次之多，体温37.9℃，血压140/90mmHg，二氧化碳结合力26容积%，非蛋白氮164mg%，肌酐8.4mg%。西医诊断为急性肾功能衰竭，用西药治疗3天，神识仍未清醒，乃延中医会诊。诊查:症见意识障碍，神志昏迷，瞳孔等大，对光反射迟钝，项颈稍有强直，腹胀满，大便已七八日未行，尿量减少，色黄赤，舌苔焦黑而干，质红。脉象弦数。",
            "病机答案": "",
            "病机选项": "A:热毒水湿上攻;B:郁久化热生痰;C:清窍受蒙;D:累及中、下二焦;E:阴虚;F:湿热流注于下;G:阳明受累;H:脾气不运;I:三焦不利;J:命火衰微",
            "证候答案": "",
            "证候选项": "A:热结阳明;B:风水相搏;C:三焦决渎不通;D:内伤阳络;E:瘀血凝滞;F:湿热结滞肠道;G:邪蒙心窍;H:脾胃不和;I:湿热下注;J:痰湿阻滞经络",
            "临证体会": ""
        },
        "task_5": "辨证：热毒内闭，腑气不通，肾功能衰竭。\n\n此患者突发昏迷，伴有喉中痰阻感，呼吸不利，四肢抽搐，高热，以及肾功能指标异常（如二氧化碳结合力、非蛋白氮、肌酐等升高），提示体内有严重的热毒内盛。同时，患者腹胀满，大便七八日未行，尿量减少，色黄赤，舌苔焦黑而干，质红，脉象弦数，这些症状和体征均指向热毒内闭，腑气不通的病机。在中医理论中，热毒内盛可以导致神志昏迷，而腑气不通则表现为大便秘结，尿量减少，这些都是肾功能衰竭的临床表现。因此，综合分析，该患者的辨证为热毒内闭，腑气不通，肾功能衰竭。治疗上应以清热解毒，通腑泄热，保护肾功能为主。"
    },
    {
        "input": {
            "案例编号": "病例130",
            "临床资料": "宋君，25岁。初诊：1958年1月14日。主诉及病史：高堕撞跌头脑山骨已两天，当时有短暂昏迷；局部血肿，形若半球，按之柔软；神志时明时昧，伴有呕恶不思食。诊查：左侧手足软弱无力，视物不清，微有身热。苔薄腻，脉细。",
            "病机答案": "",
            "病机选项": "A:脾胃健运力差;B:肝气不疏;C:清阳浊阴升降失调;D:气血凝滞;E:心之气阴两虚;F:顽痰阻络;G:湿热郁阻中焦;H:热结阳明;I:胃失和降;J:瘀凝脑髓",
            "证候答案": "",
            "证候选项": "A:风湿内侵;B:湿阻血瘀;C:脾肾两虚;D:阳亢风动;E:痰浊壅遏;F:统率无权;G:瘀血凝滞;H:肾阴不充;I:肝肾阴虚;J:热入血室",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：此为外伤所致的瘀血阻络，兼有肝胆之火上逆。患者因高处坠落撞击头部，导致局部血肿，按之柔软，说明有瘀血形成。神志时明时昧，伴有呕恶不思食，是瘀血阻滞清窍，影响神志和脾胃功能的表现。左侧手足软弱无力，视物不清，提示瘀血影响了肢体的经络和目窍。微有身热，苔薄腻，脉细，反映体内有轻微的热象，但主要病机在于瘀血阻滞。因此，治疗应以活血化瘀，清肝泻火为主。"
    },
    {
        "input": {
            "案例编号": "病例212",
            "临床资料": "周某，女，25岁。初诊：1978年8月14日。主诉及病史：患者剧烈头痛、呕吐，腰穿为血性脑脊液，诊断为蛛网膜下腔出血。入院后用降压、止血及对症诸疗法，病情加重，于1978年8月14日邀我会诊治疗。诊查：患者神昏谵语。舌质红绛，苔干黄，脉弦数。",
            "病机答案": "",
            "病机选项": "A:冲任受损;B:复感寒邪;C:心移热于小肠;D:肾气不足;E:气血运行不畅;F:肝阳上亢化火;G:气血两虚;H:湿热郁阻中焦;I:脾运失健;J:肝郁",
            "证候答案": "",
            "证候选项": "A:痰热扰神;B:水邪上凌心肺;C:肝肾阴虚;D:肝肾两损;E:腠理开阖不利;F:肝阳上亢;G:脾虚湿滞;H:足太阳湿热;I:心胆亏虚;J:脾肾不足",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：此为热入血室，血热扰心之证。患者因蛛网膜下腔出血，血溢脉外，血热炽盛，上扰心神，故见神昏谵语。舌质红绛，苔干黄，脉弦数，均为热邪亢盛之象。治疗当以清热凉血，开窍醒神为主。可选用清营汤合安宫牛黄丸，以清热解毒，凉血开窍，同时配合西医的降压、止血等对症治疗，以期控制病情，保护脑功能，促进患者康复。"
    },
    {
        "input": {
            "案例编号": "病例24",
            "临床资料": "孙某，男，64岁。初诊:1972年9月13日。主诉及病史:8月21日晚，突感舌根发硬，说话吐字不清。次日，自觉步态不稳，左手持物不紧，有时自行落地，口中流涎，舌稍向左偏。在某医院检查，诊为闭塞性脑血管病。用血管舒缓素、烟酸、针灸等治疗，病情略有好转。诊查:体形稍胖，右侧眼裂较小，鼻唇沟变浅，口角略向左侧歪斜，左手握力较差。伸舌向左偏斜，舌苔根部稍厚，脉弦紧。",
            "病机答案": "",
            "病机选项": "A:阴虚;B:阴血亏;C:宿瘀未化;D:肾水不足;E:痰湿内阻;F:心阴;G:食郁于胃;H:肝阳上亢;I:气血不畅;J:本大虚而标实盛",
            "证候答案": "",
            "证候选项": "A:肝肾阴虚;B:脾失健运;C:热深厥深;D:风痰阻闭经络;E:心肾阴虚;F:肝阴不足;G:脾胃虚弱;H:湿热;I:肝郁气滞;J:肝胆湿热郁滞",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：风痰阻络，肝阳上亢\n\n孙某的症状表现为突然出现的舌根发硬、说话不清、步态不稳、左手无力、口角歪斜和流涎，这些症状与中医理论中的“中风”相符合。中医认为，中风多由肝阳上亢、风痰阻络所致。患者体形稍胖，可能有痰湿内盛的倾向，而舌苔根部稍厚也支持了痰湿的存在。脉弦紧是肝阳上亢的脉象特征，表示肝气不舒，阳气上逆。因此，辨证为风痰阻络，肝阳上亢，治疗上应以平肝熄风、化痰通络为主。"
    },
    {
        "input": {
            "案例编号": "病例200",
            "临床资料": "汤某，女，7岁。初诊：1979年10月13日诊查：患儿双下肢紫斑，成块成片，足肿，小便黄，口干，心烦。苔白，舌质红，脉细数。",
            "病机答案": "",
            "病机选项": "A:风邪闭于肌表;B:痰湿内阻;C:热伤血络;D:郁热;E:湿热下注;F:正气已衰;G:肾阳虚;H:肾元不固;I:阴血亏;J:水不涵木",
            "证候答案": "",
            "证候选项": "A:阻滞肠道;B:气滞血瘀;C:痰热结聚;D:营卫失和;E:痰热互结;F:湿热伤血;G:血虚生风;H:肝脾两虚;I:清窍失灵;J:阴虚肝郁",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：血热妄行，湿热内蕴\n\n解析：根据汤某的临床表现，双下肢出现紫斑，成块成片，足部肿胀，小便黄，口干，心烦，舌质红，脉细数，苔白，这些症状提示存在血热妄行和湿热内蕴的情况。血热妄行表现为紫斑，是由于热邪迫血，血行加速，血溢脉外所致。湿热内蕴则表现为足肿、小便黄，是湿热下注，影响水液代谢，导致局部水肿和小便异常。口干、心烦、舌质红、脉细数也是血热和湿热的常见表现，说明体内有热邪存在。因此，辨证为血热妄行，湿热内蕴。"
    },
    {
        "input": {
            "案例编号": "病例81",
            "临床资料": "徐某，男，4个月。初诊:1977年3月12日。主诉及病史:患儿出生后1个月脸面部即起红斑丘疹，渐向额部及头部扩展，糜烂流水，遇热痒甚，晚上常哭闹不安，小便短赤。曾在中医内科治疗半月无效。诊查:营养中等，面色红润，脸面、头皮成片红斑，伴有密集水疱，部分皮损显露出鲜红色的糜烂面，渗出液较多，伴有较多的痂皮。",
            "病机答案": "",
            "病机选项": "A:火热内扰心神;B:暑湿束表;C:胎毒湿热;D:脾肾阳虚;E:血瘀水停;F:热邪伤阴;G:风湿热邪;H:气血双亏;I:痰热互结;J:热盛化火",
            "证候答案": "",
            "证候选项": "A:热灼营阴;B:脾虚运化不及;C:湿热蕴肤;D:肝脾两虚;E:痰热上扰;F:脾虚生湿;G:饮热蕴结;H:营卫不和;I:热入血室;J:痰热互结",
            "临证体会": ""
        },
        "task_5": "辨证：湿热蕴肤，胎毒未清。\n\n解析：根据患儿的症状，出生后1个月即出现面部红斑丘疹，渐向额部及头部扩展，糜烂流水，遇热痒甚，晚上常哭闹不安，小便短赤，这些都是湿热蕴肤的表现。湿热之邪侵袭肌肤，导致皮肤红肿、糜烂、流水，遇热痒甚，说明湿热之邪在体内郁积，加之患儿为新生儿，胎毒未清，胎毒与湿热相合，加重了皮肤症状。晚上常哭闹不安，小便短赤，也是湿热内蕴的表现。因此，辨证为湿热蕴肤，胎毒未清。治疗上应清热解毒，利湿止痒，同时注意胎毒的清除。"
    },
    {
        "input": {
            "案例编号": "病例246",
            "临床资料": "某女，48岁。初诊：1974年12月6日。主诉及病史：1954年8月患痢疾，时缓时剧，绵延20年，经武汉、北京等地医院治疗未效。后剖腹探查，诊断为“结肠溃疡”。1974年12月6日就诊于余。诊查：患者形体消瘦，精神疲乏，食欲不振，面色少华，常畏寒；大便时下脓血，便色乌黑，下血前常有多汗、小腹急痛，但无后重感，大便无血时则稀溏而色如果酱，或带白色粘液。近来发生上腹部满胀，每于饥饿时刺痛，得食则减，遇寒则剧，口泛酸水。月经时断时潮；潮前小腹刺痛，经色乌黑。脉沉迟细弱。",
            "病机答案": "",
            "病机选项": "A:虚火上炎;B:肠滑不固;C:风邪闭于肌表;D:脾肾虚寒;E:气化无力;F:久咳肺气先虚;G:络伤血瘀;H:清阳不升;I:湿热蒙蔽心窍;J:内有郁热",
            "证候答案": "",
            "证候选项": "A:脾胃虚寒;B:暑温动风;C:春温夹湿;D:虚火上炎;E:慢脾风象;F:少阳经腑同病;G:肝肾亏虚;H:邪蒙心窍;I:肠滑不固;J:湿热闭于气分",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：脾肾阳虚，寒湿内蕴，兼有瘀血\n\n解析：根据患者长期的痢疾病史，以及形体消瘦、精神疲乏、食欲不振、面色少华、畏寒等症状，可以判断患者存在脾肾阳虚的情况。脾肾阳虚导致寒湿内蕴，寒湿下注则表现为大便时下脓血，便色乌黑，且下血前有多汗、小腹急痛的症状。大便无血时则稀溏而色如果酱，或带白色粘液，也是寒湿内蕴的表现。上腹部满胀、饥饿时刺痛、遇寒则剧，以及口泛酸水，均提示寒湿上逆，影响脾胃功能。月经时断时潮，潮前小腹刺痛，经色乌黑，提示有瘀血存在。脉沉迟细弱，也符合脾肾阳虚的脉象特征。因此，综合分析，患者的辨证为脾肾阳虚，寒湿内蕴，兼有瘀血。"
    },
    {
        "input": {
            "案例编号": "病例38",
            "临床资料": "吴某，男，59岁。初诊:1975年8月3日。主诉及病史:于1974年9月9日经某医院诊为“乳糜血尿”而住院，因不愿手术，于7月15日出院。8月3日来我院门诊求治。诊查:当时面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起。脉象缓细无力，舌苔淡如菜根。",
            "病机答案": "",
            "病机选项": "A:脾弱湿盛;B:兼有湿热;C:肾气不固;D:脾肾阳虚;E:水气搏结;F:耗伤阴血;G:上溢而衄;H:胃气上逆;I:水邪泛滥;J:痰湿内阻",
            "证候答案": "",
            "证候选项": "A:湿热下注;B:湿热化燥;C:热入营血;D:脾虚湿热下注;E:脾胃不和;F:肝郁血滞;G:湿阻血瘀;H:下元虚损;I:血虚阳弱;J:气滞血瘀",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肾气不固，气血两虚，湿热下注\n\n吴某的临床表现，包括严重贫血、尿中血条、行动不便、脉象缓细无力以及舌苔淡如菜根，提示了肾气不固和气血两虚的状况。肾气不固，指的是肾脏功能失调，不能固摄精微，导致精血下泄，表现为乳糜血尿。同时，气血两虚，说明身体的气血生化功能减退，导致面色苍白、贫血和体力衰弱。湿热下注，则是由于湿热邪气下注膀胱，引起尿血等症状。综合来看，吴某的病情属于肾气不固、气血两虚和湿热下注的复合证候。"
    },
    {
        "input": {
            "案例编号": "病例108",
            "临床资料": "朱某，女，67岁。初诊：1970年9月.主诉及病史：口中常有甜味已2个多月，饮水亦觉水有甜味，食管和胃部有不适感，经常恶心，胃纳很差，胃中饱滞，每天只能在晨间吃1个鸡蛋和半杯白粥，整天不再进食。近10多天发热，体温在37.5～39℃之间，伴尿频尿急。有胃病史，发作时要服用苏打片，大便常秘结，十几年来靠服芦荟丸才能解出大便。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感。精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，不愿进食。过去嗜食糖。患此病后拒绝食糖，不肯服食甜味、苦味和辣味的药品，也拒绝住院治疗。曾请西医治疗未效，特请中医诊治。",
            "病机答案": "",
            "病机选项": "A:血瘀水停;B:脾胃亏损;C:气化不利;D:血枯火秘证;E:清窍被蒙;F:脾胃不健;G:肾气虚;H:肝经湿热下注;I:三焦不利;J:心气虚",
            "证候答案": "",
            "证候选项": "A:督脉瘀阻;B:肝肾亏虚;C:肝肾阴虚;D:心脾肾虚;E:外感风温;F:三焦决渎不通;G:冲任受损;H:肝失温养;I:风温时邪;J:脾虚不运",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：脾虚湿热，胃失和降\n\n解析：患者口中常有甜味，饮水亦觉水有甜味，此为脾虚湿热之象，脾虚不能正常运化水湿，湿热内生，上泛于口，故口甜。食管和胃部不适，经常恶心，胃纳很差，胃中饱滞，均为胃失和降的表现，湿热阻滞中焦，影响脾胃的正常功能，导致消化不良，食欲减退。发热、尿频尿急，提示湿热下注，影响膀胱和泌尿系统。大便常秘结，十几年来靠服芦荟丸才能解出大便，说明湿热久蕴，影响肠道功能，导致大便干结。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感，精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，均为脾虚湿热影响心神的表现。患者过去嗜食糖，加重了脾虚湿热的状况，患病后拒绝食糖，是对湿热体质的自我调节。拒绝服食甜味、苦味和辣味的药品，也反映了湿热体质对刺激性食物的敏感。综合以上症状，辨证为脾虚湿热，胃失和降。"
    },
    {
        "input": {
            "案例编号": "病例243",
            "临床资料": "张某，男，65岁。主诉及病史：患者平素逸多劳少，体弱而肥，动则喘气，善太息，心慌，心悸不安，稍事劳动即感体力不支，尤以汗出为甚，稍动则汗出淋漓，虽在冬月，头项亦汗出蒸蒸，额鼻冒出汗珠，常导致感冒。近3个月来，症状转化，由白天出汗转为晚间出汗，寐则汗出，寤则汗收，衣被常湿，形寒畏冷，弱不禁风，伴之以胸闷心痛，四肢厥冷，气短不足以息。西医诊断：冠状动脉供血不足，伴自主性神经功能紊乱。诊查：脉沉细，舌质暗淡、苔淡黄。体胖而皮肤反枯，衣物内冒出汗臭气，口唇带紫而干。",
            "病机答案": "",
            "病机选项": "A:肺气虚;B:肝气不疏;C:阴虚素质;D:风寒湿邪留注肌骨;E:水邪泛滥;F:气不行湿;G:肝气有余;H:化热伤阴;I:脾胃受损;J:邪在阳明",
            "证候答案": "",
            "证候选项": "A:血虚生风;B:肺胃失养;C:阴气失固;D:阴虚内热;E:气滞血瘀;F:痰蒙心窍;G:脾胃不和;H:肾水无制;I:肺金失养;J:阳明积热",
            "临证体会": ""
        },
        "task_5": "辨证：系心脾两虚，气阴不足，心阳不振，营卫失调。\n\n解析：患者体弱而肥，动则喘气，心慌心悸，稍事劳动即感体力不支，且汗出淋漓，这些症状表明患者存在心脾两虚的情况。心主血脉，脾主运化，心脾两虚则气血生化不足，不能滋养全身，故见体弱、心慌、心悸、体力不支等症状。汗出淋漓，虽在冬月亦汗出蒸蒸，额鼻冒出汗珠，提示气阴不足，营卫失调，卫气不固，不能固摄汗液，故汗出异常。\n\n近3个月症状转化，由白天出汗转为晚间出汗，寐则汗出，寤则汗收，衣被常湿，形寒畏冷，弱不禁风，伴之以胸闷心痛，四肢厥冷，气短不足以息，这些症状进一步说明患者心阳不振，营卫失调。心阳虚则不能温煦四肢，故四肢厥冷；心阳不振，血脉运行不畅，故胸闷心痛；气短不足以息，提示气虚，不能推动血液运行，加之心阳不足，故见气短。\n\n脉沉细，舌质暗淡、苔淡黄，体胖而皮肤反枯，衣物内冒出汗臭气，口唇带紫而干，这些脉象和舌象均支持心脾两虚，气阴不足，心阳不振，营卫失调的辨证。脉沉细提示气血不足，舌质暗淡、苔淡黄提示心脾功能减退，皮肤反枯、口唇带紫而干提示气血不荣，汗臭气提示汗液异常，与营卫失调相关。"
    },
    {
        "input": {
            "案例编号": "病例31",
            "临床资料": "关某，女，20岁。初诊：1977年11月15日。主诉及病史：患者1年前丧父，悲恸至极，又因工作、生活不顺心，情志怫郁。2个月前，开始头晕头痛，多梦失眠，心烦易怒。1周前其父逝世周年，亲属毕至，悲恸异常，当晚睡中突然精神错乱，语无伦次，哭闹不休。经山东某医院神经科诊为精神分裂症。11月15日查房时，患者正阵发性发作烦躁，精神错乱，语无伦次，哭闹不休，躁动不宁，不知秽洁，时欲出走。俟神志略清时，自诉头晕、头重、巅顶有压迫感，胸闷，善太息，善惊，恶闻人声，失眠、多梦，饮食喜冷，大便干、数日一行，小便黄赤。诊查：六脉洪滑数、100次/分，舌苔黄褐厚、舌红、舌尖绛。",
            "病机答案": "",
            "病机选项": "A:阴虚阳亢;B:清阳失展;C:瘀阻血络;D:脏腑气血功能紊乱;E:情志失调;F:清阳浊阴升降失调;G:痰热结聚;H:生湿成痰;I:肝气郁结;J:火升风动",
            "证候答案": "",
            "证候选项": "A:肝肾不足;B:心火内炽;C:肝气犯胃;D:水邪凌胸;E:气血两虚;F:肝郁化火;G:迫血妄行;H:阳亢风动;I:暑湿内伏;J:痰火迷神",
            "临证体会": ""
        },
        "task_5": "辨证：情志内伤，肝郁化火，上扰心神\n\n解析：关某因丧父之痛及生活工作压力，导致情志怫郁，肝气不舒，久之肝郁化火，火邪上扰心神，出现精神错乱、语无伦次、哭闹不休等症状。肝火上炎，故头晕头痛，巅顶有压迫感，胸闷善太息，善惊恶闻人声。肝火扰心，心神不安，故失眠多梦。饮食喜冷，大便干、数日一行，小便黄赤，均为肝火内炽，热伤津液之象。六脉洪滑数，舌苔黄褐厚、舌红、舌尖绛，均为肝火上炎，热盛之象。"
    },
    {
        "input": {
            "案例编号": "病例221",
            "临床资料": "高某，男，42岁。初诊：1963年4月8日。主诉及病史：病起于7年前，因工作常常熬夜，甚至通宵达旦，继因工作不顺心，日夜思考，逐渐形成失眠。即便能睡，但合目即梦，头昏不清，神疲肢软。诊查：形体消瘦，食少纳差，胸痞肠鸣，大便稀溏。舌边红绛，舌心苔薄乏津，脉弦细。",
            "病机答案": "",
            "病机选项": "A:肝阳偏亢;B:气血瘀滞;C:阳气乃奋;D:伤及心阴;E:心气虚;F:外感温毒壅于少阳经;G:肝郁;H:脾虚;I:饮邪郁遇;J:伤瘀留滞",
            "证候答案": "",
            "证候选项": "A:气血两亏;B:热伏于里之温热重症;C:血瘀津亏;D:痰湿阻滞经络;E:肝郁脾虚;F:肝旺脾弱;G:虚风内动;H:咳久脾虚;I:肝肾阴虚;J:痰热扰神",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：心脾两虚，肝气郁结\n\n高某的临床表现符合中医心脾两虚和肝气郁结的辨证。长期熬夜和精神压力导致心脾两虚，表现为失眠、头昏、神疲肢软、食少纳差、形体消瘦等症状。心脾两虚不能滋养心神，故出现失眠、合目即梦。同时，肝气郁结，表现为胸痞肠鸣，大便稀溏，舌边红绛，舌心苔薄乏津，脉弦细，这些都是肝气郁结影响脾胃运化的表现。肝气郁结还可能导致情绪不畅，进一步影响睡眠和消化功能。因此，高某的辨证为心脾两虚，肝气郁结。"
    },
    {
        "input": {
            "案例编号": "病例352",
            "临床资料": "尹某，男，41岁.初诊:1972年8月。主诉及病史:自1964年以后经常肝区疼痛，同时伴有低烧(37.5~38.0℃)，肝功能正常，未确诊。1972年5月感冒发热，肝区疼痛突然加重，呈针刺样痛，难以忍受，经多个医院同位素、胎甲球蛋白等检查，诊断为肝癌。一直住院治疗，虽经多方处理，但发热、肝区疼痛始终未见改善，全身情况亦逐日恶化。遂来我处就诊。诊查:患者仍有肝区疼痛，胃脘胀满，低热，大便偏溏，纳差，日食半斤左右。形体消瘦，面色青暗，神乏气短。脉沉细弦数，舌青赤有瘀斑，苔薄白。肝肋下5cm，表面不甚平滑，中等硬度，压痛明显。",
            "病机答案": "",
            "病机选项": "A:风热犯肺;B:化热生痰;C:热邪下注;D:精血亏损;E:气血两虚;F:络道阻塞;G:脾虚气虚;H:气滞血瘀;I:固摄失司;J:寒凝血滞",
            "证候答案": "",
            "证候选项": "A:气血失和;B:肝阴虚;C:真阴亏损;D:肝脾不和;E:迫血妄行;F:感暑邪;G:脾肾两虚;H:肝脾两虚;I:气滞血瘀;J:肝肾阴虚",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肝郁脾虚，气滞血瘀，湿热内蕴\n\n解析：尹某的临床表现符合中医辨证中的肝郁脾虚，气滞血瘀，湿热内蕴的特征。具体分析如下：\n\n1. **肝郁脾虚**：患者有长期的肝区疼痛，伴有低烧，胃脘胀满，大便偏溏，纳差等症状，这些都是肝郁脾虚的表现。肝郁指的是肝气郁结，脾虚则表现为消化功能减弱，大便溏泻，食欲不振。\n\n2. **气滞血瘀**：肝区疼痛突然加重，呈针刺样痛，难以忍受，形体消瘦，面色青暗，舌青赤有瘀斑，这些都是气滞血瘀的典型症状。气滞指的是气机不畅，血瘀则是血液运行不畅，导致局部疼痛和面色、舌象的异常。\n\n3. **湿热内蕴**：患者低热，大便偏溏，舌苔薄白，这些都是湿热内蕴的表现。湿热内蕴可以导致消化系统功能紊乱，表现为大便溏泻，同时湿热上蒸可以引起低热。\n\n综合以上分析，尹某的辨证为肝郁脾虚，气滞血瘀，湿热内蕴，这与肝癌的中医辨证相吻合，肝癌在中医中常被归类为“积聚”、“癥瘕”等范畴，其病机多涉及肝脾功能失调，气滞血瘀，湿热内蕴等。"
    },
    {
        "input": {
            "案例编号": "病例189",
            "临床资料": "梅某，女，36岁。初诊：1961年8月19日。主诉及病史：头晕心烦，腹痛。诊查：面微赤，手足心发热，脉濡数，苔薄白质红。",
            "病机答案": "",
            "病机选项": "A:脾肾亏虚;B:郁久化热;C:瘀热蕴结;D:伤阴灼液;E:痰浊中阻;F:气血两亏;G:风湿之邪胶结;H:脾胃受伤;I:伤暑;J:脾虚",
            "证候答案": "",
            "证候选项": "A:伤脾胃;B:感暑邪;C:上焦肺失肃降;D:痰热内蕴;E:肝旺脾弱;F:心肾两亏;G:湿热中阻;H:阳明腑经湿热内攘;I:肝郁脾虚;J:积热膀胱",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：肝郁化火，脾虚湿困\n\n梅某的临床表现包括头晕心烦、腹痛，面微赤，手足心发热，脉濡数，苔薄白质红。这些症状提示存在肝郁化火和脾虚湿困的病理状态。肝郁化火表现为面微赤、手足心发热、心烦，而脾虚湿困则体现在脉濡数、苔薄白质红以及腹痛上。肝郁化火导致气血运行不畅，影响心神，脾虚湿困则影响脾胃运化功能，导致湿邪内生，影响气血的生成和运行，从而出现上述症状。治疗上应以疏肝解郁、清热泻火、健脾化湿为原则。"
    },
    {
        "input": {
            "案例编号": "病例216",
            "临床资料": "唐女，32岁。主诉及病史：高热神昏谵语1天，体温39.8℃(腋窝)。其夫仅谓其妻两天前诉及天热烦渴甚，喉间干燥，仍照常操持家务及在炼铁炉旁协助制作铁器。前日见其精神不振，但未发现有其他情况。至今日黎明忽闻其说胡话，初以为梦语，喊之不应，起而视之，面红汗出，扪其额及皮肤灼手。夜间曾解小便3次。乃急至卫生所求治。诊查：症见全身汗出，面唇红赤，用开口器强张其口，舌红苔黄燥，靠近根部舌边有糜烂点3个，咽喉粘膜充血。脉数。",
            "病机答案": "",
            "病机选项": "A:温病热灼营阴;B:瘀血凝滞;C:脾失健运;D:耗伤气阴;E:复感寒邪;F:瘀血阻滞胞脉;G:心移热于小肠;H:火热内扰心神;I:累及肾阴;J:心火又灼肺",
            "证候答案": "",
            "证候选项": "A:移热于小肠;B:兼感外邪;C:脾气虚;D:肝肾亏虚;E:肾亦受损;F:上热下寒;G:燥结便秘;H:气血两亏;I:痰瘀互结;J:扰及心神",
            "临证体会": ""
        },
        "task_5": "辨证：此为热入心包，营血分热盛。患者高热神昏谵语，面红汗出，舌红苔黄燥，咽喉粘膜充血，脉数，均为热邪深入营血分，影响心神所致。热邪炽盛，耗伤津液，故见口渴、汗出、舌红苔黄燥等症。热入心包，心神受扰，故出现神昏谵语。综合脉象、舌象及临床症状，辨证为热入心包，营血分热盛。治疗当以清热解毒，凉血开窍为主。"
    },
    {
        "input": {
            "案例编号": "病例5",
            "临床资料": "张某，女，43岁。初诊:1983年8月1日。主诉及病史(家属代诉):反复高热10余日，体温38~40℃，多汗口渴，便秘，尿少，继而出现尿闭，人工导尿已9天。曾用抗生素及清营汤、白虎汤加减治疗无效。",
            "病机答案": "",
            "病机选项": "A:湿热下注;B:热结膀胱;C:浊湿阻滞中焦;D:气化失调;E:风热犯肺;F:情志失调;G:水不涵木;H:耗伤心神;I:热邪下注;J:虚热上蒸",
            "证候答案": "",
            "证候选项": "A:血瘀气滞;B:肝脾两虚;C:玉关失固;D:肺肾阴亏;E:风痰窜络;F:血瘀;G:暑温;H:督脉瘀阻;I:湿热下注;J:痰热扰心",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：热入营血，气阴两伤，膀胱气化不利\n\n张某的症状表现为反复高热，体温高达38~40℃，多汗口渴，便秘，尿少，继而出现尿闭，这些症状表明体内有严重的热毒。长期的高热和多汗导致气阴两伤，表现为口渴和尿少。便秘进一步加重了体内热毒的积聚，而尿闭则是膀胱气化不利的表现，说明热毒已经影响到了膀胱的正常功能。在中医理论中，热入营血可以导致血热，进而影响到膀胱的气化功能，导致尿闭。因此，张某的辨证为热入营血，气阴两伤，膀胱气化不利。"
    },
    {
        "input": {
            "案例编号": "病例229",
            "临床资料": "王某，女，34岁，已婚。初诊：1984年8月9日。主诉及病史：1984年6月2日月经来潮后，至今2个月余未净，曾在某医院住院治疗，诊断为“子宫内膜炎”，用止血药及抗炎药治疗好转出院；出院后阴道仍出血不止，于1984年7月28日住入我院。妇科检查：子宫后倾，略大于正常，双侧附件增厚，压痛(+)。诊查：现阴道仍有少量出血，色暗、无血块；小腹疼痛坠胀，拒按；腹痛甚则出血多，痛缓则血少；有时腰痛；口唇发麻，睡眠多梦易惊。舌淡暗少苔，脉弦软滑(70次/分)。",
            "病机答案": "",
            "病机选项": "A:湿邪阻滞;B:固摄失司;C:脾胃不健;D:肝阳升腾;E:冲任失养;F:宿瘀未化;G:肝阴耗损;H:瘀血阻滞胞脉;I:阳明脉虚;J:湿邪夹热内郁",
            "证候答案": "",
            "证候选项": "A:心肾不交;B:肝旺湿热;C:湿热;D:脾虚不运;E:外感时疫;F:风湿内侵;G:痰瘀交结;H:心火下移小肠;I:上焦肺失肃降;J:瘀血阻络",
            "临证体会": ""
        },
        "task_5": "### 辨证\n\n辨证要点：根据王某的临床表现，辨证为冲任不固，瘀血阻滞，兼有肝郁气滞。具体分析如下：\n\n1. **冲任不固**：表现为月经周期异常，出血时间延长，出血量虽少但持续不净，提示冲任二脉功能失调，不能固摄血液，导致血行不畅。\n\n2. **瘀血阻滞**：小腹疼痛拒按，腹痛与出血量相关，出血色暗无血块，提示瘀血内阻，血行不畅，瘀血阻滞于胞宫，影响子宫的正常功能。\n\n3. **肝郁气滞**：口唇发麻，睡眠多梦易惊，舌淡暗少苔，脉弦软滑，这些症状提示肝气郁结，气机不畅，影响冲任二脉的正常运行，进而影响血液的正常循环。\n\n综上所述，王某的辨证为冲任不固，瘀血阻滞，兼有肝郁气滞。治疗上应以调和冲任，活血化瘀，疏肝解郁为主，辅以止血固摄，以期恢复子宫及冲任二脉的正常功能，达到止血、调经的目的。"
    },
    {
        "input": {
            "案例编号": "病例147",
            "临床资料": "陆某，男，47岁。初诊：1965年12月17日。主诉及病史：血压190/134mmHg。身体素健，因1年前儿子突然死亡而悲伤过度，连续彻夜不眠。嗣后常感头晕胀痛，面赤升火，心悸怔忡，尤以紧张时更甚。曾在某医院治疗，服西药并休息年余。诊查：口舌干燥。脉弦细，苔薄腻。",
            "病机答案": "",
            "病机选项": "A:阴虚火炽;B:肝失温养;C:后天失养;D:伤及心阴;E:肝风夹痰;F:痰热互结;G:寒湿之邪乘虚侵袭;H:胃失和降;I:肾水不足;J:血热夹瘀",
            "证候答案": "",
            "证候选项": "A:相火妄动;B:暑温;C:心火内炽;D:痰热;E:心肾两伤;F:脾失统摄;G:本虚标实;H:真寒假热;I:阴虚阳亢;J:痰浊壅遏",
            "临证体会": ""
        },
        "task_5": "辨证：肝阳上亢，心火亢盛，阴虚阳亢。\n\n陆某的临床表现符合中医辨证中的肝阳上亢和心火亢盛。肝阳上亢表现为头晕胀痛，面赤升火，脉弦细，苔薄腻，这些症状与肝阳上冲，扰动清窍有关。心火亢盛则表现为心悸怔忡，口舌干燥，这与心火炽盛，耗伤阴液有关。同时，由于患者有悲伤过度，彻夜不眠的病史，导致阴液耗损，阴虚不能制阳，从而形成阴虚阳亢的病理状态。这种状态在紧张时症状更甚，说明情绪波动对病情有明显影响。"
    },
    {
        "input": {
            "案例编号": "病例27",
            "临床资料": "刘某，男，40岁。初诊:1971年春。主诉及病史:胃痛已3年，经西医确诊为十二指肠球部溃疡，服过不少中西药，均无效果。每日胃痛彻背，连及两胁，饮食减少，大便不爽。从前曾有手足多汗症，自从患胃痛以后，手足出汗自止:诊查:察其脉象，沉取似觉滞涩有力，舌质舌苔无明显变化。阅其前服方药，多为理气、止痛、温中、缓泻等品。",
            "病机答案": "",
            "病机选项": "A:热搏于血;B:气血两虚;C:湿浊内结;D:清阳浊阴升降失调;E:肾阴虚;F:湿浊内盛;G:脾肾交馁;H:气血双亏;I:腐秽留滞;J:痰湿阻滞",
            "证候答案": "",
            "证候选项": "A:肝脾不调;B:血虚生风;C:气血两亏;D:血瘀;E:肾亏阴虚;F:风寒湿痹;G:燥热伤津;H:脾湿内盛;I:燥结便秘;J:肺失肃降",
            "临证体会": ""
        },
        "task_5": "辨证：肝胃不和，气滞血瘀。\n\n根据刘某的临床表现，其胃痛已持续3年，且疼痛连及两胁，这在中医辨证中常归于肝胃不和的范畴。肝主疏泄，胃主受纳，肝气郁结或肝火上炎时，可影响胃的正常功能，导致胃痛。此外，手足多汗症的自止，可能与肝气郁结，影响了手足的汗液排泄有关。胃痛连及两胁，饮食减少，大便不爽，以及脉象沉取滞涩有力，均提示有气滞血瘀的情况存在。气滞不畅，血行受阻，故疼痛持久不愈。治疗上应以疏肝理气、活血化瘀为主，辅以和胃止痛。"
    },
    {
        "input": {
            "案例编号": "病例127",
            "临床资料": "王某，女，33岁。初诊：1975年4月10日。主诉及病史：失眠10余年，今年尤为严重。近3个月来虽临睡前服安眠药，但入睡不到3小时，甚至仅睡1小时。醒后心悸不宁，烦躁，不能再入睡。上午头昏，下午头胀痛，晚上头痛尤甚，头部筋脉紧张，颈部板紧不舒，食欲不振，嗳气，健忘，精神不易集中，情绪抑郁，以往便秘，近1个月来大便日行二三次，精神疲乏，怕冷，腰酸带下。诊查：脉弦细，舌质淡青，苔薄腻。",
            "病机答案": "",
            "病机选项": "A:心失所养;B:胃阴受伤;C:胃气不降;D:精血不能濡养筋膜;E:脾不健运;F:肾气不足;G:固摄失司;H:内热;I:脾阳司运化之职;J:肾阳虚弱",
            "证候答案": "",
            "证候选项": "A:脾肾阳虚;B:脾运不畅;C:营卫失和;D:虚火内扰;E:肝脾失调;F:心脾两亏;G:胃气上逆;H:脾胃受制;I:心肝阳虚;J:脾湿内盛",
            "临证体会": ""
        },
        "task_5": "辨证：肝郁脾虚，心神失养\n\n解析：根据王某的临床表现，可以辨证为肝郁脾虚，心神失养。具体分析如下：\n\n1. 失眠、心悸、烦躁、头昏、头痛、颈部板紧不舒、精神不易集中、情绪抑郁等症状，提示心神失养，心神不安。中医认为，心主神明，心神失养则易出现失眠、心悸、烦躁等症状。\n\n2. 食欲不振、嗳气、健忘、精神疲乏、怕冷、腰酸带下等症状，提示脾虚。中医认为，脾主运化，脾虚则运化功能减弱，易出现食欲不振、嗳气、健忘、精神疲乏等症状。同时，脾虚还会影响水湿的运化，导致湿邪内生，表现为舌苔薄腻。\n\n3. 脉弦细，提示肝郁。中医认为，肝主疏泄，肝郁则疏泄功能失常，易出现情绪抑郁、头胀痛、颈部板紧不舒等症状。同时，肝郁还会影响脾的运化功能，导致脾虚。\n\n4. 舌质淡青，提示寒湿内生。中医认为，寒湿内生易影响脾的运化功能，导致脾虚。\n\n综上所述，王某的临床表现符合肝郁脾虚，心神失养的辨证。治疗上应以疏肝解郁、健脾养心为主，辅以温阳化湿，以达到调和肝脾，养心安神的目的。"
    },
    {
        "input": {
            "案例编号": "病例36",
            "临床资料": "宋某，女，17岁。初诊：1982年10月21日。主诉及病史：患“重症肌无力”，左眼睑下垂，影响视力，气短，全身无力，朝轻暮重，劳累加重。诊查：舌淡光红，苔白，脉极细弱。",
            "病机答案": "",
            "病机选项": "A:络伤血瘀;B:湿热郁阻中焦;C:素体阳虚;D:肝经郁热;E:热聚于阳明胃腑;F:毒邪侵袭;G:阴虚阳盛;H:心神亏虚;I:脾肾不足;J:气虚不能固卫腠理",
            "证候答案": "",
            "证候选项": "A:脾虚清气下陷;B:气滞血瘀;C:伏风夹瘀;D:真阴亏损;E:气阴亏损;F:阴虚阳浮;G:湿痰阻滞经络;H:痰浊内阻;I:厥阳升扰;J:血虚",
            "临证体会": ""
        },
        "task_5": "### 辨证\n辨证：脾肾两虚，气阴不足\n\n解析：根据宋某的临床表现，可以辨证为脾肾两虚，气阴不足。重症肌无力表现为肌肉无力，朝轻暮重，劳累加重，这与脾肾两虚，气阴不足的病机相符合。脾主肌肉，肾藏精，主骨生髓，脾肾两虚则肌肉无力，气短乏力。气阴不足则表现为舌淡光红，苔白，脉极细弱，这些都是气阴两虚的典型舌脉表现。因此，辨证为脾肾两虚，气阴不足。"
    }
]