[
    {
        "input": {
            "案例编号": "病例38",
            "临床资料": "吴某，男，59岁。初诊:1975年8月3日。主诉及病史:于1974年9月9日经某医院诊为“乳糜血尿”而住院，因不愿手术，于7月15日出院。8月3日来我院门诊求治。诊查:当时面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起。脉象缓细无力，舌苔淡如菜根。",
            "病机答案": "",
            "病机选项": "A:脾弱湿盛;B:兼有湿热;C:肾气不固;D:脾肾阳虚;E:水气搏结;F:耗伤阴血;G:上溢而衄;H:胃气上逆;I:水邪泛滥;J:痰湿内阻",
            "证候答案": "",
            "证候选项": "A:湿热下注;B:湿热化燥;C:热入营血;D:脾虚湿热下注;E:脾胃不和;F:肝郁血滞;G:湿阻血瘀;H:下元虚损;I:血虚阳弱;J:气滞血瘀",
            "临证体会": ""
        },
        "task_1": "面貌呈严重贫血状;尿中有箸状血条;脉象缓细无力;舌苔淡如菜根",
        "task_2": "脾肾阳虚;耗伤阴血\n\n解析: 根据吴某的临床表现，面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起，脉象缓细无力，舌苔淡如菜根，这些症状提示存在脾肾阳虚和耗伤阴血的病机。脾肾阳虚导致水湿内停，不能正常运化水液，故面貌呈贫血状，行动腿抬不起。同时，脾肾阳虚还会影响血液的生成和固摄，导致耗伤阴血，出现尿中有箸状血条的症状。",
        "task_3": "下元虚损;脾虚湿热下注\n\n理由分析:\n1. **面貌呈严重贫血状**：这提示患者有明显的气血不足，中医认为下元虚损，即肾精亏损，肾气不足，不能固摄血液，导致血虚。\n2. **尿中有箸状血条**：血尿在中医中常与下焦湿热有关，但结合患者整体的气血不足状态，更倾向于脾虚不能统血，湿热下注，导致血随湿热下泄。\n3. **行动腿抬不起**：这表明患者有明显的气虚症状，气虚则无力，脾虚则不能运化水湿，湿热下注，影响下肢功能。\n4. **脉象缓细无力**：缓细无力的脉象是气虚血弱的典型表现，提示下元虚损，气血两虚。\n5. **舌苔淡如菜根**：淡苔提示气血不足，菜根色淡白，反映脾虚湿困，湿热下注。\n\n综合以上症状，患者既有下元虚损导致的气血不足，又有脾虚湿热下注的病理过程，故证候为“下元虚损;脾虚湿热下注”。",
        "task_4": "本例患者吴某，男，59岁，主诉及病史显示其于1974年9月9日被诊断为“乳糜血尿”，并因不愿手术而于7月15日出院，8月3日来我院门诊求治。诊查发现，患者面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起，脉象缓细无力，舌苔淡如菜根。\n\n临证体会：患者血尿日久，面色苍白，舌苔淡薄，脉象缓细无力，皆为气血两虚之象。血尿持续，乃肾气不固，封藏失职，肾不纳气，气随血脱，故见脉象无力。肾主水，肾气虚则水液代谢失常，血中乳糜物质随尿排出，形成乳糜血尿。患者行动不便，腿抬不起，亦为气血亏虚，筋骨失养之征。治疗当以补益气血，固肾止血为原则，可选用补中益气汤合归脾汤加减，以补气养血，健脾益肾，固摄止血。同时，宜注意饮食调养，避免辛辣刺激之品，以免加重病情。",
        "task_5": "### 辨证\n辨证：肾气亏虚，气血两亏，膀胱湿热。患者面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起，这些症状表明气血两亏，肾气不足，无法固摄血液，导致血尿。脉象缓细无力，舌苔淡如菜根，提示肾气亏虚，气血运行不畅，湿热蕴结于膀胱，影响尿液的正常排泄。治疗上应以补肾益气，清热利湿，固摄止血为主。"
    },
    {
        "input": {
            "案例编号": "病例108",
            "临床资料": "朱某，女，67岁。初诊：1970年9月.主诉及病史：口中常有甜味已2个多月，饮水亦觉水有甜味，食管和胃部有不适感，经常恶心，胃纳很差，胃中饱滞，每天只能在晨间吃1个鸡蛋和半杯白粥，整天不再进食。近10多天发热，体温在37.5～39℃之间，伴尿频尿急。有胃病史，发作时要服用苏打片，大便常秘结，十几年来靠服芦荟丸才能解出大便。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感。精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，不愿进食。过去嗜食糖。患此病后拒绝食糖，不肯服食甜味、苦味和辣味的药品，也拒绝住院治疗。曾请西医治疗未效，特请中医诊治。",
            "病机答案": "",
            "病机选项": "A:血瘀水停;B:脾胃亏损;C:气化不利;D:血枯火秘证;E:清窍被蒙;F:脾胃不健;G:肾气虚;H:肝经湿热下注;I:三焦不利;J:心气虚",
            "证候答案": "",
            "证候选项": "A:督脉瘀阻;B:肝肾亏虚;C:肝肾阴虚;D:心脾肾虚;E:外感风温;F:三焦决渎不通;G:冲任受损;H:肝失温养;I:风温时邪;J:脾虚不运",
            "临证体会": ""
        },
        "task_1": "口中常有甜味;饮水有甜味;食管不适;胃部不适;恶心;胃纳差;胃中饱滞;发热;体温37.5～39℃;尿频;尿急;大便秘结;夜睡不宁;易惊醒;睡眠中遗尿;黎明前恐怖感;精神疲乏;嗜卧床;头脑不清醒;讲话词不达意;拒绝食糖;拒绝服食甜味、苦味和辣味药品;拒绝住院治疗;舌象脉象未提及，但可根据症状推测可能存在舌苔腻、脉细弱或滑数等。\n\n根据上述症状，患者可能涉及的中医辨证有脾胃湿热、胃气上逆、肾气不固、心神不宁等。治疗上，可考虑清热化湿、和胃降逆、固肾安神等治法，具体方药需结合舌象脉象及患者体质综合考虑。例如，可用黄连温胆汤加减，以清热化湿、和胃降逆；或用六味地黄丸加减，以固肾安神；同时，根据患者的具体情况，可适当加入安神、固涩的药物，如酸枣仁、五味子等。",
        "task_2": "脾胃亏损;气化不利;肾气虚\n\n解析: 朱某的症状表现为口中常有甜味，饮水亦觉水有甜味，食管和胃部不适，经常恶心，胃纳很差，胃中饱滞，这些都是脾胃功能失调的表现，故选B脾胃亏损。近10多天发热，体温在37.5～39℃之间，伴尿频尿急，大便常秘结，十几年来靠服芦荟丸才能解出大便，这说明气化功能不利，故选C气化不利。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感，精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，这些症状与肾气虚有关，故选G肾气虚。",
        "task_3": "脾虚不运;肝失温养\n\n解析: 根据临床资料，患者口中常有甜味，饮水亦觉水有甜味，食管和胃部有不适感，经常恶心，胃纳很差，胃中饱滞，这些都是脾胃功能失调，脾虚不运的表现。脾虚不能正常运化水谷精微，导致湿浊内生，湿浊上泛则口中甜味，胃中饱滞，恶心，食欲不振。同时，患者精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，这些都是脾虚导致的气血生化不足，清阳不升的表现。患者拒绝食糖，拒绝服食甜味、苦味和辣味的药品，也与脾虚不运，湿浊内生，影响脾胃对食物的接受和消化有关。\n\n此外，患者有胃病史，发作时要服用苏打片，大便常秘结，十几年来靠服芦荟丸才能解出大便，这说明患者长期脾胃功能失调，导致肝失温养，肝气郁结，影响脾胃的正常运化功能，导致大便秘结。肝失温养，肝气郁结，还可能导致患者夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感，精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，这些都是肝失温养，肝气郁结，影响心神的表现。因此，患者的证候为脾虚不运，肝失温养。",
        "task_4": "临证体会：本例患者口中常有甜味，饮水亦觉水有甜味，此为脾胃湿热内蕴，胃气上逆所致。湿热之邪熏蒸于中焦，影响脾胃的运化功能，导致胃纳差，恶心，胃中饱滞，食管和胃部不适。湿热下注，影响膀胱的气化功能，故见尿频尿急。湿热久蕴，郁而化火，故见发热。湿热内阻，气机不畅，加之素体脾胃虚弱，故大便秘结，需依赖芦荟丸通便。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感，此为心神不宁，肾气不固之象。精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，此为湿热困脾，清阳不升，心神失养所致。患者过去嗜食糖，湿热之邪与糖分结合，更易生湿生热，加重病情。拒绝食糖，不肯服食甜味、苦味和辣味的药品，此为湿热内蕴，脾胃功能受损，对甜、苦、辣等刺激性食物反应敏感。治疗当以清热利湿，健脾和胃，调畅气机为原则。",
        "task_5": "### 辨证\n辨证：脾虚湿热蕴结，胃失和降\n\n解析：患者口中常有甜味，饮水亦觉水有甜味，此为脾虚湿热上泛所致。脾虚不能运化水湿，湿热蕴结于中焦，上泛于口，故口中觉甜。胃部不适，恶心，胃纳差，胃中饱滞，均为胃失和降之象，湿热阻滞胃气，胃气不降则上逆，故恶心、胃纳差。发热、尿频尿急，为湿热下注膀胱，膀胱气化不利所致。大便秘结，需靠服芦荟丸解便，说明湿热下注，肠道传导失常。夜睡不宁，易惊醒，有时遗尿，为脾虚湿热影响心神，心神不安则睡眠差，遗尿。黎明前有恐怖感，精神疲乏，嗜卧床，头脑不清醒，讲话词不达意，均为脾虚湿热影响心神及气血运行不畅所致。患者过去嗜食糖，加重了脾虚湿热的形成。拒绝食糖，不肯服食甜味、苦味和辣味的药品，说明患者对湿热之邪的反应敏感，甜味、苦味和辣味的药品可能加重湿热或刺激胃气，故患者不愿服用。综合以上症状，辨证为脾虚湿热蕴结，胃失和降。"
    },
    {
        "input": {
            "案例编号": "病例243",
            "临床资料": "张某，男，65岁。主诉及病史：患者平素逸多劳少，体弱而肥，动则喘气，善太息，心慌，心悸不安，稍事劳动即感体力不支，尤以汗出为甚，稍动则汗出淋漓，虽在冬月，头项亦汗出蒸蒸，额鼻冒出汗珠，常导致感冒。近3个月来，症状转化，由白天出汗转为晚间出汗，寐则汗出，寤则汗收，衣被常湿，形寒畏冷，弱不禁风，伴之以胸闷心痛，四肢厥冷，气短不足以息。西医诊断：冠状动脉供血不足，伴自主性神经功能紊乱。诊查：脉沉细，舌质暗淡、苔淡黄。体胖而皮肤反枯，衣物内冒出汗臭气，口唇带紫而干。",
            "病机答案": "",
            "病机选项": "A:肺气虚;B:肝气不疏;C:阴虚素质;D:风寒湿邪留注肌骨;E:水邪泛滥;F:气不行湿;G:肝气有余;H:化热伤阴;I:脾胃受损;J:邪在阳明",
            "证候答案": "",
            "证候选项": "A:血虚生风;B:肺胃失养;C:阴气失固;D:阴虚内热;E:气滞血瘀;F:痰蒙心窍;G:脾胃不和;H:肾水无制;I:肺金失养;J:阳明积热",
            "临证体会": ""
        },
        "task_1": "体弱而肥;动则喘气;善太息;心慌;心悸不安;体力不支;汗出淋漓;冬月头项汗出;寐则汗出;寤则汗收;形寒畏冷;胸闷心痛;四肢厥冷;气短不足以息;脉沉细;舌质暗淡;苔淡黄;体胖而皮肤反枯;衣物内冒出汗臭气;口唇带紫而干。",
        "task_2": "肺气虚;阴虚素质\n\n解析：根据张某的临床资料，他体弱而肥，动则喘气，心慌心悸，稍事劳动即感体力不支，且汗出淋漓，这些症状表明他有肺气虚的表现。肺主气，司呼吸，肺气虚则气短不足以息，动则喘气，心慌心悸，体力不支。同时，他由白天出汗转为晚间出汗，寐则汗出，寤则汗收，这属于阴虚素质的典型表现，阴虚则阳亢，导致夜间盗汗。此外，他形寒畏冷，弱不禁风，口唇带紫而干，也提示有阴虚阳亢的情况。因此，病机答案为肺气虚和阴虚素质。",
        "task_3": "C:阴气失固;E:气滞血瘀\n\n解析：患者体弱而肥，动则喘气，心慌心悸，稍动则汗出淋漓，且由白天出汗转为晚间出汗，寐则汗出，寤则汗收，形寒畏冷，弱不禁风，伴胸闷心痛，四肢厥冷，气短不足以息，脉沉细，舌质暗淡、苔淡黄，体胖而皮肤反枯，衣物内冒出汗臭气，口唇带紫而干。这些症状表明患者存在阴气失固，即阴液不能固摄，导致汗出异常，同时伴有气滞血瘀，气血运行不畅，影响心肺功能，导致心慌心悸、胸闷心痛、四肢厥冷等症状。",
        "task_4": "临证体会：本病主要责之心肺脾三脏。患者体胖而逸多劳少，脾虚则运化失常，水湿内停，聚湿生痰，痰湿阻滞，心肺气机不畅，心阳不振，故动则喘气，心慌心悸，汗出淋漓。入夜则阳气内敛，卫外不固，故由白天出汗转为晚间出汗，寐则汗出，寤则汗收，此为阴虚阳浮之象。形寒畏冷，四肢厥冷，为阳气虚衰，不能温煦四肢之故。胸闷心痛，气短不足以息，为心阳不振，血行不畅，痰湿阻滞心脉所致。口唇带紫而干，舌质暗淡，为血瘀之象。治疗当以温阳益气，化痰祛湿，活血通络为主。方选真武汤合苓桂术甘汤加减，以温阳化气，健脾利湿，佐以活血化瘀之品，如丹参、川芎等，以改善心脉血行，缓解胸闷心痛。同时，指导患者适当运动，以助脾运，改善体质。",
        "task_5": "辨证：系心肺气虚，阳气不固，阴液外泄，卫外不固，营卫失调，兼有血瘀之象。\n\n患者体弱而肥，动则喘气，心慌心悸，稍事劳动即感体力不支，且汗出淋漓，此为心肺气虚，阳气不固，不能固摄津液，导致汗出过多。汗出多则伤津耗气，气虚则卫外不固，营卫失调，故患者形寒畏冷，弱不禁风，易感外邪。夜间汗出，寐则汗出，寤则汗收，此为阴虚之象，阴液不足，不能固摄于内，故汗出。口唇带紫而干，舌质暗淡、苔淡黄，脉沉细，均为血瘀之象，血行不畅，气血运行受阻，故胸闷心痛，四肢厥冷，气短不足以息。\n\n治疗当以益气固表，调和营卫，活血化瘀为主，可选用补中益气汤加减，以补益心肺之气，固摄津液，调和营卫，同时加入活血化瘀之品，如桃仁、红花等，以改善血瘀症状。同时，注意调养，避免过度劳累，保持心情舒畅，适当运动，以助气血运行，增强体质。"
    },
    {
        "input": {
            "案例编号": "病例31",
            "临床资料": "关某，女，20岁。初诊：1977年11月15日。主诉及病史：患者1年前丧父，悲恸至极，又因工作、生活不顺心，情志怫郁。2个月前，开始头晕头痛，多梦失眠，心烦易怒。1周前其父逝世周年，亲属毕至，悲恸异常，当晚睡中突然精神错乱，语无伦次，哭闹不休。经山东某医院神经科诊为精神分裂症。11月15日查房时，患者正阵发性发作烦躁，精神错乱，语无伦次，哭闹不休，躁动不宁，不知秽洁，时欲出走。俟神志略清时，自诉头晕、头重、巅顶有压迫感，胸闷，善太息，善惊，恶闻人声，失眠、多梦，饮食喜冷，大便干、数日一行，小便黄赤。诊查：六脉洪滑数、100次/分，舌苔黄褐厚、舌红、舌尖绛。",
            "病机答案": "",
            "病机选项": "A:阴虚阳亢;B:清阳失展;C:瘀阻血络;D:脏腑气血功能紊乱;E:情志失调;F:清阳浊阴升降失调;G:痰热结聚;H:生湿成痰;I:肝气郁结;J:火升风动",
            "证候答案": "",
            "证候选项": "A:肝肾不足;B:心火内炽;C:肝气犯胃;D:水邪凌胸;E:气血两虚;F:肝郁化火;G:迫血妄行;H:阳亢风动;I:暑湿内伏;J:痰火迷神",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 悲恸;情志怫郁;头晕头痛;多梦失眠;心烦易怒;精神错乱;语无伦次;哭闹不休;躁动不宁;头晕;头重;巅顶压迫感;胸闷;善太息;善惊;恶闻人声;失眠;多梦;饮食喜冷;大便干;数日一行;小便黄赤;六脉洪滑数;舌苔黄褐厚;舌红;舌尖绛。",
        "task_2": "阴虚阳亢;情志失调;肝气郁结;火升风动\n\n解析: 关某的病机分析基于中医理论，主要从以下几个方面进行考虑：\n\n1. **阴虚阳亢**：患者长期情志怫郁，悲恸异常，导致肝气郁结，久而久之，肝阴受损，阴不制阳，出现阴虚阳亢的病理状态。阴虚阳亢可表现为头晕头痛、心烦易怒、失眠多梦等症状。\n\n2. **情志失调**：患者因丧父之痛及生活工作压力，情志长期处于抑郁状态，情志失调是导致精神错乱、语无伦次、哭闹不休等精神症状的重要原因。\n\n3. **肝气郁结**：肝主疏泄，情志不畅则肝气郁结，郁久化火，火扰心神，导致精神症状。肝气郁结还可见胸闷、善太息、善惊、恶闻人声等表现。\n\n4. **火升风动**：肝气郁结化火，火性炎上，扰动心神，加之阴虚阳亢，易致风动，表现为精神错乱、躁动不宁、不知秽洁等症状。\n\n综上所述，关某的病机主要涉及阴虚阳亢、情志失调、肝气郁结及火升风动，这些病机相互影响，共同导致了患者的精神症状和身体不适。",
        "task_3": "肝郁化火;痰火迷神\n\n解析：根据临床资料，患者有明显的情志怫郁史，表现为悲恸、心烦易怒，且有精神错乱、语无伦次、哭闹不休等精神症状，同时伴有头晕头痛、胸闷、善惊、恶闻人声、失眠多梦等躯体症状，以及饮食喜冷、大便干、小便黄赤等消化系统症状。六脉洪滑数、舌苔黄褐厚、舌红、舌尖绛等脉象和舌象提示体内有火邪。综合分析，患者的情志怫郁导致肝气郁结，久郁化火，火邪上扰心神，出现精神错乱等症状，故辨证为肝郁化火；同时，火邪炼液为痰，痰火上扰，迷蒙心窍，出现语无伦次、哭闹不休等神志症状，故辨证为痰火迷神。",
        "task_4": "关某之病，起于情志内伤，悲恸过度，加之生活工作压力，致肝气郁结，久而化火。肝火上炎，扰动心神，故见头晕头痛，多梦失眠，心烦易怒。悲恸异常，肝气郁结更甚，肝火炽盛，上扰心神，致精神错乱，语无伦次，哭闹不休，此乃肝火犯心之象。肝主疏泄，肝气郁结，疏泄失常，气机不畅，故胸闷，善太息，善惊，恶闻人声。肝火上炎，心神受扰，故失眠多梦。饮食喜冷，大便干，数日一行，小便黄赤，均为肝火内炽，热伤津液之象。舌苔黄褐厚，舌红，舌尖绛，脉洪滑数，均为肝火上炎，热盛之征。治疗当以清肝泻火，疏肝解郁，安神定志为主。方选龙胆泻肝汤加减，以清肝火，疏肝气，安神定志。同时，调畅情志，避免精神刺激，保持心情舒畅，以助病情恢复。",
        "task_5": "辨证：情志内伤，肝郁化火，上扰心神\n\n分析：关某因丧父之痛及生活工作压力，情志长期怫郁，肝气不舒，久之肝郁化火，火性上炎，扰动心神，故见精神错乱，语无伦次，哭闹不休，烦躁不安。肝火上扰，清窍不利，故头晕头痛，巅顶有压迫感。肝气郁结，气机不畅，胸闷善太息，善惊恶闻人声。肝火扰心，心神不宁，故失眠多梦。饮食喜冷，大便干、数日一行，小便黄赤，均为肝火内盛，热伤津液之象。六脉洪滑数，舌苔黄褐厚、舌红、舌尖绛，均为肝火上炎，热盛之征。治疗当以清肝泻火，镇心安神为主。"
    },
    {
        "input": {
            "案例编号": "病例221",
            "临床资料": "高某，男，42岁。初诊：1963年4月8日。主诉及病史：病起于7年前，因工作常常熬夜，甚至通宵达旦，继因工作不顺心，日夜思考，逐渐形成失眠。即便能睡，但合目即梦，头昏不清，神疲肢软。诊查：形体消瘦，食少纳差，胸痞肠鸣，大便稀溏。舌边红绛，舌心苔薄乏津，脉弦细。",
            "病机答案": "",
            "病机选项": "A:肝阳偏亢;B:气血瘀滞;C:阳气乃奋;D:伤及心阴;E:心气虚;F:外感温毒壅于少阳经;G:肝郁;H:脾虚;I:饮邪郁遇;J:伤瘀留滞",
            "证候答案": "",
            "证候选项": "A:气血两亏;B:热伏于里之温热重症;C:血瘀津亏;D:痰湿阻滞经络;E:肝郁脾虚;F:肝旺脾弱;G:虚风内动;H:咳久脾虚;I:肝肾阴虚;J:痰热扰神",
            "临证体会": ""
        },
        "task_1": "失眠;合目即梦;头昏不清;神疲肢软;形体消瘦;食少纳差;胸痞肠鸣;大便稀溏;舌边红绛;舌心苔薄乏津;脉弦细",
        "task_2": "D:伤及心阴;H:脾虚\n\n解析：高某的症状表现为形体消瘦、食少纳差、胸痞肠鸣、大便稀溏，这些都是脾虚的典型表现。脾虚不能运化水谷精微，导致气血生化不足，加之熬夜伤阴，心阴受损，故出现失眠、合目即梦、头昏不清、神疲肢软等症状。舌边红绛、舌心苔薄乏津、脉弦细也支持心阴受损和脾虚的诊断。",
        "task_3": "肝郁脾虚;气血两亏\n\n解析: 高某的临床表现符合中医肝郁脾虚和气血两亏的证候。长期熬夜和精神压力导致肝气郁结，影响脾胃的运化功能，表现为食少纳差、胸痞肠鸣、大便稀溏。同时，长期的失眠和神疲肢软提示气血两亏，舌边红绛、舌心苔薄乏津、脉弦细也支持这一诊断。肝郁脾虚和气血两亏相互影响，共同导致了高某的临床症状。",
        "task_4": "此例属于心脾两虚兼有肝火上炎之证。长期熬夜及精神压力导致心脾受损，心主神明，脾主运化，心脾两虚则神不守舍，运化失常，故见失眠、头昏、神疲肢软、食少纳差、胸痞肠鸣、大便稀溏等症状。舌边红绛，舌心苔薄乏津，脉弦细，均为心脾两虚，肝火上炎的表现。心火上炎则舌边红绛，脾虚则舌心苔薄乏津，脉弦细为肝气郁结，心脾两虚之象。治疗当以补益心脾，清肝火为主，调和气血，安神定志。",
        "task_5": "辨证：心脾两虚，肝气郁结\n\n解析：高某的临床表现符合中医心脾两虚和肝气郁结的辨证。心脾两虚表现为失眠、头昏、神疲肢软、形体消瘦、食少纳差，这些症状与心脾功能失调有关，心主神明，脾主运化，心脾两虚则神不守舍，运化失常，导致上述症状。肝气郁结表现为胸痞肠鸣、脉弦细，肝主疏泄，肝气郁结则疏泄失常，气机不畅，影响脾胃运化，导致胸痞肠鸣。舌边红绛，舌心苔薄乏津，脉弦细，也支持心脾两虚和肝气郁结的辨证。"
    },
    {
        "input": {
            "案例编号": "病例352",
            "临床资料": "尹某，男，41岁.初诊:1972年8月。主诉及病史:自1964年以后经常肝区疼痛，同时伴有低烧(37.5~38.0℃)，肝功能正常，未确诊。1972年5月感冒发热，肝区疼痛突然加重，呈针刺样痛，难以忍受，经多个医院同位素、胎甲球蛋白等检查，诊断为肝癌。一直住院治疗，虽经多方处理，但发热、肝区疼痛始终未见改善，全身情况亦逐日恶化。遂来我处就诊。诊查:患者仍有肝区疼痛，胃脘胀满，低热，大便偏溏，纳差，日食半斤左右。形体消瘦，面色青暗，神乏气短。脉沉细弦数，舌青赤有瘀斑，苔薄白。肝肋下5cm，表面不甚平滑，中等硬度，压痛明显。",
            "病机答案": "",
            "病机选项": "A:风热犯肺;B:化热生痰;C:热邪下注;D:精血亏损;E:气血两虚;F:络道阻塞;G:脾虚气虚;H:气滞血瘀;I:固摄失司;J:寒凝血滞",
            "证候答案": "",
            "证候选项": "A:气血失和;B:肝阴虚;C:真阴亏损;D:肝脾不和;E:迫血妄行;F:感暑邪;G:脾肾两虚;H:肝脾两虚;I:气滞血瘀;J:肝肾阴虚",
            "临证体会": ""
        },
        "task_1": "肝区疼痛;胃脘胀满;低热;大便偏溏;纳差;形体消瘦;面色青暗;神乏气短;脉沉细弦数;舌青赤有瘀斑;苔薄白;肝大(肋下5cm);肝质硬;肝区压痛明显",
        "task_2": "气滞血瘀;精血亏损\n\n解析: 根据尹某的临床资料，我们可以分析其病机如下：\n\n1. **气滞血瘀**：尹某肝区疼痛，呈针刺样痛，难以忍受，且面色青暗，舌青赤有瘀斑，这些都是气滞血瘀的典型表现。气滞血瘀在中医中常与肝病相关，肝主疏泄，气机不畅则易致血瘀，表现为疼痛、面色青暗等症状。\n\n2. **精血亏损**：尹某形体消瘦，面色青暗，神乏气短，这些都是精血亏损的表现。精血亏损在中医中指的是人体精血不足，导致身体机能下降，表现为消瘦、乏力等症状。肝为藏血之脏，肝病日久，易致精血亏损。\n\n因此，尹某的病机可以归纳为气滞血瘀与精血亏损。",
        "task_3": "I:气滞血瘀\n\n解析:根据尹某的临床资料，他有肝区疼痛、低热、胃脘胀满、大便偏溏、纳差、形体消瘦、面色青暗、神乏气短等症状。脉象为沉细弦数，舌象为青赤有瘀斑，苔薄白。这些症状和舌脉象提示存在气滞血瘀的情况。气滞血瘀是中医中常见的证候，表现为气血运行不畅，导致局部或全身的疼痛、胀满、瘀斑等症状。在尹某的病例中，肝区疼痛、胃脘胀满、面色青暗等都是气滞血瘀的典型表现。因此，根据中医辨证论治的原则，尹某的证候为气滞血瘀。",
        "task_4": "临证体会：尹某之病，肝区疼痛，低热持续，形体消瘦，面色青暗，舌青赤有瘀斑，脉沉细弦数，此乃肝郁气滞，血瘀内阻，加之湿热蕴结，脾胃功能受损之象。肝为将军之官，主疏泄，喜条达而恶抑郁，肝气郁结，久则化火，火郁则生热，热伤津液，湿热内生，湿热下注则大便偏溏，湿热上蒸则低热不退。肝气郁结，血行不畅，瘀血内停，故肝区疼痛，肝大且有压痛。胃脘胀满，纳差，乃脾胃受湿热所困，运化失司，升降失常所致。治疗当以疏肝解郁，活血化瘀，清热利湿，健脾和胃为法。方选柴胡疏肝散合桃红四物汤加减，以柴胡、香附、川芎、白芍疏肝解郁，桃仁、红花、当归、川芎活血化瘀，黄连、黄芩清热燥湿，茯苓、白术健脾利湿，陈皮、半夏和胃降逆，甘草调和诸药。同时，注意调摄情志，避免情绪波动，保持心情舒畅，以助药力，促进病情好转。",
        "task_5": "### 辨证\n辨证：肝郁脾虚，气滞血瘀，湿热内蕴\n\n解析：尹某肝区疼痛，且伴有低烧，胃脘胀满，大便偏溏，纳差，形体消瘦，面色青暗，神乏气短，脉沉细弦数，舌青赤有瘀斑，苔薄白，肝肋下5cm，表面不甚平滑，中等硬度，压痛明显。这些症状表明患者存在肝郁脾虚，气滞血瘀，湿热内蕴的病机。\n\n- 肝郁脾虚：肝区疼痛，胃脘胀满，大便偏溏，纳差，面色青暗，神乏气短，脉沉细弦数，舌青赤有瘀斑，苔薄白，这些症状提示肝气郁结，脾虚不运，肝脾不和。\n- 气滞血瘀：肝区疼痛，形体消瘦，面色青暗，舌青赤有瘀斑，提示气滞血瘀，气血运行不畅。\n- 湿热内蕴：低热，大便偏溏，舌苔薄白，提示体内湿热内蕴，湿热之邪影响脾胃运化，导致大便偏溏，低热。\n\n治疗上应以疏肝解郁，健脾和胃，活血化瘀，清热利湿为原则，以期改善患者症状，调整脏腑功能，促进气血运行，达到治疗目的。"
    },
    {
        "input": {
            "案例编号": "病例189",
            "临床资料": "梅某，女，36岁。初诊：1961年8月19日。主诉及病史：头晕心烦，腹痛。诊查：面微赤，手足心发热，脉濡数，苔薄白质红。",
            "病机答案": "",
            "病机选项": "A:脾肾亏虚;B:郁久化热;C:瘀热蕴结;D:伤阴灼液;E:痰浊中阻;F:气血两亏;G:风湿之邪胶结;H:脾胃受伤;I:伤暑;J:脾虚",
            "证候答案": "",
            "证候选项": "A:伤脾胃;B:感暑邪;C:上焦肺失肃降;D:痰热内蕴;E:肝旺脾弱;F:心肾两亏;G:湿热中阻;H:阳明腑经湿热内攘;I:肝郁脾虚;J:积热膀胱",
            "临证体会": ""
        },
        "task_1": "面微赤;手足心发热;脉濡数;苔薄白质红;头晕心烦;腹痛",
        "task_2": "郁久化热;脾胃受伤\n\n解析：根据梅某的临床表现，面微赤、手足心发热、脉濡数、苔薄白质红，这些症状提示存在内热和脾胃功能受损的情况。中医认为，长期的情绪压抑或饮食不当等因素可以导致气机不畅，久而久之，气滞血瘀，郁久化热，影响脾胃的正常运化功能，导致脾胃受伤。因此，梅某的病机可以归纳为“郁久化热”和“脾胃受伤”。",
        "task_3": "肝旺脾弱\n\n解析：根据临床资料，梅某的症状包括头晕心烦、腹痛、面微赤、手足心发热、脉濡数、苔薄白质红。这些症状提示存在肝旺脾弱的证候。肝旺可以导致头晕心烦，脾弱则易出现腹痛。面微赤、手足心发热、脉濡数、苔薄白质红也与肝旺脾弱的临床表现相符。因此，根据中医辨证论治的原则，梅某的证候为肝旺脾弱。",
        "task_4": "临证体会：本案患者梅某，女，36岁，主诉头晕心烦，腹痛，面微赤，手足心发热，脉象濡数，舌苔薄白质红，这些症状提示体内有湿热内蕴，上扰清窍，下扰脾胃。面微赤，手足心发热，脉濡数，苔薄白质红，皆为湿热之象。湿热上扰，清阳不升，故头晕；湿热下注，脾胃运化失常，故腹痛。心烦则为湿热扰心所致。治疗当以清热利湿，调和脾胃为原则，以恢复清阳上升，浊阴下降的生理状态。方药选择上，可考虑使用黄连解毒汤合平胃散加减，以清热解毒，燥湿和胃。同时，注意饮食调理，避免油腻、辛辣等易助湿热的食物，以清淡易消化之品为主，有助于病情恢复。",
        "task_5": "### 辨证\n辨证：肝郁化火，脾虚湿困\n\n梅某面色微赤，手足心发热，脉濡数，苔薄白质红，这些症状提示存在肝郁化火的情况。肝郁不舒，气机不畅，郁久化火，火扰心神，故见头晕心烦。同时，脾虚不能运化水湿，湿困中焦，故见腹痛。脉濡数，苔薄白质红，也反映了肝郁脾虚的病理状态。治疗上应以疏肝解郁，清热利湿，健脾和胃为原则。"
    },
    {
        "input": {
            "案例编号": "病例216",
            "临床资料": "唐女，32岁。主诉及病史：高热神昏谵语1天，体温39.8℃(腋窝)。其夫仅谓其妻两天前诉及天热烦渴甚，喉间干燥，仍照常操持家务及在炼铁炉旁协助制作铁器。前日见其精神不振，但未发现有其他情况。至今日黎明忽闻其说胡话，初以为梦语，喊之不应，起而视之，面红汗出，扪其额及皮肤灼手。夜间曾解小便3次。乃急至卫生所求治。诊查：症见全身汗出，面唇红赤，用开口器强张其口，舌红苔黄燥，靠近根部舌边有糜烂点3个，咽喉粘膜充血。脉数。",
            "病机答案": "",
            "病机选项": "A:温病热灼营阴;B:瘀血凝滞;C:脾失健运;D:耗伤气阴;E:复感寒邪;F:瘀血阻滞胞脉;G:心移热于小肠;H:火热内扰心神;I:累及肾阴;J:心火又灼肺",
            "证候答案": "",
            "证候选项": "A:移热于小肠;B:兼感外邪;C:脾气虚;D:肝肾亏虚;E:肾亦受损;F:上热下寒;G:燥结便秘;H:气血两亏;I:痰瘀互结;J:扰及心神",
            "临证体会": ""
        },
        "task_1": "高热;神昏谵语;面红汗出;舌红苔黄燥;舌边有糜烂点;咽喉粘膜充血;脉数\n\n根据上述临床资料，唐女的病情可从中医角度进行分析如下：\n\n- **高热**：高热是体内邪热炽盛的表现，可能与外感热邪或内伤积热有关。\n- **神昏谵语**：神昏谵语是热入心包，扰乱心神的表现，常见于热病后期，病情较为严重。\n- **面红汗出**：面红汗出是热邪上扰，迫津外泄的征象，提示热邪已深。\n- **舌红苔黄燥**：舌红苔黄燥是热盛津伤的典型舌象，黄燥苔提示体内有实热。\n- **舌边有糜烂点**：舌边糜烂点是热毒炽盛，损伤血络的表现，常见于热病后期。\n- **咽喉粘膜充血**：咽喉粘膜充血是热邪上攻，导致局部血络扩张的表现，常见于热病。\n- **脉数**：脉数是热邪亢盛的脉象，提示体内有实热。\n\n综合上述症状，唐女的病情可诊断为热入心包，热盛津伤，热毒炽盛。治疗上应以清热解毒，养阴生津，安神定志为主，可选用清营汤、犀角地黄汤等方剂加减治疗。同时，注意观察病情变化，防止热毒进一步损伤心神，导致神志不清加重。",
        "task_2": "温病热灼营阴;火热内扰心神\n\n### 解析\n唐女，32岁，高热神昏谵语，体温39.8℃，面红汗出，舌红苔黄燥，咽喉粘膜充血，脉数。这些症状表明体内有火热之邪，热邪深入营分，耗伤营阴，导致高热、神昏、谵语等症状。同时，火热内扰心神，心神受扰，出现神志不清、说胡话等表现。因此，病机为温病热灼营阴和火热内扰心神。",
        "task_3": "J:扰及心神;A:移热于小肠\n\n解析：根据临床资料，患者高热神昏谵语，面红汗出，舌红苔黄燥，咽喉粘膜充血，脉数，这些症状表明患者体内有热邪扰心，故选J:扰及心神。同时，患者夜间曾解小便3次，说明热邪可能已移至小肠，故选A:移热于小肠。",
        "task_4": "### 临证体会\n\n本例患者高热神昏，舌红苔黄燥，咽喉粘膜充血，面唇红赤，全身汗出，乃属温病热入营血之象。患者素体壮实，炼铁炉旁劳作，加之暑热之邪，内外合邪，热毒炽盛，耗伤津液，故见烦渴甚，喉间干燥。热邪深入，扰动心神，故见神昏谵语。舌红苔黄燥，咽喉糜烂，为热毒上攻，损伤血络之征。脉数，为热盛之象。此乃热邪炽盛，耗伤营阴，热扰心神之证。\n\n治宜清热解毒，凉血开窍。方选清营汤加减，以清热解毒，凉血散瘀，开窍醒神。药用犀角（水牛角代）、生地、玄参、丹参、黄连、金银花、连翘、竹叶心、麦冬、生甘草。若热毒甚者，可加用羚羊角粉或牛黄清心丸以增强清热解毒之力。同时，注意调养阴液，以防热邪耗伤太过，导致阴液大亏。",
        "task_5": "辨证：此乃暑热内盛，热入心包，扰乱神明。暑为阳邪，其性炎热，易伤津耗气，故见高热、面唇红赤、汗出、口渴等症。暑热上扰心神，则见神昏谵语。舌红苔黄燥，舌边有糜烂点，均为热盛伤津之象。脉数亦为热象之征。综上所述，此证属暑热内闭，心神受扰之重症。治疗当以清热解暑，开窍醒神为主。"
    },
    {
        "input": {
            "案例编号": "病例5",
            "临床资料": "张某，女，43岁。初诊:1983年8月1日。主诉及病史(家属代诉):反复高热10余日，体温38~40℃，多汗口渴，便秘，尿少，继而出现尿闭，人工导尿已9天。曾用抗生素及清营汤、白虎汤加减治疗无效。",
            "病机答案": "",
            "病机选项": "A:湿热下注;B:热结膀胱;C:浊湿阻滞中焦;D:气化失调;E:风热犯肺;F:情志失调;G:水不涵木;H:耗伤心神;I:热邪下注;J:虚热上蒸",
            "证候答案": "",
            "证候选项": "A:血瘀气滞;B:肝脾两虚;C:玉关失固;D:肺肾阴亏;E:风痰窜络;F:血瘀;G:暑温;H:督脉瘀阻;I:湿热下注;J:痰热扰心",
            "临证体会": ""
        },
        "task_1": "高热;多汗口渴;便秘;尿少;尿闭;脉象未提;舌象未提\n\n在中医诊断中，高热、多汗口渴、便秘、尿少、尿闭等症状通常与热盛、津液亏损有关。由于张某的症状严重且持续时间较长，可能涉及多个脏腑的功能失调，尤其是肺、胃、大肠和肾的热盛。然而，由于资料中未提供脉象和舌象的具体描述，我们无法做出更精确的辨证。在中医理论中，脉象和舌象是辨证论治的重要依据，它们能帮助医生判断病情的性质、程度和病位。例如，脉象可能表现为滑数、洪数或弦数，分别提示热盛、热盛伤津或热邪夹肝火；舌象可能表现为舌红、苔黄或苔黄腻，分别提示热盛、热邪入里或湿热内蕴。因此，对于张某的病情，需要结合详细的脉象和舌象进行综合分析，以确定最合适的治疗方案。在没有具体脉象和舌象的情况下，可以初步判断张某的病情属于热盛伤津的范畴，治疗上应以清热解毒、生津止渴为主，同时兼顾通腑泄热、利尿通淋，以缓解便秘和尿闭的症状。具体的方药选择需要根据患者的具体情况和中医师的临床经验来定。例如，可以考虑使用清热解毒的药物如黄连、黄芩、连翘、金银花等，生津止渴的药物如生地、麦冬、天花粉等，通腑泄热的药物如大黄、芒硝等，以及利尿通淋的药物如车前子、泽泻、木通等。同时，需要注意患者的饮食调理，避免辛辣、油腻等刺激性食物，多饮水，保持大便通畅，以促进病情的恢复。",
        "task_2": "热结膀胱;气化失调;湿热下注;热邪下注\n\n### 解析\n张某的症状表现为反复高热、多汗口渴、便秘、尿少乃至尿闭，这些症状在中医理论中多与热邪有关。其中，高热、口渴、便秘提示体内有热邪，且热邪已深入，影响到膀胱的气化功能，导致尿闭，故有“热结膀胱”之病机。同时，多汗、口渴、尿闭也提示气化失调，即体内津液的生成、输布和排泄功能失常，这与“气化失调”病机相符。此外，长期的高热和体内湿热的积聚，说明湿热下注，湿与热邪结合，影响了中下焦的功能，故有“湿热下注”之病机。最后，热邪不仅影响膀胱，还可能下注于下焦，影响肾和膀胱的正常功能，故有“热邪下注”之病机。综上所述，张某的病机为热结膀胱、气化失调、湿热下注、热邪下注。",
        "task_3": "G:暑温\n\n解析:根据张某的临床表现，可以分析如下:\n1. 反复高热10余日，体温38~40℃，多汗口渴，便秘，尿少，继而出现尿闭，这些症状符合暑温的临床表现。暑温是由于夏季炎热，暑热之邪侵袭人体，导致体内阳热亢盛，耗伤津液，出现高热、口渴、多汗、便秘、尿少等症状。\n2. 暑温病邪深入，耗伤津液，导致尿闭，需要人工导尿，说明病情较为严重。\n3. 曾用抗生素及清营汤、白虎汤加减治疗无效，说明病情较为复杂，需要辨证施治。\n综上所述，张某的证候为暑温。暑温病邪深入，耗伤津液，导致高热、口渴、多汗、便秘、尿少等症状，需要清热解毒、生津止渴、通利小便等治疗方法。",
        "task_4": "临证体会：患者高热持续，多汗口渴，便秘尿少，乃至尿闭，此乃热毒炽盛，耗伤津液，气阴两伤之象。热毒内盛，迫津外泄，故见多汗；热盛伤津，故口渴；热结肠道，津液被耗，故便秘；热毒上扰心神，下迫膀胱，膀胱气化不利，故尿少乃至尿闭。治疗当以清热解毒，养阴生津，通腑利尿为法。可考虑使用黄连解毒汤合增液承气汤加减，以清热解毒，养阴生津，通腑利尿。同时，注意观察患者病情变化，调整治疗方案，以防病情进一步恶化。",
        "task_5": "### 辨证\n\n辨证：张某之症，高热多日，汗出而渴，便秘尿闭，此乃热邪炽盛，深入营血，耗伤津液，阻滞气机之象。热邪内盛，迫津外泄，故见多汗；热盛伤津，津液亏耗，故口渴；热结肠道，腑气不通，故便秘；热邪上扰心神，下迫膀胱，气化不利，故尿少乃至尿闭。舌象、脉象虽未详述，但根据症状，可推断舌质红绛，苔黄燥，脉数有力，均为热盛津伤之征。\n\n综上所述，张某之症，辨证为热入营血，气阴两伤，腑实尿闭。治疗当以清热解毒，养阴生津，通腑利尿为法。方选清营汤合生脉散加减，以清热解毒，养阴生津；配以大承气汤加减，以通腑泄热，利尿通淋。同时，注意调护，保持气道通畅，防止热毒内陷，保护津液，避免津液过度耗损。"
    },
    {
        "input": {
            "案例编号": "病例229",
            "临床资料": "王某，女，34岁，已婚。初诊：1984年8月9日。主诉及病史：1984年6月2日月经来潮后，至今2个月余未净，曾在某医院住院治疗，诊断为“子宫内膜炎”，用止血药及抗炎药治疗好转出院；出院后阴道仍出血不止，于1984年7月28日住入我院。妇科检查：子宫后倾，略大于正常，双侧附件增厚，压痛(+)。诊查：现阴道仍有少量出血，色暗、无血块；小腹疼痛坠胀，拒按；腹痛甚则出血多，痛缓则血少；有时腰痛；口唇发麻，睡眠多梦易惊。舌淡暗少苔，脉弦软滑(70次/分)。",
            "病机答案": "",
            "病机选项": "A:湿邪阻滞;B:固摄失司;C:脾胃不健;D:肝阳升腾;E:冲任失养;F:宿瘀未化;G:肝阴耗损;H:瘀血阻滞胞脉;I:阳明脉虚;J:湿邪夹热内郁",
            "证候答案": "",
            "证候选项": "A:心肾不交;B:肝旺湿热;C:湿热;D:脾虚不运;E:外感时疫;F:风湿内侵;G:痰瘀交结;H:心火下移小肠;I:上焦肺失肃降;J:瘀血阻络",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 阴道出血2个月余未净;色暗;无血块;小腹疼痛坠胀拒按;腹痛甚则出血多;痛缓则血少;腰痛;口唇发麻;睡眠多梦易惊;舌淡暗少苔;脉弦软滑\n\n根据上述临床资料，王某的主要症状表现为长期阴道出血、小腹疼痛、腰痛、口唇发麻、睡眠质量差等，舌脉表现为舌淡暗少苔、脉弦软滑。在中医理论中，这些症状可能与血瘀、气滞、肾虚等病理机制有关。具体分析如下：\n\n1. **阴道出血2个月余未净，色暗无血块**：长期出血且血色暗淡，提示体内可能存在血瘀或血虚，血瘀导致血行不畅，血色暗淡；无血块可能是因为血行缓慢，未能形成较大的血块。\n\n2. **小腹疼痛坠胀拒按，腹痛甚则出血多，痛缓则血少**：小腹疼痛拒按，且疼痛程度与出血量相关，提示可能存在气滞血瘀的情况，气滞导致气血运行不畅，血瘀加重则疼痛加剧，出血量增多。\n\n3. **腰痛**：腰痛可能与肾虚有关，肾主骨生髓，肾虚则腰膝酸软，疼痛不适。\n\n4. **口唇发麻**：口唇发麻可能与气血运行不畅有关，血瘀或气滞均可导致局部气血供应不足，引起麻木感。\n\n5. **睡眠多梦易惊**：睡眠质量差，多梦易惊，可能与心神不宁有关，血瘀或气滞影响心神，导致睡眠障碍。\n\n6. **舌淡暗少苔，脉弦软滑**：舌淡暗少苔提示血虚或血瘀，脉弦软滑则反映气滞血瘀的病理状态，弦脉主痛，软滑脉则反映气血运行不畅。\n\n综合上述分析，王某的病情可能涉及血瘀、气滞、肾虚等多方面因素，治疗上应以活血化瘀、理气止痛、补肾固本为主，具体方药需根据患者具体情况辨证施治。例如，可考虑使用桃红四物汤加减以活血化瘀，香附、川芎等药物以理气止痛，同时配以补肾固本的药物如熟地、山茱萸等。但实际治疗方案需由专业中医师根据患者具体病情制定。",
        "task_2": "冲任失养;瘀血阻滞胞脉\n\n解析：根据临床资料，患者月经来潮后2个月余未净，阴道出血不止，色暗无血块，小腹疼痛坠胀，拒按，腹痛与出血量相关，腰痛，口唇发麻，睡眠多梦易惊，舌淡暗少苔，脉弦软滑。这些症状提示冲任失养，冲任为女性生殖系统的主要经脉，冲任失养可导致月经不调，出血不止。同时，瘀血阻滞胞脉，胞脉为子宫的经脉，瘀血阻滞可导致小腹疼痛，出血色暗，无血块，腰痛等症状。因此，病机答案为冲任失养和瘀血阻滞胞脉。",
        "task_3": "瘀血阻络\n\n根据临床资料，患者表现为月经后出血不止，小腹疼痛坠胀，拒按，腹痛与出血量相关，以及口唇发麻，睡眠多梦易惊等症状。舌象为淡暗少苔，脉象为弦软滑，这些都指向了瘀血阻络的证候。在中医理论中，瘀血阻络可以导致血行不畅，引起出血、疼痛等症状，且瘀血久留，可使舌质暗淡，脉象弦滑。因此，根据患者的症状和舌脉表现，可以判断其证候为瘀血阻络。",
        "task_4": "临证体会：本例患者月经来潮后持续出血2个月余，属于中医“崩漏”范畴。其病因病机主要为冲任不固，瘀血内阻，加之子宫内膜炎导致的湿热下注，损伤血络，血不归经。小腹疼痛坠胀，拒按，腹痛与出血量相关，提示瘀血阻滞，气机不畅。腰痛，口唇发麻，睡眠多梦易惊，舌淡暗少苔，脉弦软滑，均为血瘀兼有气虚之象，气虚则血运无力，瘀血则血行不畅，二者互为因果，形成恶性循环。\n\n治疗上，应以活血化瘀，固摄冲任，清热利湿为原则。方药可选用桃红四物汤加减，以活血化瘀；加用黄芪、白术以益气固摄；配伍茯苓、泽泻以利湿；并可酌情加入丹参、赤芍以增强活血之力，同时加入黄柏、土茯苓以清热利湿。治疗过程中，需注意调摄情志，避免情绪波动，以免加重病情。同时，饮食上宜清淡，避免辛辣刺激之品，以免助湿生热。",
        "task_5": "### 辨证\n\n辨证要点：根据患者主诉及病史，结合诊查所见，辨证如下：\n\n1. **阴道出血不止**：患者月经来潮后2个月余未净，出血色暗，无血块，提示血瘀之象。血瘀不散，新血不得归经，故出血不止。\n\n2. **小腹疼痛坠胀，拒按**：小腹疼痛拒按，腹痛甚则出血多，痛缓则血少，此为瘀血阻滞胞宫，气机不畅所致。瘀血内阻，气滞血瘀，故疼痛明显。\n\n3. **腰痛**：腰痛为肾虚或瘀血所致。肾主腰，肾虚则腰痛；瘀血阻滞，亦可引起腰痛。\n\n4. **口唇发麻，睡眠多梦易惊**：口唇发麻，多为气血不畅，血瘀气滞所致。多梦易惊，为心神不宁之象，与血瘀气滞，心神失养有关。\n\n5. **舌脉象**：舌淡暗少苔，脉弦软滑，提示气血两虚，兼有瘀血。舌淡暗为血瘀之象，少苔为津液不足；脉弦为气滞，软滑为血瘀兼有湿邪。\n\n综上所述，辨证为**气血两虚，瘀血阻滞胞宫**。治疗当以活血化瘀，调和气血为主，辅以补益气血，以期达到止血、止痛、调经之效。"
    },
    {
        "input": {
            "案例编号": "病例147",
            "临床资料": "陆某，男，47岁。初诊：1965年12月17日。主诉及病史：血压190/134mmHg。身体素健，因1年前儿子突然死亡而悲伤过度，连续彻夜不眠。嗣后常感头晕胀痛，面赤升火，心悸怔忡，尤以紧张时更甚。曾在某医院治疗，服西药并休息年余。诊查：口舌干燥。脉弦细，苔薄腻。",
            "病机答案": "",
            "病机选项": "A:阴虚火炽;B:肝失温养;C:后天失养;D:伤及心阴;E:肝风夹痰;F:痰热互结;G:寒湿之邪乘虚侵袭;H:胃失和降;I:肾水不足;J:血热夹瘀",
            "证候答案": "",
            "证候选项": "A:相火妄动;B:暑温;C:心火内炽;D:痰热;E:心肾两伤;F:脾失统摄;G:本虚标实;H:真寒假热;I:阴虚阳亢;J:痰浊壅遏",
            "临证体会": ""
        },
        "task_1": "血压190/134mmHg;身体素健;1年前儿子突然死亡而悲伤过度;连续彻夜不眠;常感头晕胀痛;面赤升火;心悸怔忡;紧张时症状更甚;口舌干燥;脉弦细;苔薄腻。",
        "task_2": "阴虚火炽;肝风夹痰\n\n解析：根据陆某的临床资料，他有持续的血压升高，头晕胀痛，面赤升火，心悸怔忡等症状，这些都是肝阳上亢的表现。中医认为，肝阳上亢多由情志内伤，如悲伤过度，导致肝气郁结，久而久之，肝阳亢盛，上扰清窍，出现头晕、面赤等症状。同时，肝阳上亢还可能伴有阴虚火炽，即肝阴不足，不能制约肝阳，导致火炽。此外，陆某还出现了口舌干燥，脉弦细，苔薄腻等阴虚火炽的表现。因此，陆某的病机可以诊断为阴虚火炽和肝风夹痰。肝风夹痰是指肝阳亢盛，风动痰生，痰随风动，上扰清窍，导致头晕、面赤等症状。",
        "task_3": "I:阴虚阳亢\n\n解析：根据陆某的临床资料，他有血压190/134mmHg，头晕胀痛，面赤升火，心悸怔忡，口舌干燥，脉弦细，苔薄腻等症状。这些症状与中医理论中的阴虚阳亢证候相符合。阴虚阳亢是由于阴液亏损，不能制约阳气，导致阳气亢盛的一种病理状态。阴虚则阳无所依，阳亢则火旺，故出现面赤升火，心悸怔忡，口舌干燥等症状。脉弦细，苔薄腻也提示了阴虚阳亢的可能。因此，陆某的证候为阴虚阳亢。",
        "task_4": "陆某之病，乃情志内伤所致。盖悲则气消，过度悲伤耗伤心气，心气虚则不能制肝，肝气上逆，故头晕胀痛，面赤升火。心悸怔忡，乃心神不宁之象，心主血脉，心气虚则血行不畅，加之肝气上逆，血随气升，故血压升高。口舌干燥，脉弦细，苔薄腻，皆为肝火上炎，耗伤津液之征。此乃心肝两虚，肝火上炎之证。\n\n治疗当以养心安神，平肝潜阳，滋阴清热为法。方用天王补心丹加减，以养心安神；加用龙骨、牡蛎以平肝潜阳；加麦冬、生地黄以滋阴清热。同时，调摄情志，避免过度悲伤，保持心情舒畅，以助药力。",
        "task_5": "辨证：肝阳上亢，心火亢盛，阴虚阳亢。\n\n陆某因情志刺激，肝气郁结，久之化火，肝火上炎，导致肝阳上亢。肝阳上亢则血压升高，面赤升火，头晕胀痛。心主神明，肝火扰心，心神不安，故心悸怔忡。肝肾同源，肝火耗伤肾阴，肾阴不足，阴不制阳，导致阴虚阳亢，故见口舌干燥，脉弦细，苔薄腻。心火亢盛，心神不宁，故紧张时症状更甚。治疗应以平肝潜阳，清心安神，滋阴降火为主。"
    },
    {
        "input": {
            "案例编号": "病例27",
            "临床资料": "刘某，男，40岁。初诊:1971年春。主诉及病史:胃痛已3年，经西医确诊为十二指肠球部溃疡，服过不少中西药，均无效果。每日胃痛彻背，连及两胁，饮食减少，大便不爽。从前曾有手足多汗症，自从患胃痛以后，手足出汗自止:诊查:察其脉象，沉取似觉滞涩有力，舌质舌苔无明显变化。阅其前服方药，多为理气、止痛、温中、缓泻等品。",
            "病机答案": "",
            "病机选项": "A:热搏于血;B:气血两虚;C:湿浊内结;D:清阳浊阴升降失调;E:肾阴虚;F:湿浊内盛;G:脾肾交馁;H:气血双亏;I:腐秽留滞;J:痰湿阻滞",
            "证候答案": "",
            "证候选项": "A:肝脾不调;B:血虚生风;C:气血两亏;D:血瘀;E:肾亏阴虚;F:风寒湿痹;G:燥热伤津;H:脾湿内盛;I:燥结便秘;J:肺失肃降",
            "临证体会": ""
        },
        "task_1": "胃痛彻背;连及两胁;饮食减少;大便不爽;手足多汗自止;脉象沉取滞涩有力",
        "task_2": "病机答案: 清阳浊阴升降失调;腐秽留滞\n\n解析: 根据刘某的临床资料，他有胃痛已3年，且胃痛彻背，连及两胁，饮食减少，大便不爽等症状。中医认为，胃痛连及两胁，提示肝胃不和，肝气犯胃，导致气机不畅。同时，饮食减少，大便不爽，提示脾胃功能失调，清阳不升，浊阴不降，即清阳浊阴升降失调。此外，从前有手足多汗症，自从患胃痛以后，手足出汗自止，这可能是因为脾胃功能失调，导致体内湿气无法正常排泄，湿气内盛，影响了手足的汗液排泄。而“腐秽留滞”则指胃中食物消化不良，腐烂之气滞留，这也是导致胃痛的原因之一。因此，刘某的病机为清阳浊阴升降失调和腐秽留滞。",
        "task_3": "A:肝脾不调\n\n解析:根据刘某的临床资料，其主诉为胃痛已3年，且胃痛彻背，连及两胁，饮食减少，大便不爽，这些症状提示存在肝脾不调的情况。肝主疏泄，脾主运化，肝脾不调时，肝气郁结，横逆犯胃，导致胃痛；同时，肝气犯脾，影响脾的运化功能，出现饮食减少，大便不爽等症状。此外，手足多汗症自止，可能与肝脾不调，肝气郁结，影响汗液的正常排泄有关。因此，根据刘某的临床表现，其证候为肝脾不调。",
        "task_4": "临证体会：患者胃痛连年，痛连背胁，饮食减少，大便不爽，此乃肝胃不和，气滞血瘀之象。肝气郁结，横逆犯胃，胃失和降，故胃痛连背，痛及两胁。肝主疏泄，胃主受纳，肝胃不和，疏泄失常，受纳减少，故饮食减少。肝气郁结，气机不畅，影响大肠传导，故大便不爽。手足多汗为肝气郁结，气机不畅，汗液外泄所致，胃痛后汗止，乃因胃痛加重，气机更加郁闭，汗液内敛。脉象沉取滞涩有力，为气滞血瘀之征。治疗当以疏肝和胃，行气活血为法，方选柴胡疏肝散加减，以调和肝胃，行气止痛，活血化瘀。",
        "task_5": "辨证：肝胃不和，气滞血瘀\n\n根据刘某的临床表现，其胃痛已持续3年，且痛感连及两胁，这在中医辨证中属于肝气犯胃的范畴。肝主疏泄，喜条达而恶抑郁，若情志不畅或饮食不节，均可导致肝气郁结，进而横逆犯胃，引起胃痛。其手足多汗自止，可能与肝气郁结，气机不畅有关，汗为心之液，肝气郁结可影响心气的正常运行，从而影响汗液的正常排泄。此外，刘某大便不爽，脉象沉取滞涩有力，提示有血瘀的存在，血瘀与气滞互为因果，气滞可致血瘀，血瘀又可加重气滞，形成恶性循环。因此，刘某的病情可辨证为肝胃不和，气滞血瘀。治疗上应以疏肝理气、活血化瘀为主，辅以和胃止痛。"
    },
    {
        "input": {
            "案例编号": "病例127",
            "临床资料": "王某，女，33岁。初诊：1975年4月10日。主诉及病史：失眠10余年，今年尤为严重。近3个月来虽临睡前服安眠药，但入睡不到3小时，甚至仅睡1小时。醒后心悸不宁，烦躁，不能再入睡。上午头昏，下午头胀痛，晚上头痛尤甚，头部筋脉紧张，颈部板紧不舒，食欲不振，嗳气，健忘，精神不易集中，情绪抑郁，以往便秘，近1个月来大便日行二三次，精神疲乏，怕冷，腰酸带下。诊查：脉弦细，舌质淡青，苔薄腻。",
            "病机答案": "",
            "病机选项": "A:心失所养;B:胃阴受伤;C:胃气不降;D:精血不能濡养筋膜;E:脾不健运;F:肾气不足;G:固摄失司;H:内热;I:脾阳司运化之职;J:肾阳虚弱",
            "证候答案": "",
            "证候选项": "A:脾肾阳虚;B:脾运不畅;C:营卫失和;D:虚火内扰;E:肝脾失调;F:心脾两亏;G:胃气上逆;H:脾胃受制;I:心肝阳虚;J:脾湿内盛",
            "临证体会": ""
        },
        "task_1": "失眠;心悸不宁;烦躁;头昏;头胀痛;头痛;头部筋脉紧张;颈部板紧不舒;食欲不振;嗳气;健忘;精神不易集中;情绪抑郁;便秘;大便日行二三次;精神疲乏;怕冷;腰酸带下;脉弦细;舌质淡青;苔薄腻",
        "task_2": "心失所养;胃气不降;精血不能濡养筋膜;脾不健运;肾气不足;固摄失司\n\n解析：根据临床资料，患者有失眠、心悸、头昏、头痛、颈部不适、食欲不振、嗳气、健忘、抑郁、便秘转为大便频次增多、精神疲乏、怕冷、腰酸带下等症状。结合脉象弦细、舌质淡青、苔薄腻的诊断，可以分析病机如下：\n\n1. 心失所养：失眠、心悸、健忘、精神不易集中、情绪抑郁等症状，提示心神失养，心血不足，心神不安。\n\n2. 胃气不降：食欲不振、嗳气等症状，提示胃气不降，胃失和降，胃气上逆。\n\n3. 精血不能濡养筋膜：头部筋脉紧张、颈部板紧不舒等症状，提示精血不足，不能濡养筋膜，导致筋脉紧张。\n\n4. 脾不健运：食欲不振、大便频次增多等症状，提示脾失健运，脾虚不能运化水谷精微，导致大便异常。\n\n5. 肾气不足：精神疲乏、怕冷、腰酸带下等症状，提示肾气不足，肾阳虚弱，不能温煦全身，导致怕冷、腰酸等症状。\n\n6. 固摄失司：带下症状，提示肾气不足，固摄失司，肾气不能固摄，导致带下。\n\n综上所述，病机为心失所养、胃气不降、精血不能濡养筋膜、脾不健运、肾气不足、固摄失司。",
        "task_3": "心脾两亏;脾肾阳虚\n\n解析：根据王某的临床表现，她有失眠、心悸、头昏、头痛、颈部不适、食欲不振、嗳气、健忘、精神不易集中、情绪抑郁、便秘转为大便日行二三次、精神疲乏、怕冷、腰酸带下等症状。这些症状在中医理论中可归结为心脾两亏和脾肾阳虚。\n\n心脾两亏表现为失眠、心悸、健忘、精神不易集中、情绪抑郁，这些是心血不足、心神失养的表现。脾为后天之本，脾虚则气血生化无源，心神失养，故有上述症状。\n\n脾肾阳虚表现为食欲不振、嗳气、精神疲乏、怕冷、腰酸带下，这些是脾肾阳气不足，不能温煦全身，导致水湿内停，出现怕冷、腰酸等症状，同时脾虚不能运化，肾阳虚不能温煦，故有食欲不振、嗳气、精神疲乏等症状。\n\n综上所述，王某的证候为心脾两亏和脾肾阳虚。",
        "task_4": "此例患者长期失眠，近况尤甚，表现为入睡困难，睡眠浅，易醒，醒后心悸烦躁，难以再眠，日间头昏头痛，精神疲乏，情绪抑郁，食欲不振，嗳气，健忘，注意力难以集中，且有怕冷，腰酸，带下增多，大便性状改变等症状。从中医角度分析，此为心脾两虚，肝气郁结，兼有肾阳不足之象。\n\n心主神明，脾主运化，心脾两虚则神不守舍，运化失常，故见失眠、健忘、食欲不振等症状。肝主疏泄，肝气郁结则气机不畅，影响心神，故见烦躁、抑郁、头胀痛等。肾藏精，主水，肾阳不足则温煦失职，故见怕冷、腰酸、带下增多。舌质淡青，苔薄腻，脉弦细，均为心脾两虚，肝气郁结，肾阳不足的舌脉表现。\n\n治疗上，应以补益心脾，疏肝解郁，温补肾阳为原则。方药可选用归脾汤加减，以补益心脾；柴胡疏肝散加减，以疏肝解郁；并可酌情加入温补肾阳之品，如肉桂、附子等。同时，注意调摄情志，保持心情舒畅，适当运动，以助气血流通，改善睡眠质量。",
        "task_5": "### 辨证\n辨证：此患者之症，属心脾两虚，肝气郁结，兼有寒湿下注。心主神明，脾主运化，心脾两虚则神不守舍，故见失眠、心悸、健忘、精神不易集中；肝气郁结则情绪抑郁，头胀痛，颈部板紧不舒；寒湿下注则腰酸带下，怕冷，大便日行二三次。脉弦细为肝郁脾虚之象，舌质淡青、苔薄腻为寒湿内停之征。治疗当以补益心脾、疏肝解郁、温化寒湿为法。"
    },
    {
        "input": {
            "案例编号": "病例36",
            "临床资料": "宋某，女，17岁。初诊：1982年10月21日。主诉及病史：患“重症肌无力”，左眼睑下垂，影响视力，气短，全身无力，朝轻暮重，劳累加重。诊查：舌淡光红，苔白，脉极细弱。",
            "病机答案": "",
            "病机选项": "A:络伤血瘀;B:湿热郁阻中焦;C:素体阳虚;D:肝经郁热;E:热聚于阳明胃腑;F:毒邪侵袭;G:阴虚阳盛;H:心神亏虚;I:脾肾不足;J:气虚不能固卫腠理",
            "证候答案": "",
            "证候选项": "A:脾虚清气下陷;B:气滞血瘀;C:伏风夹瘀;D:真阴亏损;E:气阴亏损;F:阴虚阳浮;G:湿痰阻滞经络;H:痰浊内阻;I:厥阳升扰;J:血虚",
            "临证体会": ""
        },
        "task_1": "左眼睑下垂;气短;全身无力;朝轻暮重;劳累加重;舌淡光红;苔白;脉极细弱",
        "task_2": "I:脾肾不足;J:气虚不能固卫腠理\n\n### 解析\n宋某，女，17岁，主诉及病史显示其患有“重症肌无力”，表现为左眼睑下垂，影响视力，气短，全身无力，朝轻暮重，劳累加重。这些症状在中医理论中，与脾肾不足和气虚不能固卫腠理的病机相符合。\n\n- 脾肾不足：脾主肌肉，肾藏精，主骨生髓。脾肾不足，精气不充，肌肉失养，表现为全身无力，气短，朝轻暮重，劳累加重。脾肾为后天之本，先天之本，脾肾不足，影响全身气血的生成和运行，导致肌肉无力，眼睑下垂等症状。\n\n- 气虚不能固卫腠理：气虚则卫气不足，不能固摄腠理，腠理开合失常，表现为气短，全身无力，易感外邪。气虚不能推动血液运行，导致血行不畅，肌肉失养，加重肌肉无力症状。\n\n综上所述，宋某的病机为脾肾不足和气虚不能固卫腠理。治疗上应以补益脾肾，固摄卫气，调和气血为主，以改善其肌肉无力，眼睑下垂等症状。",
        "task_3": "脾虚清气下陷;气阴亏损\n\n重症肌无力在中医中常被归类为“痿证”，与脾虚、气阴两虚等证候相关。患者左眼睑下垂，全身无力，朝轻暮重，劳累加重，这些症状提示了脾虚不能升清，清气下陷，以及气阴两虚，不能濡养筋脉，导致肌肉无力。舌淡光红，苔白，脉极细弱，也支持了这一诊断。因此，脾虚清气下陷和气阴亏损是本例患者的证候。",
        "task_4": "临证体会：本例重症肌无力，表现为左眼睑下垂，气短，全身无力，朝轻暮重，劳累加重，是典型的脾肺气虚，中气下陷之象。脾为后天之本，主肌肉四肢，肺主气，司呼吸，二者气虚则肌肉失养，气短乏力。朝轻暮重，劳累加重，提示气虚不能持续支持日常活动，劳累后更甚。舌淡光红，苔白，脉极细弱，均为气虚之象。治疗当以补益脾肺，升举中气为主，可选用补中益气汤加减，以黄芪、党参、白术、升麻、柴胡等药物为主，以补气升阳，固表止汗，增强肌肉力量，改善症状。",
        "task_5": "### 辨证\n辨证：脾肾两虚，气阴不足\n\n解析：宋某，女，17岁，主诉左眼睑下垂，影响视力，气短，全身无力，朝轻暮重，劳累加重。这些症状提示了气虚和阴虚的可能。舌淡光红，苔白，脉极细弱，进一步支持了脾肾两虚，气阴不足的辨证。脾为后天之本，主运化，肾为先天之本，主藏精。脾肾两虚，导致气生化不足，气虚则无力支撑眼睑，全身无力，朝轻暮重，劳累加重，均为气虚之象。同时，气虚日久，阴液生化无源，故见气阴两虚。"
    }
]