[{"input": {"案例编号": "病例30", "临床资料": "王某，男，38岁。初诊:1979年9月12日。主诉及病史:鼻流血15天。8月17日，突然鼻流血，最严重的一天流血5次，每次约100~300ml，继而时出时止，头昏晕痛，口渴鼻干，胸闷气逆，大便干。诊查:脉浮大数、84次/分，舌苔薄白、舌质红。", "病机答案": "", "病机选项": "A:肝郁;B:伤阴耗气;C:湿邪阻滞;D:阴虚阳亢;E:耗伤心神;F:损伤中气;G:扰动神明;H:血热不固;I:水饮内停;J:热伤肺络", "证候答案": "", "证候选项": "A:脾胃不和;B:血热妄行;C:心肾两亏;D:湿热互结;E:邪陷心包;F:暑温动风;G:脾肾阳虚;H:痰蒙心窍;I:热伤阳络;J:痰湿内蕴", "临证体会": ""}, "task_1": "鼻流血;头昏晕痛;口渴鼻干;胸闷气逆;大便干;脉浮大数;舌苔薄白;舌质红", "task_2": "血热不固;阴虚阳亢\n\n### 解析\n根据王某的临床表现，鼻流血15天，最严重的一天流血5次，每次约100~300ml，这表明血热不固，血热迫血妄行，导致鼻血不止。同时，头昏晕痛，口渴鼻干，胸闷气逆，大便干，脉浮大数、84次/分，舌苔薄白、舌质红，这些症状提示阴虚阳亢，阴液不足，阳气亢盛，导致体内热象明显，血热不固，从而引发鼻血。因此，病机答案为血热不固和阴虚阳亢。", "task_3": "血热妄行\n\n### 解析\n根据王某的临床表现，鼻流血15天，最严重的一天流血5次，每次约100~300ml，伴随头昏晕痛，口渴鼻干，胸闷气逆，大便干等症状，结合脉浮大数、舌苔薄白、舌质红的脉象和舌象，可以判断为血热妄行的证候。血热妄行是由于体内热邪炽盛，热迫血行，导致血不循经，妄行而出，表现为鼻衄、吐血、便血等症状，同时伴有口渴、舌红、脉数等热象。治疗上应以清热凉血、止血为主。", "task_4": "本例患者鼻流血，且出血量较大，伴有头昏晕痛，口渴鼻干，胸闷气逆，大便干等症状，结合脉浮大数、舌苔薄白、舌质红的诊查结果，可辨证为血热妄行型鼻衄。\n\n血热妄行型鼻衄，多因火热之邪上炎，迫血妄行，血不循经所致。患者脉浮大数，提示体内有热邪上扰；舌质红，舌苔薄白，说明体内有热而津液未大伤；大便干，胸闷气逆，提示热邪影响了肺胃的正常功能，肺胃热盛，热邪上炎，迫血妄行，导致鼻衄。\n\n治疗上，应以清热凉血、止血固摄为原则。可选用清热解毒、凉血止血的药物，如生地、丹皮、赤芍、槐花、地榆等，同时配以清肺胃热的药物，如黄芩、黄连、石膏等，以达到清热凉血、止血固摄的目的。在治疗过程中，还应注意调养，避免辛辣刺激食物，保持大便通畅，以利于病情的恢复。", "task_5": "### 辨证\n辨证：肺胃热盛，迫血妄行\n\n根据王某的临床表现，鼻流血15天，伴有头昏晕痛，口渴鼻干，胸闷气逆，大便干等症状，结合脉浮大数、舌苔薄白、舌质红的脉象和舌象，可以辨证为肺胃热盛，迫血妄行。肺主气，胃主受纳腐熟，肺胃热盛则气机不畅，热迫血行，导致鼻血不止。同时，热邪伤津，故见口渴鼻干；热邪上扰清窍，故见头昏晕痛；热邪下迫大肠，故见大便干。治疗上应清热凉血，止血固摄，可用清肺胃热、凉血止血的方剂，如犀角地黄汤加减，以清热解毒，凉血止血。同时，注意饮食清淡，避免辛辣刺激之品，以免加重热象。"}, {"input": {"案例编号": "病例350", "临床资料": "谭某，男，9岁:初诊:1977年1月8日。主诉及病史:患儿于1岁9个月时突然发热、浮肿，当时诊为急性肾炎。以后曾在多所医院住院治疗，诊为慢性肾炎，曾用中西药物而疗效不显。后来家长失去信心，不再予治疗。1976年12月底，患儿发热、咳嗽，以后出现嗜睡、鼻衄、恶心、呕吐、尿少，于1977年1月某日急诊入院。入院时体检:明显消瘦，皮肤干燥，鼻翼煽动，呼吸困难，心律不齐。实验室检查:二氧化碳结合力12.2容积%，尿素氮216mg%，血色素5.8g，诊断为慢性肾炎、尿毒症、酸中毒、继发性贫血。入院后立即输液、纠正酸中毒及脱水;予抗生素和中药真武汤、生脉散加味方，症状稍有稳定，二氧化碳结合力上升至56容积%，但全身症状无大改善，仍处于嗜睡衰竭状态，同时有鼻衄、呕吐咖啡样物。1月6日血色素降至4.5g，当时曾予输血。1月7日患儿情况转重，不能饮食，恶心呕吐频频发作，服药亦十分困难;大便1日数次，呈柏油样便;并有呕血、呼吸慢而不整(14~18次/分)，心率减至60~65次/分，当即予可拉明、洛贝林、生脉散注射液交替注射。1月8日，患儿继续呈嗜睡衰竭状态，面色晦暗，呼吸减慢，心率减慢至60次/分，大便仍为柏油便，情况越来越重，因急请会诊。诊查:会诊时，患儿呈嗜睡朦胧状态，时有恶心呕吐，呼吸深长而慢，脉沉细微弱无力而迟，舌嫩润齿痕尖微赤，苔薄白干中心微黄。", "病机答案": "", "病机选项": "A:热结阳明;B:风阳上升;C:疫毒乘虚内侵中焦;D:冲任受损;E:气血两虚;F:心移热于小肠;G:气阴两虚;H:脾胃败绝;I:肠道传导失司;J:痰浊", "证候答案": "", "证候选项": "A:肝肾同病;B:气阴两竭;C:气血亏虚;D:瘀血阻络;E:气血失调;F:郁滞胸脘;G:心阳不振;H:本虚标实;I:气血两亏;J:瘀血凝滞", "临证体会": ""}, "task_1": "核心临床信息: 明显消瘦;皮肤干燥;鼻翼煽动;呼吸困难;心律不齐;嗜睡;鼻衄;恶心;呕吐;尿少;面色晦暗;呼吸减慢;心率减慢至60次/分;大便柏油样;脉沉细微弱无力而迟;舌嫩润齿痕尖微赤;苔薄白干中心微黄。", "task_2": "脾胃败绝;气阴两虚\n\n解析: 根据临床资料，患儿有慢性肾炎、尿毒症、酸中毒、继发性贫血的病史，入院时明显消瘦，皮肤干燥，鼻翼煽动，呼吸困难，心律不齐，全身症状无大改善，处于嗜睡衰竭状态，有鼻衄、呕吐咖啡样物，大便1日数次，呈柏油样便，有呕血，面色晦暗，呼吸减慢，心率减慢至60次/分，大便仍为柏油便。这些症状表明患儿的脾胃功能极度衰竭，气阴两虚，无法正常运化水谷精微，导致气血生化无源，全身脏腑功能衰竭，故病机为脾胃败绝;气阴两虚。", "task_3": "气阴两竭;瘀血阻络\n\n解析: 根据临床资料，患儿有慢性肾炎、尿毒症、酸中毒、继发性贫血的病史，表现为明显消瘦、皮肤干燥、呼吸困难、心律不齐、嗜睡、鼻衄、恶心、呕吐、尿少等症状，实验室检查显示二氧化碳结合力低、尿素氮高、血色素低，这些都是气阴两竭的表现。同时，患儿有呕血、柏油样便，提示有瘀血阻络的情况。因此，综合分析，证候为气阴两竭和瘀血阻络。", "task_4": "临证体会：患儿病情危重，表现为慢性肾炎、尿毒症、酸中毒、继发性贫血，中医辨证为肾气不固、脾肾阳虚、气血两亏、心肺气虚之象。肾为先天之本，主水液代谢，肾气不固则水液代谢失常，出现水肿、尿少；脾为后天之本，主运化水湿，脾肾阳虚则运化失司，水湿内停，加之气血两亏，心肺气虚，导致全身症状加重，面色晦暗，呼吸困难，心律不齐，嗜睡衰竭。\n\n治疗上，前期虽用真武汤、生脉散加味方，旨在温阳利水、益气固脱，但病情未见明显好转，说明正气已极虚，邪气深重。此时，应重在扶正固本，急则治其标，缓则治其本。可考虑加用大剂人参、黄芪、附子等大补元气、温阳固脱之品，同时配伍茯苓、泽泻、车前子等利水渗湿之药，以助肾气恢复，改善水液代谢。对于出血症状，可加用地榆、侧柏叶等止血之品，以控制鼻衄、呕血、柏油样便。同时，注意调养脾胃，以助后天之本，可加用白术、山药等健脾益气之药。\n\n治疗过程中，需密切观察病情变化，调整治疗方案，以期达到扶正祛邪、固本培元之效，改善患儿全身状况，缓解症状，提高生活质量。", "task_5": "### 辨证\n辨证：肾阳虚衰，气血两亏，水湿内停，心神失养\n\n解析：根据患儿的临床表现，可见其长期患有慢性肾炎，近期病情加重，出现尿毒症、酸中毒、继发性贫血等症。中医辨证分析如下：\n\n1. **肾阳虚衰**：患儿长期肾病，肾阳虚衰，不能温煦全身，故见消瘦、皮肤干燥、心律不齐等症。肾阳虚衰，水液代谢失常，故见浮肿、尿少。\n\n2. **气血两亏**：长期疾病消耗，加之近期病情加重，导致气血两亏。血色素低，面色晦暗，心率减慢，皆为气血不足之象。\n\n3. **水湿内停**：肾阳虚衰，水液代谢失常，水湿内停，可见浮肿、尿少。\n\n4. **心神失养**：气血两亏，心神失养，故见嗜睡、呼吸困难、心律不齐等症。心神失养，加之水湿内停，可见恶心呕吐、呼吸深长而慢。\n\n5. **舌脉象**：舌嫩润齿痕尖微赤，苔薄白干中心微黄，脉沉细微弱无力而迟，均为肾阳虚衰、气血两亏、水湿内停之象。\n\n综上所述，患儿的辨证为肾阳虚衰，气血两亏，水湿内停，心神失养。治疗当以温补肾阳、益气养血、利水消肿、安神定志为原则。"}]