[
    {
        "input": {
            "案例编号": "病例247",
            "临床资料": "某女，62岁。初诊：1957年1月。主诉及病史：发病十数天，咳逆不能平卧，唾白色泡沫痰。诊查：短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口。脉浮细数而无力。",
            "病机答案": "",
            "病机选项": "A:痰浊;B:耗损心气和心阴;C:食郁于胃;D:少阴伤寒;E:心移热于小肠;F:气阴两亏;G:脾胃湿热;H:阴虚内热;I:肾水不足;J:心气虚",
            "证候答案": "",
            "证候选项": "A:风湿内侵;B:气虚血瘀;C:血虚生风;D:肾元不固;E:虚火牙痛;F:肝气横逆;G:阴亏之体;H:感暑邪;I:复感外邪;J:阴寒内盛",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 咳逆不能平卧;唾白色泡沫痰;短气;语音低微;神识昏愦不清;时妄言语;身有微热;手足厥冷;脉浮细数而无力。",
        "task_2": "F:气阴两亏;J:心气虚\n\n解析：根据临床资料，患者有咳逆不能平卧，唾白色泡沫痰，短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口，脉浮细数而无力。这些症状提示患者可能存在气阴两亏和心气虚的情况。气阴两亏表现为气短、乏力、脉细数无力，心气虚则表现为心悸、短气、神识昏愦不清等症状。因此，病机答案为F:气阴两亏;J:心气虚。",
        "task_3": "G:阴亏之体;I:复感外邪\n\n解析：根据临床资料，患者有咳逆不能平卧，唾白色泡沫痰，短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口，脉浮细数而无力等症状。这些症状提示患者可能有阴液亏损，复感外邪的情况。阴亏之体表现为脉细数无力，手足厥冷，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，唾白色泡沫痰等症状。复感外邪表现为咳逆不能平卧，唾白色泡沫痰，短气，手足厥冷，脉浮细数而无力等症状。因此，证候答案为G:阴亏之体;I:复感外邪。",
        "task_4": "### 临证体会\n\n本例患者年高体弱，病程虽短，但病情危重。咳逆不能平卧，唾白色泡沫痰，提示肺气上逆，水饮内停。短气，语音低微，神识昏愦不清，时妄言语，这些症状表明患者正气大衰，心肺功能受损，且有神志异常，可能为痰蒙心窍或心肺气虚，神明失养所致。身有微热，手足厥冷，偶饮热一二口，提示阳气虚衰，阴寒内盛，阳气不能温煦四肢，故手足厥冷，微热可能为虚阳外越之象。脉浮细数而无力，为阳气虚脱，阴液不足之象。综合分析，本病为肺气虚衰，心阳不振，水饮内停，痰蒙心窍之危重证候。治疗当以温阳化饮，开窍醒神为主，同时扶正固本，以期挽回危局。"
    },
    {
        "input": {
            "案例编号": "病例142",
            "临床资料": "万某，男，45岁。初诊：1977年11月6日。主诉及病史：1个月前因左副鼻窦炎连续注射链霉素7g，引起眩晕耳鸣，走路时摇晃如醉人，并有复视(不走路时没有复视)，至今未愈。经常嗳气上逆，大便干结。已经3个医院神经科检查，无异常发现。诊查：血压100/70mmHg。脉弦细带滑，舌胖，苔微黄而润。",
            "病机答案": "",
            "病机选项": "A:风热外袭;B:络道阻塞;C:脾胃运化失常;D:幽门塞阻;E:肺阴亏损;F:损及肾阴;G:生湿成痰;H:痰浊内蕴;I:心肝血虚火旺;J:清阳失展",
            "证候答案": "",
            "证候选项": "A:下元虚损;B:痰浊上逆;C:湿热蕴积;D:肝郁气滞;E:肝肾阴虚;F:寒热互结;G:心肝阳虚;H:真阴亏损;I:清气不升;J:伤脾胃",
            "临证体会": ""
        },
        "task_1": "眩晕;耳鸣;走路时摇晃如醉人;复视(不走路时没有复视);嗳气上逆;大便干结;脉弦细带滑;舌胖;苔微黄而润",
        "task_2": "病机答案: 脾胃运化失常;生湿成痰;痰浊内蕴\n\n解析：根据患者临床资料，患者出现眩晕耳鸣，走路时摇晃如醉人，以及复视等症状，同时伴有嗳气上逆和大便干结。脉象弦细带滑，舌胖，苔微黄而润，这些症状和体征提示病机可能涉及脾胃运化失常，导致生湿成痰，痰浊内蕴。脾胃为后天之本，主运化水湿，脾胃功能失常可导致湿邪内生，湿聚成痰，痰浊上扰清窍，引起眩晕、耳鸣等症状。同时，痰浊阻滞，影响清阳之气的升发，导致走路时摇晃如醉人，复视等症状。因此，病机答案为脾胃运化失常;生湿成痰;痰浊内蕴。",
        "task_3": "痰浊上逆;肝郁气滞\n\n解析：根据临床资料，患者出现眩晕耳鸣，走路时摇晃如醉人，伴有复视，嗳气上逆，大便干结等症状。脉弦细带滑，舌胖，苔微黄而润，这些症状和舌脉表现提示可能存在痰浊上逆和肝郁气滞的情况。痰浊上逆可以导致眩晕耳鸣，走路不稳，而肝郁气滞则可以引起嗳气上逆和大便干结。因此，结合患者的具体症状和舌脉表现，证候答案为痰浊上逆和肝郁气滞。",
        "task_4": "临证体会：本案患者因连续使用链霉素治疗左副鼻窦炎后出现眩晕、耳鸣、走路不稳及复视等症状，中医辨证分析，此乃肝胆之气上逆，清阳不升，浊阴不降所致。链霉素为西药，其性寒，易伤脾胃，脾胃为后天之本，主运化水谷精微，若脾胃受损，清阳不升，则易致眩晕、耳鸣；浊阴不降，则见嗳气上逆，大便干结。脉弦细带滑，舌胖，苔微黄而润，此为肝胆湿热之象，湿热上扰清窍，故有眩晕、耳鸣及复视之症。治疗当以清肝胆湿热，调和脾胃，升清降浊为法。"
    },
    {
        "input": {
            "案例编号": "病例23",
            "临床资料": "吴某，男，52岁。初诊:1985年1月10日。主诉及病史:患高血压病十余载。1月3日晚暴怒之后昏然入睡，晨起醒来，即见口眼歪斜(歪向左侧)，嘴角抽搐时作，流涎不止，左半身不利，手指麻木不仁，步履拖拉，膝软无力，言语睿涩，头目眩晕，耳鸣，嗜睡，面红目赤，口苦咽干，心烦易躁，纳可，便干、二日一行，虽经治疗，收效甚微。脉弦劲略滑，舌红体胖且左偏，边有齿痕，苔白腻满布，血压210/110mmHg。",
            "病机答案": "",
            "病机选项": "A:肝风夹痰;B:湿热交蒸肝胆;C:痰湿内盛;D:肝阳化火;E:阴虚阳亢;F:伏湿内蕴;G:神明受扰,;H:气血逆乱;I:气化失调;J:火升风动",
            "证候答案": "",
            "证候选项": "A:肝肾阴虚;B:肝风内动;C:心肾不交;D:卫外不固;E:气阴两伤;F:肝火亢盛;G:湿热郁遏;H:热在气分;I:热伤胃阴;J:风痰窜络",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 高血压病史;口眼歪斜(歪向左侧);嘴角抽搐;流涎;左半身不利;手指麻木不仁;步履拖拉;膝软无力;言语睿涩;头目眩晕;耳鸣;嗜睡;面红目赤;口苦咽干;心烦易躁;便干、二日一行;脉弦劲略滑;舌红体胖且左偏;边有齿痕;苔白腻满布;血压210/110mmHg。",
        "task_2": "A:肝风夹痰;D:肝阳化火;J:火升风动\n\n解析:根据吴某的临床资料，我们可以分析其病机如下:\n1. 口眼歪斜、嘴角抽搐、流涎、左半身不利、手指麻木不仁、步履拖拉、膝软无力等症状，提示存在肝风内动，夹有痰湿，故选A:肝风夹痰。\n2. 面红目赤、口苦咽干、心烦易躁、脉弦劲略滑、舌红体胖且左偏、边有齿痕、苔白腻满布等，提示肝阳化火，故选D:肝阳化火。\n3. 高血压、头目眩晕、耳鸣、便干、二日一行等症状，提示火升风动，故选J:火升风动。",
        "task_3": "B:肝风内动;F:肝火亢盛;J:风痰窜络\n\n### 解析\n吴某的临床表现符合中医辨证中的“肝风内动”和“肝火亢盛”，以及“风痰窜络”。暴怒之后出现的口眼歪斜、嘴角抽搐、流涎、半身不利、手指麻木、步履拖拉、膝软无力、言语不清、头目眩晕、耳鸣、面红目赤、口苦咽干、心烦易躁等症状，均是肝风内动和肝火亢盛的典型表现。同时，舌红体胖且左偏、边有齿痕、苔白腻满布，以及脉弦劲略滑，提示有风痰窜络的情况。此外，血压的显著升高（210/110mmHg）也与肝火亢盛有关。",
        "task_4": "临证体会：患者长期患有高血压，加之暴怒之后，肝阳暴亢，风火上扰，导致气血逆乱，经络阻滞。肝阳化风，风火相煽，上扰清窍，故见口眼歪斜，嘴角抽搐，流涎，头目眩晕，耳鸣；肝阳上亢，气血上逆，故面红目赤，口苦咽干，心烦易躁；肝肾阴虚，筋脉失养，故左半身不利，手指麻木不仁，膝软无力；脾虚湿盛，湿浊内生，故见便干，二日一行，苔白腻满布；舌红体胖且左偏，边有齿痕，脉弦劲略滑，均为肝阳上亢，风痰阻络之象。治疗当平肝熄风，化痰通络，滋阴潜阳，调和气血。"
    },
    {
        "input": {
            "案例编号": "病例102",
            "临床资料": "黄某，女，39岁。初诊：1973年10月31日。主诉及病史：自诉进食困难，呕吐，胸闷已3月余。患者久有头部太阳穴处刺痛之疾，并觉后脑麻木，耳鸣、似有耳垢闭塞，心悸气促等。近3个月来，觉左喉间似有一物阻碍进食，故不能进有形之食物，仅能吃流质，胸闷痛，嗳气多，时作干呕，食则呕吐，大便溏泄，夜寐不宁，月经量少、色淡，且经行不畅；每次月经来潮上述症状加重。曾在某医院作X线胃肠钡餐检查，诊为“食管中段憩室，冗长十二指肠及双憩室”。诊查：来诊时患者面黄体瘦，精神疲乏，起坐需人扶持，胸胁痛，两足酸软，舌淡红，苔少，脉弦细而迟弱。",
            "病机答案": "",
            "病机选项": "A:痰浊夹肝风上逆;B:脾气散乱;C:心失所养;D:痰阻肺道;E:外邪袭肺;F:风邪伏肺;G:气血两虚;H:胃失和降;I:饮邪化热;J:脏腑失养",
            "证候答案": "",
            "证候选项": "A:肝肾亏虚;B:血不归经;C:阴虚肝郁;D:虚火内扰;E:下虚失摄;F:脾失健运;G:阳明燥实;H:郁而化热;I:胃中虚冷;J:寒饮上逆",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 进食困难;呕吐;胸闷;头部太阳穴处刺痛;后脑麻木;耳鸣;耳垢闭塞感;心悸;气促;左喉间异物感;胸闷痛;嗳气多;干呕;食则呕吐;大便溏泄;夜寐不宁;月经量少;月经色淡;经行不畅;胸胁痛;两足酸软;舌淡红;苔少;脉弦细而迟弱。",
        "task_2": "胃失和降;气血两虚\n\n解析：根据患者临床表现，进食困难、呕吐、胸闷、嗳气、干呕、大便溏泄等症状，提示胃失和降，胃气上逆。同时，患者面黄体瘦、精神疲乏、胸胁痛、两足酸软、舌淡红、苔少、脉弦细而迟弱，提示气血两虚，脏腑失养。因此，病机答案为胃失和降与气血两虚。",
        "task_3": "C:阴虚肝郁;I:胃中虚冷\n\n解析：根据患者临床表现，如进食困难、呕吐、胸闷、嗳气、干呕、大便溏泄、夜寐不宁、月经量少色淡、经行不畅，以及面黄体瘦、精神疲乏、胸胁痛、两足酸软、舌淡红、苔少、脉弦细而迟弱，可以判断患者存在阴虚肝郁和胃中虚冷的证候。阴虚肝郁表现为情绪抑郁、胸胁痛、月经不调等症状，胃中虚冷则表现为进食困难、呕吐、胸闷、嗳气、干呕、大便溏泄等症状。",
        "task_4": "临证体会：此病多因肝气郁结，横逆犯胃，加之久病体虚，脾胃功能受损，运化失常，导致气机不畅，升降失司。肝气郁结，气滞于胸，故胸闷痛，嗳气多，进食困难，呕吐；脾胃虚弱，运化无力，故大便溏泄，夜寐不宁；肝血不足，不能上荣于头，故头部太阳穴处刺痛，后脑麻木，耳鸣；心肝血虚，心失所养，故心悸气促；月经量少、色淡，且经行不畅，亦为肝血不足，血海空虚之象。脉弦细而迟弱，舌淡红，苔少，均为肝郁脾虚，气血两虚之征。治疗当疏肝解郁，健脾和胃，养血安神。"
    },
    {
        "input": {
            "案例编号": "病例10",
            "临床资料": "张某，38岁，已婚。主诉及病史：素禀不充，中气虚弱，已近中年，又复怀孕，今已5个月余。3天来痢下白多赤少，日行七八次，里急后重，小溲黄而短，寒热口干，不思饮纳，头疼泛恶，腰胯酸楚。诊查：脉滑小数、两尺较弱，舌质淡红，苔白而腻。",
            "病机答案": "",
            "病机选项": "A:外邪束表;B:肝郁气滞;C:肾气虚弱;D:素体气虚;E:传化失司;F:脏腑气血功能紊乱;G:痰涎壅积;H:营卫不利;I:湿重于热;J:湿郁化热",
            "证候答案": "",
            "证候选项": "A:痰蒙清窍;B:气血失养;C:血热;D:痰湿内蕴;E:心肝阳虚;F:水血互结;G:湿重于热;H:湿热互结;I:兼感外邪;J:心肾不交",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 痢下白多赤少;里急后重;小溲黄而短;寒热口干;不思饮纳;头疼泛恶;腰胯酸楚;脉滑小数;两尺较弱;舌质淡红;苔白而腻。",
        "task_2": "D:素体气虚;E:传化失司;I:湿重于热\n\n解析：根据张某的临床资料，她素禀不充，中气虚弱，这表明她有素体气虚（D）的情况。怀孕5个月余，痢下白多赤少，日行七八次，里急后重，这些症状表明她的消化系统传化功能失司（E），即消化和排泄功能紊乱。小溲黄而短，寒热口干，不思饮纳，头疼泛恶，腰胯酸楚，这些症状与湿重于热（I）相符合，湿邪困脾，影响了脾胃的运化功能，导致湿重于热的病机。",
        "task_3": "G:湿重于热;B:气血失养\n\n解析：根据张某的临床资料，她有中气虚弱、怀孕5个月、痢下白多赤少、日行七八次、里急后重、小溲黄而短、寒热口干、不思饮纳、头疼泛恶、腰胯酸楚等症状。脉滑小数、两尺较弱，舌质淡红，苔白而腻。这些症状和脉象、舌象提示存在湿重于热和气血失养的情况。湿重于热表现为痢下白多赤少、小溲黄而短、舌苔白而腻；气血失养表现为中气虚弱、不思饮纳、头疼泛恶、腰胯酸楚、脉滑小数、两尺较弱。因此，证候答案为G:湿重于热;B:气血失养。",
        "task_4": "临证体会：本例患者为中气虚弱，加之妊娠加重了身体负担，导致脾胃功能进一步受损。现出现痢疾症状，白多赤少，表明湿邪偏重，且有寒热口干、不思饮食、头疼泛恶等表现，均为湿邪困脾、脾胃运化失常所致。腰胯酸楚，小溲黄短，提示肾气亦受影响。脉滑小数、两尺较弱，舌质淡红、苔白腻，均为脾胃虚弱、湿邪内阻之象。治疗当以健脾利湿、调和中气为主，同时兼顾安胎，以保障母子健康。"
    },
    {
        "input": {
            "案例编号": "病例92",
            "临床资料": "张某，男，19岁。初诊：1963年5月24日。主诉及病史：全身浮肿已5年，经某医院诊断为慢性肾炎，治疗未效，近来症状加剧。诊查：就诊时，除全身浮肿外，兼见大便溏泄，一日数行，小溲短少。时时欲呕，或食入即吐。精神委靡，面色觥白，唇淡不荣，舌苔薄白，脉沉细涩，足胫按之凹陷。尿检：蛋白(++++)，粒状管型(+++)，脓球(+++)，红细胞(++)。",
            "病机答案": "",
            "病机选项": "A:心火又灼肺;B:命门火衰;C:水不涵木;D:肝郁;E:精血不充;F:气血运行不畅;G:肝气不疏;H:清阳不升;I:脾失健运;J:肝阴亏损",
            "证候答案": "",
            "证候选项": "A:肾水无制;B:三阳合病;C:脾肾阳虚;D:肾阴未固;E:湿热下注;F:热病伤阴;G:慢脾风象;H:暑温;I:脾虚不运;J:脾胃虚弱",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 全身浮肿;大便溏泄;小溲短少;欲呕;食入即吐;精神委靡;面色觥白;唇淡不荣;舌苔薄白;脉沉细涩;足胫凹陷;蛋白尿(++++);粒状管型(+++);脓球(+++);红细胞(++)。",
        "task_2": "脾失健运;命门火衰\n\n解析：根据临床资料，患者全身浮肿已5年，近期症状加剧，表现为大便溏泄，小溲短少，精神委靡，面色觥白，唇淡不荣，舌苔薄白，脉沉细涩，足胫按之凹陷，尿检异常。这些症状提示患者可能存在脾肾功能失调，脾失健运导致水湿不化，命门火衰则肾阳不足，无法温煦脾土，共同导致水湿内停，表现为全身浮肿等症状。因此，病机答案为脾失健运和命门火衰。",
        "task_3": "C:脾肾阳虚",
        "task_4": "临证体会：患者张某，19岁，长期患有慢性肾炎，表现为全身浮肿，大便溏泄，小溲短少，食欲不振，精神状态差，面色觥白，唇色淡，舌苔薄白，脉象沉细涩，这些症状均提示患者脾肾功能受损，水湿内停，气化不利。足胫按之凹陷，是典型的水湿下注，肾气不固的表现。尿检结果显示蛋白、粒状管型、脓球和红细胞的异常，进一步证实了肾功能的损害。\n\n中医认为，肾为先天之本，主水液代谢，脾为后天之本，主运化水湿。患者长期慢性肾炎，肾气亏损，不能固摄水液，加之脾虚运化失常，水湿内停，上逆于胃，故见呕吐、食欲不振等症状。脾肾两虚，气化功能减退，导致水湿泛滥，表现为全身浮肿。脉沉细涩，反映气血运行不畅，肾精亏损。\n\n治疗上，应以补肾健脾，利水消肿为原则，可选用补中益气、温肾助阳、利水渗湿的中药，如黄芪、茯苓、白术、泽泻、猪苓、肉桂等，以恢复脾肾功能，促进水液代谢，消除浮肿。同时，注意饮食调理，避免过咸、过冷、过油腻的食物，以免加重水湿内停。"
    },
    {
        "input": {
            "案例编号": "病例44",
            "临床资料": "李某，男，40岁。初诊:1963年12月12日。主诉及病史:右侧腰部(右肾区)酸痛坠胀5个月许，动则更甚，转侧不利，难以俯仰。X线摄片示右肾下垂(在第3腰椎以下)。某医院认为无有效疗法，乃来求治。诊查:外形不变，叩之痛剧，面色不华，身体较瘦，脉象沉细，苔色淡薄。",
            "病机答案": "",
            "病机选项": "A:炼液为痰;B:气血生化无源;C:肾阳虚弱;D:精血亏损;E:瘀血阻于经隧脉络;F:气血瘀滞;G:脾胃原虚;H:肝郁;I:肾亏;J:脾寒",
            "证候答案": "",
            "证候选项": "A:肝经郁火;B:肾阳虚衰;C:气血两亏;D:脾胃虚弱;E:气血失养;F:血虚兼受风湿之邪;G:热在气分;H:心肺脾(胃)积热;I:气滞血瘀;J:肝阴不足",
            "临证体会": ""
        },
        "task_1": "右侧腰部(右肾区)酸痛坠胀;动则更甚;转侧不利;难以俯仰;X线摄片示右肾下垂(在第3腰椎以下);面色不华;身体较瘦;脉象沉细;苔色淡薄。",
        "task_2": "肾亏;瘀血阻于经隧脉络",
        "task_3": "肾阳虚衰;气血失养\n\n### 解析\n根据临床资料，患者主诉右侧腰部（右肾区）酸痛坠胀，动则更甚，转侧不利，难以俯仰，且X线摄片示右肾下垂（在第3腰椎以下）。这些症状提示肾阳虚衰，肾气不足，不能固摄，导致肾下垂。同时，患者面色不华，身体较瘦，脉象沉细，苔色淡薄，这些是气血失养的表现。因此，证候答案为肾阳虚衰和气血失养。",
        "task_4": "临证体会：患者右侧腰部酸痛坠胀，动则更甚，转侧不利，难以俯仰，此为肾气不足，肾虚下陷之象。肾主骨，腰为肾之府，肾气虚弱，不能固摄，故腰部酸痛坠胀，且在活动时加重。肾下垂在X线摄片中显示在第3腰椎以下，此为肾气下陷，肾失固摄之征。面色不华，身体较瘦，脉象沉细，苔色淡薄，均为气血不足，肾精亏损之象。肾为先天之本，肾气虚弱，不能滋养全身，故见上述症状。治疗当以补肾固摄，升提肾气为主，以期改善肾下垂，缓解腰部症状。"
    },
    {
        "input": {
            "案例编号": "病例172",
            "临床资料": "葛某，男，34岁。初诊：1959年3月10日。主诉及病史：头昏、腹胀、双下肢浮肿8个月，曾住某县医院，诊断为“肝硬化腹水”，经治疗后有所好转。近2个月来，病情反复，腹胀加重，面部浮肿，尿少，大便稀、有粘液、每日3～6次，饮食精神欠佳，急躁易怒，经抽腹水、注射利尿药等治疗，效果不理想，转住我院。诊查：肖老会诊，症见面色青、气短息微，腹满绷急，脐凸出，腹壁青筋暴露，两胁下深触有较硬包块，腹围96cm，面部及双下肢浮肿。脉弦数，苔白，舌质微红。",
            "病机答案": "",
            "病机选项": "A:水邪泛滥;B:化风;C:风热犯肺;D:水谷精微吸收差;E:肝气郁结;F:湿困经络;G:胁肋内伤;H:横逆犯脾;I:恚怒伤肝;J:肝阴不足",
            "证候答案": "",
            "证候选项": "A:伏风夹瘀;B:水邪泛滥;C:肝肾阴虚;D:肝阴虚;E:肝木乘土;F:脾肾两虚;G:肾亏阴虚;H:肝气犯胃;I:上热下寒;J:湿热中阻",
            "临证体会": ""
        },
        "task_1": "头昏;腹胀;双下肢浮肿;面部浮肿;尿少;大便稀;有粘液;急躁易怒;面色青;气短息微;腹满绷急;脐凸出;腹壁青筋暴露;两胁下深触有较硬包块;脉弦数;苔白;舌质微红",
        "task_2": "水邪泛滥;肝气郁结;横逆犯脾;恚怒伤肝\n\n解析：根据临床资料，患者有头昏、腹胀、双下肢浮肿、面部浮肿、尿少、大便稀等症状，且诊断为“肝硬化腹水”，这些症状和体征提示存在水邪泛滥的情况。同时，患者有急躁易怒的表现，这与恚怒伤肝的病机相关。腹满绷急、脐凸出、腹壁青筋暴露、两胁下深触有较硬包块等体征，提示肝气郁结和横逆犯脾的病机。因此，综合分析，病机答案为水邪泛滥、肝气郁结、横逆犯脾、恚怒伤肝。",
        "task_3": "肝肾阴虚;水邪泛滥\n\n解析：根据葛某的临床资料，他有头昏、腹胀、双下肢浮肿、面部浮肿、尿少、大便稀等症状，这些都是肝硬化腹水的典型表现。肝硬化腹水是由于肝功能减退，导致门脉高压，血浆蛋白降低，从而引起腹水和全身浮肿。从中医的角度看，这属于肝肾阴虚，肝失疏泄，肾失气化，水湿内停，泛滥于肌肤，形成浮肿。同时，腹满绷急，脐凸出，腹壁青筋暴露，两胁下深触有较硬包块，这些都是水邪泛滥的表现。因此，葛某的证候为肝肾阴虚和水邪泛滥。",
        "task_4": "临证体会：葛某所患之病属于中医“臌胀”范畴，主要病机为肝脾肾功能失调，气血水湿郁积于腹内，导致腹部胀大，面部及双下肢浮肿。肝硬化腹水在中医理论中，多由肝气郁结，脾虚湿盛，肾气不固，导致水液代谢失常，水湿内停，形成腹水。患者面色青，气短息微，腹满绷急，脐凸出，腹壁青筋暴露，两胁下深触有较硬包块，这些都是肝硬化腹水的典型表现。脉弦数，苔白，舌质微红，提示肝气郁结，湿热内蕴。治疗上，应以疏肝理气，健脾利湿，温肾利水为原则，同时根据患者的具体情况，调整方药，以达到标本兼治的目的。"
    },
    {
        "input": {
            "案例编号": "病例40",
            "临床资料": "曾某，女，15岁。初诊：1977年11月28日。主诉及病史：11月19日因患急性咽炎致高烧，体温40℃，右侧颈淋巴结肿大，有压痛。血常规检查：白细胞22600/mm3，中性89%，淋巴11%。用青霉素40万单位，肌内注射，每日2次；链霉素0.5g，肌内注射，每日2次，连用4天，高烧向退。但面目颈项出现浮肿。尿检：蛋白(+)，上皮细胞少数，脓细胞0～6，红细胞少数，颗粒管型0～2;血沉24mm/h，诊断为急性肾炎。诊查：诊时面目轻度浮肿，低烧绵绵(体温37.7℃)，胃纳减少，口生溃疡，头痛，胃脘疼痛，脉细，苔白厚腻。",
            "病机答案": "",
            "病机选项": "A:湿郁生痰;B:血海空虚;C:命门火衰;D:冲任受损;E:神明受扰,;F:神不守舍;G:外邪侵于肺卫;H:肾水不足;I:脾运失健;J:邪毒内陷脾肾",
            "证候答案": "",
            "证候选项": "A:风温时邪;B:脾虚湿滞;C:阳亢风动;D:肝肾亏虚;E:阳明热盛;F:脾失健运;G:暑温;H:热结下焦;I:积郁伤神;J:气血不足",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 面目轻度浮肿;低烧绵绵;胃纳减少;口生溃疡;头痛;胃脘疼痛;脉细;苔白厚腻。",
        "task_2": "病机答案: 湿郁生痰;脾运失健;邪毒内陷脾肾",
        "task_3": "脾失健运;湿浊凝聚\n\n解析：根据临床资料，患者曾某，15岁，因急性咽炎引发高烧，颈淋巴结肿大，使用抗生素后高烧退去，但出现面目颈项浮肿，尿检异常，诊断为急性肾炎。诊查时，患者有低烧、胃纳减少、口生溃疡、头痛、胃脘疼痛、脉细、苔白厚腻等症状。这些症状提示存在脾失健运和湿浊凝聚的情况。脾失健运表现为胃纳减少、脉细、苔白厚腻，湿浊凝聚表现为面目轻度浮肿、低烧绵绵、胃脘疼痛。因此，证候答案为脾失健运和湿浊凝聚。",
        "task_4": "临证体会：本案患者因急性咽炎引发高烧，继而出现面目颈项浮肿，尿检异常，诊断为急性肾炎。中医认为，急性咽炎多由外感风热或风寒之邪所致，若邪气未清，内传于肾，可致肾气不固，水液代谢失常，从而出现浮肿。患者面目浮肿，低烧绵绵，胃纳减少，口生溃疡，头痛，胃脘疼痛，脉细，苔白厚腻，此为湿热内蕴，脾肾功能受损之象。\n\n湿热之邪困脾，脾失健运，水湿不化，上泛则面目浮肿，湿热下注则尿检异常。胃纳减少，口生溃疡，胃脘疼痛，提示脾胃功能受损，湿热蕴结于中焦。脉细，苔白厚腻，为湿邪内阻，脾虚湿盛之征。治疗上应以清热利湿，健脾利水为主，佐以解毒消肿，调和脾胃。方药可选用五苓散合三仁汤加减，以清热利湿，健脾和胃，利水消肿。同时，注意饮食调理，避免辛辣刺激之品，以免加重湿热内蕴。"
    },
    {
        "input": {
            "案例编号": "病例242",
            "临床资料": "郭某，女，40岁。初诊：1978年12月30日。主诉及病史：满口糜烂，龈肿舌痛，唇烂咽痛，反复发作，饮食困难，心烦易怒已半年余。内服维生素等效果不显。曾在某医院就诊，诊断为复发性口腔炎，每遇消化不良、胃肠不适、睡眠不安则病情加重。诊查：来诊时患者苦楚难以名状。舌尖、舌边可见红色疮面，上下唇肉及双侧颊粘膜有散在小溃疡，咽红，舌质赤发裂，苔薄黄，脉细数。",
            "病机答案": "",
            "病机选项": "A:虚阳妄动之象;B:内有郁热;C:阴血亏;D:心肺胃之火上炎;E:毒热内迫营血;F:心营亏损;G:虚火上炎;H:水湿交阻;I:风痰交阻;J:血不养筋",
            "证候答案": "",
            "证候选项": "A:气血两亏;B:脑失其养;C:肝肾亏损;D:相火炽盛;E:气脱证;F:暑湿内伏;G:肝火亢盛;H:心肺脾(胃)积热;I:阴虚火旺;J:肾阴偏虚",
            "临证体会": ""
        },
        "task_1": "满口糜烂;龈肿舌痛;唇烂咽痛;心烦易怒;消化不良;胃肠不适;睡眠不安;舌尖红色疮面;上下唇肉溃疡;双侧颊粘膜溃疡;咽红;舌质赤发裂;苔薄黄;脉细数。",
        "task_2": "心肺胃之火上炎;阴血亏;虚火上炎\n\n解析：根据临床资料，患者有满口糜烂、龈肿舌痛、唇烂咽痛、反复发作、饮食困难、心烦易怒等症状，且伴有消化不良、胃肠不适、睡眠不安等表现。舌质赤发裂、苔薄黄、脉细数等舌脉象提示体内有热象。因此，病机分析应考虑心肺胃之火上炎，导致口腔黏膜受损；同时，长期的热象耗伤阴血，导致阴血亏虚，虚火上炎，进一步加重口腔症状。",
        "task_3": "心肺脾(胃)积热;阴虚火旺\n\n解析：根据临床资料，患者满口糜烂，龈肿舌痛，唇烂咽痛，反复发作，饮食困难，心烦易怒，舌尖、舌边可见红色疮面，上下唇肉及双侧颊粘膜有散在小溃疡，咽红，舌质赤发裂，苔薄黄，脉细数。这些症状表明患者体内有热毒，心肺脾(胃)积热，同时伴有阴虚火旺的证候。心肺脾(胃)积热导致口腔炎症反复发作，阴虚火旺则表现为舌质赤发裂，心烦易怒等症状。",
        "task_4": "临证体会：本例患者满口糜烂，龈肿舌痛，唇烂咽痛，反复发作，饮食困难，心烦易怒，这些症状表明病机复杂，涉及多个脏腑功能失调。从中医理论分析，心开窍于舌，脾开窍于口，肝主疏泄，胃主腐熟，肾藏精，肺主气。患者舌质赤发裂，苔薄黄，脉细数，提示心火上炎，胃热炽盛，肝火旺盛，肾阴不足，肺气不宣。心火上炎，胃热炽盛，导致口腔黏膜受损，形成溃疡；肝火旺盛，情绪易怒，加重病情；肾阴不足，不能上承心火，使心火更旺；肺气不宣，影响气机运行，使热毒不易排出。\n\n治疗上，应清心泻火，养阴生津，调和肝胃，宣肺解毒。方药可选用清心莲子饮加减，以清心火，养心阴；加用黄连、黄芩、黄柏清热解毒；麦冬、生地黄养阴生津；柴胡、白芍调和肝胃；桔梗、甘草宣肺解毒，利咽止痛。同时，注意饮食调理，避免辛辣刺激食物，多食清淡易消化之品，保持大便通畅，以助热毒排出。"
    },
    {
        "input": {
            "案例编号": "病例125",
            "临床资料": "王某，女，35岁。初诊：1975年8月1日。主诉及病史：素有慢性支气管炎，10年来时常咳血。昨起略有咳嗽，痰中带血甚多，胸闷痛，上身热，大便干燥。诊查：苔薄，脉细弦而数。",
            "病机答案": "",
            "病机选项": "A:神明受扰,;B:虚火在上;C:肾气不固;D:灼伤肺络;E:痰瘀为患;F:酒家湿蕴;G:气阴两亏;H:心失所养;I:肾气虚;J:肝火偏旺",
            "证候答案": "",
            "证候选项": "A:湿重于热;B:灼伤阳络;C:心肝阳亢;D:肝火犯肺;E:阳亢风动;F:卫阳不固;G:肝郁气滞;H:湿痰蕴络;I:肝失温养;J:痰湿阻滞经络",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 咳血;胸闷痛;大便干燥;脉细弦而数",
        "task_2": "病机答案: 灼伤肺络;虚火在上\n\n解析：根据临床资料，患者有慢性支气管炎病史，且出现痰中带血、胸闷痛、上身热、大便干燥等症状，结合脉细弦而数的脉象，可以判断病机为灼伤肺络和虚火在上。灼伤肺络表现为咳血、胸闷痛，虚火在上则表现为上身热、脉细弦而数，这些症状与选项D和B相符合。",
        "task_3": "D:肝火犯肺",
        "task_4": "临证体会：本例患者素有慢性支气管炎，加之10年来时常咳血，表明肺部久病，肺阴受损，肺络易损。昨起咳嗽加重，痰中带血甚多，提示肺络受损，血溢脉外。胸闷痛，上身热，大便干燥，结合苔薄，脉细弦而数，反映肺热炽盛，热伤肺络，同时热邪下移大肠，导致大便干燥。整体辨证为肺热炽盛，肺络受损，兼有肠热腑实之象。治疗当以清肺热、止血、润肠通便为原则。"
    },
    {
        "input": {
            "案例编号": "病例303",
            "临床资料": "高某，女，27岁。主诉及病史：月前分娩，娩后2周突觉两下肢痿软无力，不能任地，无法站立及行走。头昏背凉，溺清便溏。近日来病情增剧，双上肢亦感无力，起坐均赖人扶持，生活完全不能自理。诊查：面色跳白，爪甲色淡，舌淡润而色暗，苔薄白，六脉濡细，两尺微涩。",
            "病机答案": "",
            "病机选项": "A:肾病及脾;B:卫阳;C:胃气不降;D:督脉瘀阻;E:气血失调;F:气壅上逆;G:血虚;H:累及中、下二焦;I:脾气不升;J:肾气虚",
            "证候答案": "",
            "证候选项": "A:移热于小肠;B:督脉瘀阻;C:气血失和;D:血虚阳弱;E:肝火犯肺;F:证属肺气肺阴不足;G:痰热上扰;H:寒湿阻滞经脉;I:肝肾两损;J:津气欲脱",
            "临证体会": ""
        },
        "task_1": "面色跳白，爪甲色淡，舌淡润而色暗，苔薄白，六脉濡细，两尺微涩。",
        "task_2": "血虚;累及中、下二焦;脾气不升;肾气虚\n\n解析：根据临床资料，患者分娩后出现下肢痿软无力，逐渐影响到上肢，伴有头昏、背凉、溺清、便溏等症状，这些都是气血不足的表现。面色苍白、爪甲色淡、舌淡润而色暗、苔薄白、脉濡细、两尺微涩等，进一步支持了气血两虚的诊断。分娩后，气血大量消耗，若调养不当，易致血虚，血虚则不能滋养筋骨，导致肢体无力。同时，血虚影响中下二焦的气血运行，导致脾气不升，肾气虚，进一步加重了病情。",
        "task_3": "D:血虚阳弱",
        "task_4": "### 临证体会\n本例患者为产后突发下肢痿软无力，逐渐累及上肢，生活不能自理，伴有头昏、背凉、溺清、便溏等症状。面色眺白、爪甲色淡、舌淡润而色暗、苔薄白、脉濡细、两尺微涩，这些症状和体征提示患者存在气血两虚，尤其是肾精亏损和脾肾阳虚的病理状态。\n\n产后是女性生理上的一个重要转折点，此时气血大量消耗，加之分娩过程中的体力和精神压力，容易导致肾精亏损。肾主骨，生髓，肾精不足则骨髓不充，髓海空虚，故出现下肢痿软无力。同时，脾为后天之本，脾虚则运化失常，气血生化乏源，加之肾阳不足，温煦功能减退，故见溺清、便溏、背凉等症状。\n\n治疗上应以补益气血、温肾健脾为主，可选用补中益气汤合四物汤加减，以补气养血，温肾健脾，同时根据患者的具体情况，适当加入温阳补肾的药物，如肉桂、附子等，以增强温补肾阳的作用。同时，注意调养，避免劳累，保证充足的休息和营养，以促进身体的恢复。"
    },
    {
        "input": {
            "案例编号": "病例344",
            "临床资料": "王某，男，3岁。初诊:1960年3月3日。主诉及病史:患儿昨晚起发热，体温38.6℃，伴咳嗽、喷嚏、流涕，大便干，小便黄。诊查:全身皮肤遍起红疹，舌边尖红、苔薄白而干，脉象浮数。",
            "病机答案": "",
            "病机选项": "A:精血不能濡养筋膜;B:津液耗损;C:风温之邪侵袭肺卫;D:营卫不利;E:肾气虚弱;F:热入血络;G:血热不固;H:脾胃受伤;I:脾肾虚寒;J:肝郁",
            "证候答案": "",
            "证候选项": "A:心肾不交;B:肝气犯胃;C:伤肠胃之液;D:气阴两虚;E:热入营血;F:君相火旺;G:肝肾亏虚;H:乳络不通;I:温邪犯肺;J:气滞血瘀",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 发热;体温38.6℃;咳嗽;喷嚏;流涕;大便干;小便黄;全身皮肤遍起红疹;舌边尖红;苔薄白而干;脉象浮数。",
        "task_2": "C:风温之邪侵袭肺卫;D:营卫不利;B:津液耗损\n\n解析:根据临床资料，患儿发热、咳嗽、喷嚏、流涕、大便干、小便黄、全身皮肤遍起红疹、舌边尖红、苔薄白而干、脉象浮数，这些症状提示存在风温之邪侵袭肺卫，导致营卫不利，同时伴有津液耗损。风温之邪侵袭肺卫表现为发热、咳嗽、喷嚏、流涕等症状，营卫不利表现为大便干、小便黄，津液耗损表现为舌边尖红、苔薄白而干。因此，病机答案为C:风温之邪侵袭肺卫;D:营卫不利;B:津液耗损。",
        "task_3": "I:温邪犯肺",
        "task_4": "临证体会：本例患儿发热、咳嗽、喷嚏、流涕，伴有大便干、小便黄，全身皮肤遍起红疹，舌边尖红、苔薄白而干，脉象浮数，这些症状提示外感风热之邪，邪热内郁，上攻于肺，下迫于肠，热毒炽盛，故见发热、咳嗽、喷嚏、流涕等上呼吸道感染症状，以及大便干、小便黄等热象。皮肤遍起红疹，舌边尖红、苔薄白而干，脉象浮数，均为热毒内盛，外发于肌肤的表现。治疗当以清热解毒、宣肺止咳、通腑泄热为原则。"
    },
    {
        "input": {
            "案例编号": "病例265",
            "临床资料": "刘某，女，26岁。初诊：1974年3月8日。主诉及病史：患者于1978年春节饮酒时，误将一杯25%烧碱溶液当酒喝下，遂引起食管溃破，口吐鲜血约150ml，呕吐，不能咽水，壮热烦渴，体温39.5℃。经输液加消炎药治疗，病情得到控制，但遗留吞咽困难，不能吃硬食。胃镜检查提示：食管中段有2.5cm粘膜消失，收缩功能极差，建议赴上级医院治疗。后到河南医学院检查，拍片提示：食管狭窄。须手术治疗，患者深感畏惧，邀余施治。诊查：症见吞咽困难，汤水可下，口干欲饮，大便干结。舌质红，苔薄少津，脉弦细。",
            "病机答案": "",
            "病机选项": "A:气血不能上承于脑;B:风湿痹证迁延不愈;C:肾水不足;D:热盛津伤;E:复感寒邪;F:热入血络;G:气血凝瘀而化热;H:胃失降和;I:清窍受蒙;J:肝郁",
            "证候答案": "",
            "证候选项": "A:脾胃受制;B:阴虚生热夹痰;C:痰热互结;D:心肝阳亢;E:灼伤脉络;F:肝阳上亢;G:气血失和;H:气阴两竭;I:心肾两亏;J:痰浊壅遏",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 吞咽困难;口干欲饮;大便干结;舌质红;苔薄少津;脉弦细。",
        "task_2": "D:热盛津伤;H:胃失降和;G:气血凝瘀而化热\n\n解析：根据刘某的临床资料，她有明显的热象，如壮热烦渴、体温高，这些都是热盛津伤的表现。同时，她有吞咽困难，不能吃硬食，这与胃失降和有关，胃的降和功能失常会导致食物下行困难。另外，食管粘膜消失，收缩功能极差，提示有气血凝瘀而化热，导致局部组织损伤和功能障碍。",
        "task_3": "E:灼伤脉络;H:气阴两竭\n\n解析：患者因误饮烧碱溶液导致食管严重损伤，出现食管溃破、出血、吞咽困难等症状，胃镜检查提示食管中段粘膜消失，收缩功能极差，这些都是明显的灼伤脉络的表现。同时，患者有壮热烦渴、口干欲饮、舌质红、苔薄少津、脉弦细等阴虚生热的症状，提示气阴两竭。因此，结合临床表现和病史，证候答案为E:灼伤脉络;H:气阴两竭。",
        "task_4": "临证体会：患者因误服强碱性物质（烧碱溶液）导致食管严重化学性损伤，初期表现为食管溃破、出血、呕吐及高热，经西医治疗后虽控制了急性症状，但遗留了食管狭窄，影响吞咽功能，且不能耐受固体食物。此为食管粘膜受损后修复不良，形成瘢痕组织，导致管腔狭窄的典型表现。患者口干欲饮，大便干结，舌质红、苔薄少津，脉弦细，均为津液损伤、阴虚内热之象。烧碱损伤食管，耗伤津液，加之长期吞咽困难，饮食摄入不足，进一步加重了阴液的亏损。治疗上需着重于滋养阴液，生津润燥，同时促进食管粘膜的修复，改善吞咽功能。在中医辨证施治中，可选用具有滋阴润燥、生津止渴、促进组织修复的中药，如麦冬、玉竹、石斛等，同时配合软坚散结、活血化瘀的药物，以期改善食管狭窄状况，恢复吞咽功能。"
    },
    {
        "input": {
            "案例编号": "病例190",
            "临床资料": "杨某，女，32岁。初诊：1962年3月14日。主诉及病史：遇气候变迁，则周身起红斑发痒，甚至昏厥，头晕欲呕、冷汗出，迁延两载。诊查：脉缓小数，舌本红少苔。",
            "病机答案": "",
            "病机选项": "A:脾胃亏损;B:血热不固;C:湿热郁而生毒;D:肾水不足;E:热病伤阴;F:少阳证;G:精血亏损;H:湿热蕴积;I:温病热灼营阴;J:冲任虚衰",
            "证候答案": "",
            "证候选项": "A:肝阴不足;B:湿热郁结;C:气滞血瘀;D:脾阳虚;E:灼伤脉络;F:脾虚生湿;G:肾阴不足;H:肝脾不和;I:肝阳上亢;J:脾胃气虚",
            "临证体会": ""
        },
        "task_1": "周身起红斑发痒;昏厥;头晕欲呕;冷汗出;脉缓小数;舌本红少苔",
        "task_2": "血热不固;湿热郁而生毒\n\n解析：根据临床资料，患者遇气候变迁则出现周身起红斑发痒，甚至昏厥，头晕欲呕、冷汗出等症状，结合脉缓小数，舌本红少苔的诊查结果，可以判断病机为血热不固和湿热郁而生毒。血热不固导致皮肤出现红斑发痒，湿热郁而生毒则可能引起昏厥、头晕欲呕、冷汗出等症状。",
        "task_3": "肝阴不足;灼伤脉络\n\n解析：根据临床资料，患者遇气候变迁则出现周身起红斑发痒，甚至昏厥，头晕欲呕、冷汗出，脉缓小数，舌本红少苔。这些症状提示存在肝阴不足，肝阴不足不能滋养脉络，导致灼伤脉络，从而出现上述症状。因此，证候答案为肝阴不足和灼伤脉络。",
        "task_4": "临证体会：本例患者因体质偏弱，加之感受外邪，导致气血运行不畅，卫气不固，易受气候变化影响。遇气候变迁，风邪乘虚而入，侵袭肌表，引发周身红斑发痒。红斑发痒乃风邪与体内湿热相搏，郁于肌肤所致。昏厥、头晕欲呕、冷汗出，是因风邪侵袭，气血运行受阻，清阳不升，浊阴不降，导致清窍失养，故出现上述症状。脉缓小数，舌本红少苔，提示体内有热，但津液已伤，气血两虚。治疗当以疏风清热，调和营卫，固表止汗，养血安神为原则。"
    },
    {
        "input": {
            "案例编号": "病例252",
            "临床资料": "马某，25岁。主诉及病史：体质素弱，骤然血崩不止，唇甲俱白，目合神昏，额汗如珠，手足逆冷。诊查：脉濡舌淡。",
            "病机答案": "",
            "病机选项": "A:血海失营;B:肝肾之阴不足;C:冲任受损;D:血不归经;E:脾不统血;F:痰火互结;G:热病伤阴;H:痰浊阻膈;I:气滞血瘀;J:血虚",
            "证候答案": "",
            "证候选项": "A:血不归经;B:肝肾同病;C:肝气上逆;D:真寒假热;E:湿阻血瘀;F:膀胱失约;G:湿滞停留肠胃;H:清窍失灵;I:肝脾两虚;J:肝气横逆",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 体质素弱;骤然血崩不止;唇甲俱白;目合神昏;额汗如珠;手足逆冷;脉濡舌淡。",
        "task_2": "血海失营;脾不统血;血虚\n\n马某的临床表现符合中医理论中血虚、脾不统血和血海失营的病机。血虚表现为唇甲俱白，目合神昏，手足逆冷，脉濡舌淡。脾不统血则表现为血崩不止，脾为后天之本，主统血，脾虚则不能固摄血液，导致血崩。血海失营则是指冲任二脉受损，冲任为血海，主月经，冲任受损则月经失常，出现血崩。",
        "task_3": "血不归经\n\n### 解析\n根据马某的临床资料，其主诉为血崩不止，伴有唇甲俱白、目合神昏、额汗如珠、手足逆冷等症状，脉濡舌淡。这些症状提示患者存在严重的血虚和血不归经的情况，血崩不止是血不归经的典型表现，而唇甲俱白、目合神昏、额汗如珠、手足逆冷等则是血虚导致的全身性症状。因此，根据中医辨证论治的原则，马某的证候应为血不归经。",
        "task_4": "临证体会：本例血崩不止，乃因体质素弱，气血两虚，不能固摄，导致冲任不固，血失统摄而致血崩。唇甲俱白，目合神昏，额汗如珠，手足逆冷，皆为气血大亏，阳气欲脱之象。脉濡舌淡，亦为气血两虚之征。此乃气血虚极，阳气欲脱之危象，需急予大补气血，固脱救逆之法。"
    },
    {
        "input": {
            "案例编号": "病例261",
            "临床资料": "范某，女，25岁。初诊：1977年5月13日。主诉及病史：双眼视力下降伴眼前红绿黑花飞舞3个月余。诊查：视力：右眼远0.5，近0.6;左眼远0.3，近0.3。加镜无助。双眼视神经乳头颜色苍白，鼻侧边界欠清，视网膜血管大小比例正常，网膜未见出血及渗出，黄斑部中心凹光反射清晰。患者情志不舒，神疲纳差，胁痛胸闷，口苦咽干，月经不调；舌质淡红苔薄白，脉弦。西医诊断为视神经萎缩(双眼)。",
            "病机答案": "",
            "病机选项": "A:相火不藏;B:湿热内蕴;C:胆汁外溢;D:痰阻经络;E:卫气虚弱;F:湿浊内盛;G:肝气不舒;H:正气已衰;I:阳气外泄;J:命火衰微",
            "证候答案": "",
            "证候选项": "A:肾元不固;B:心肝阳亢;C:心脾两虚;D:肝旺湿热;E:脾胃不和;F:血不濡筋;G:厥阳升扰;H:热盛动风;I:肝气郁结;J:饮热蕴结",
            "临证体会": ""
        },
        "task_1": "双眼视力下降;眼前红绿黑花飞舞;情志不舒;神疲纳差;胁痛胸闷;口苦咽干;月经不调;舌质淡红苔薄白;脉弦",
        "task_2": "病机答案: 肝气不舒;湿热内蕴\n\n解析：根据临床资料，患者有情志不舒、胁痛胸闷、口苦咽干、月经不调等症状，这些症状与中医理论中的肝气不舒相符合。肝主疏泄，情志不舒、胁痛胸闷、月经不调等都是肝气郁结的表现。同时，患者有口苦咽干，这与湿热内蕴有关，湿热可以影响脾胃的运化功能，导致口苦咽干等症状。因此，结合患者的症状和体征，病机应为肝气不舒和湿热内蕴。",
        "task_3": "肝气郁结\n\n解析：根据患者的情志不舒，神疲纳差，胁痛胸闷，口苦咽干，月经不调等症状，结合舌质淡红苔薄白，脉弦的脉象，可以判断患者属于肝气郁结的证候。肝气郁结常见于情绪抑郁，肝气不舒，导致气血运行不畅，影响视力和全身症状。",
        "task_4": "临证体会：范某，为肝气郁结，肝血不足，目窍失养，神光衰竭。肝主目，肝气郁结导致气血运行不畅，影响肝血的滋养功能，进而影响到目窍的营养供应，导致视神经萎缩。患者情志不舒，神疲纳差，胁痛胸闷，口苦咽干，月经不调等症状，均与肝气郁结，肝血不足有关。舌质淡红苔薄白，脉弦，亦为肝气郁结，肝血不足的典型表现。治疗上应以疏肝解郁，养血明目为主，辅以调和脾胃，以助气血生化之源。"
    },
    {
        "input": {
            "案例编号": "病例215",
            "临床资料": "陈某，女，3岁。初诊：1967年8月，主诉及病史：患儿3天前起病，发热，头剧痛，呕吐，病情逐渐加重。登门求治于余。诊查：正值8月，气候炎热，患儿高烧40.5℃，无汗，抽风，烦躁，神志不清，目赤直视。舌质红，苔黄腻。腹胀3日未大便，溺赤，纹紫，脉滑数。",
            "病机答案": "",
            "病机选项": "A:内蕴痰湿;B:脾肾两虚;C:腑气不通;D:肾阳不足;E:肝胆气郁化热;F:热毒内燔;G:暑温邪气;H:吐泻复损津液;I:郁火伤津之象;J:风热之邪外袭",
            "证候答案": "",
            "证候选项": "A:肝气郁结;B:暑温动风;C:肝阳上亢;D:脾胃气虚;E:风痰窜络;F:少阳经腑同病;G:水气凌心;H:肝气犯胃;I:气血两亏;J:肝风内动",
            "临证体会": ""
        },
        "task_1": "舌质红，苔黄腻，腹胀，3日未大便，溺赤，纹紫，脉滑数。",
        "task_2": "暑温邪气;热毒内燔;腑气不通\n\n解析：根据临床资料，患儿高烧、无汗、抽风、烦躁、神志不清、目赤直视、舌质红、苔黄腻、腹胀3日未大便、溺赤、纹紫、脉滑数，这些症状表明存在暑温邪气侵袭，热毒内燔导致的高热、神志异常，以及腑气不通引起的腹胀和便秘。",
        "task_3": "暑温动风;肝风内动",
        "task_4": "临证体会：此例属于暑温病，病属暑热内闭，热极生风。暑为阳邪，其性炎热，易伤津耗气，且暑多挟湿，但此患儿以暑热为主，热邪炽盛，内扰心神，故见高烧、烦躁、神志不清；热极则生风，故见抽风；目赤直视为热邪上扰清窍之象。舌质红、苔黄腻、脉滑数均为热盛之象。腹胀、3日未大便、溺赤为热结肠腑，腑气不通之征。治疗当以清热解毒，凉血熄风，通腑泄热为法。"
    },
    {
        "input": {
            "案例编号": "病例179",
            "临床资料": "李某，男，52岁，主诉及病史：患者体丰腴，嗜茶成癖，每晨起必喝浓茶一大杯，数十年如一日，尝有咳嗽，自恃体健，不以为意。诊查：诉1周来精神困乏，不思饮食，但既未伤食，亦未受凉，不知何以致此。近3日来，更加胸膈闷满，倦怠嗜卧，委靡不振，四肢软弱无力。阵阵咳嗽，痰涎多，滑而易出。切其脉沉濡。视其舌，苔白而腻。",
            "病机答案": "",
            "病机选项": "A:脾胃健运力差;B:痰浊上逆;C:恐伤肾气;D:寒热结滞肠间;E:脾胃阳虚;F:热灼胃中;G:痰湿未化;H:血热不固;I:脾失健运;J:湿郁生痰",
            "证候答案": "",
            "证候选项": "A:三阳合病;B:湿热郁阻三焦;C:湿痰;D:阳虚;E:肝胆湿热;F:血分蕴热;G:肝脾两虚;H:湿热毒邪侵扰心包;I:脾失健运;J:阴耗火动",
            "临证体会": ""
        },
        "task_1": "精神困乏;不思饮食;胸膈闷满;倦怠嗜卧;四肢软弱无力;阵阵咳嗽;痰涎多;脉沉濡;苔白而腻",
        "task_2": "痰湿未化;湿郁生痰",
        "task_3": "C:湿痰;I:脾失健运\n\n解析：根据临床资料，患者体丰腴，嗜茶成癖，有长期的咳嗽史，近一周出现精神困乏，不思饮食，胸膈闷满，倦怠嗜卧，四肢软弱无力，咳嗽痰多且滑而易出，脉沉濡，舌苔白腻。这些症状提示患者体内有湿痰，同时脾失健运，不能正常运化水湿，导致湿痰内生，故选C和I。",
        "task_4": "临证体会：患者体丰腴，嗜茶成癖，长期过饮浓茶，损伤脾胃，脾胃为后天之本，主运化水湿，长期过饮浓茶导致脾胃功能受损，运化失常，湿浊内生，聚湿生痰。痰湿阻滞中焦，影响脾胃的升清降浊功能，故出现精神困乏，不思饮食，胸膈闷满，倦怠嗜卧，四肢软弱无力等症状。痰湿上泛，阻滞肺窍，故见阵阵咳嗽，痰涎多，滑而易出。脉沉濡，舌苔白腻，均为痰湿内盛之象。此为痰湿阻滞，脾胃虚弱之证。治疗当以健脾化湿，理气化痰为主。"
    },
    {
        "input": {
            "案例编号": "病例122",
            "临床资料": "朱某，男，53岁。初诊：1983年6月2日。主诉及病史：患者于2个月前，因洗澡受凉而发热，迄今未得控制，体温为38～39℃。初起热无定时，不恶寒，近1个月来，发热有定时，中午起，入暮退，伴有耳聋、目眩、口苦、咽中干热，脘腹及左下腹作胀，胃纳欠馨，无恶心呕吐，二便正常。曾有肝硬化、脾切除史。诊查：舌红苔薄黄，脉弦数。",
            "病机答案": "",
            "病机选项": "A:肝木上亢;B:痰湿内阻;C:脾胃阳虚;D:阳明承气证;E:肺失肃降;F:久咳肺气先虚;G:湿热留恋气分;H:少阳证;I:胃火实;J:脾脏阳气亏虚",
            "证候答案": "",
            "证候选项": "A:暑温;B:冲任受损;C:气血两亏;D:少阳阳明合病;E:风邪外束;F:脾胃受制;G:阴虚内热;H:虚风内动;I:气虚血弱;J:肝脾不调",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 发热（午后发热，入暮退热）;耳聋;目眩;口苦;咽中干热;脘腹及左下腹作胀;胃纳欠馨;舌红苔薄黄;脉弦数;肝硬化史;脾切除史。",
        "task_2": "H:少阳证\n\n解析：根据临床资料，患者有发热、耳聋、目眩、口苦、咽中干热等症状，且发热有定时，中午起，入暮退，这些症状符合中医少阳证的表现。少阳证是中医六经辨证中的一种，常表现为寒热往来、口苦咽干、目眩等症状，与胆经和肝经的功能失调有关。因此，根据患者症状，病机答案为H:少阳证。",
        "task_3": "D:少阳阳明合病",
        "task_4": "临证体会：患者有肝硬化病史，且已行脾切除术，说明肝脾功能已受损。此次发热，起于洗澡受凉，但持续不退，且有定时，午后热甚，入暮则退，此乃阴虚内热之象，属肝胆湿热，郁而化火。肝胆湿热上扰，故见耳聋、目眩、口苦、咽中干热；湿热下注，故见脘腹及左下腹作胀。舌红苔薄黄，脉弦数，均为肝胆湿热之征。肝硬化后，肝功能减退，加之脾切除，影响气血生化之源，故胃纳欠馨。整体而言，此乃肝胆湿热，兼有阴虚之象，治疗当以清肝胆湿热，养阴生津为法。"
    },
    {
        "input": {
            "案例编号": "病例351",
            "临床资料": "刘某，女，52岁。初诊:1977年4月9日。主诉及病史:1976年12月开始阴道出现不规则出血，1977年3月7日经某医院诊断为子宫体腺瘤，于4月8日手术。手术中出血甚多，曾输血3000ml。手术后小便点滴俱无，出现恶心呕吐，曾用西药利尿脱水剂速尿及甘露醇等，28小时后小便仍点滴俱无。检查血二氧化碳结合力为33~36容积%，非蛋白氮102mg%，诊断为急性肾功能衰竭、酸中毒，于4月9日下午请急会诊。诊查:患者呈急性病容，恶心呕吐，小便点滴俱无。脉沉细无力而数，舌胖嫩，色稍青紫，苔薄白而润稍粘，汗多。",
            "病机答案": "",
            "病机选项": "A:气血两虚;B:血瘀;C:肺气闭塞不能通调水道;D:阳明脉虚;E:瘀血阻滞胞脉;F:肾水不足;G:肝气不疏;H:失于治节;I:肾病及脾;J:湿热内郁",
            "证候答案": "",
            "证候选项": "A:肝肾阴虚;B:暑湿郁于阳明之腑;C:木火刑金;D:气阴两虚兼血瘀;E:肝风上扰;F:湿浊凝聚;G:瘀血阻塞清窍;H:脾肾虚衰;I:肾阴不充;J:气血失和",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 阴道不规则出血;急性肾功能衰竭;酸中毒;恶心呕吐;小便点滴俱无;脉沉细无力而数;舌胖嫩色稍青紫;苔薄白而润稍粘;汗多。",
        "task_2": "气血两虚;肾水不足;瘀血阻滞胞脉\n\n解析: 根据刘某的临床资料，她经历了大量出血和手术，导致气血两虚。手术后出现急性肾功能衰竭，小便点滴俱无，这表明肾水不足。同时，由于手术和出血，可能存在瘀血阻滞胞脉的情况，影响了肾脏的正常功能。因此，病机答案为气血两虚、肾水不足和瘀血阻滞胞脉。",
        "task_3": "D:气阴两虚兼血瘀\n\n解析:根据临床资料，患者手术后出现急性肾功能衰竭、酸中毒，小便点滴俱无，恶心呕吐，脉沉细无力而数，舌胖嫩，色稍青紫，苔薄白而润稍粘，汗多。这些症状表明患者存在气阴两虚的情况，同时由于手术出血甚多，可能存在血瘀的情况。因此，综合判断，证候为气阴两虚兼血瘀。",
        "task_4": "临证体会：本例患者因子宫体腺瘤手术后出现急性肾功能衰竭、酸中毒，其病机主要为大出血后气血两虚，加之手术创伤，正气大伤，导致气不化水，水液代谢失常，肾气不固，故见小便点滴俱无。血虚则舌色稍青紫，气虚则脉沉细无力而数，汗多为气虚不固之象。舌胖嫩、苔薄白而润稍粘，提示体内水湿内停，与肾功能衰竭导致的水液代谢障碍相吻合。综合分析，本病为气血两虚、肾气不固、水湿内停之证。治疗当以益气养血、固肾利水为原则。"
    },
    {
        "input": {
            "案例编号": "病例266",
            "临床资料": "孙某，女，38岁。初诊：1978年11月3日。主诉及病史：乙型脑炎后遗症已3个多月。1978年8月21日，突然出现发热头痛，继而高烧昏迷、抽搐，经县某医院诊断为乙型脑炎。经中西药治疗20余日，神志清醒，抽搐停止，仍有低烧；又治疗一个半月，体温正常，逐渐可以站立和行走，但出现心急烦躁，坐立不宁，通宵不眠，说话不清，语无伦次，记忆力丧失，一般文字和熟人均不认识。经洛阳地区精神病院检查诊断为乙型脑炎后遗症。曾服氯丙嗪等无效而来求诊。诊查：症见心急烦躁，坐立不宁，乱走不停，说话不清，问答语无伦次，好哭泣，记忆力丧失，一般文字和熟人均不识，失眠，恐惧，无意识动作不休，如手摸头发，捂眼等。无食欲，需强制饮食，1日3～4两，口干不欲饮水，四肢有时轻度抽搐。面色眺白，身体消瘦，神志呆痴，表情急躁不安，舌苔薄黄少津，舌质淡暗，舌体胖大，脉象细滑而数。",
            "病机答案": "",
            "病机选项": "A:肾阳虚;B:余热未清;C:气壅上逆;D:湿与热结;E:湿热郁阻中焦;F:血海空虚;G:痰湿未化;H:脾胃虚弱;I:心脾受伤;J:耗损肺肾之气阴",
            "证候答案": "",
            "证候选项": "A:肝血瘀阻;B:风湿流窜经络;C:痰蒙清窍;D:搏于血脉;E:高热伤津;F:湿痰阻滞经络;G:风痰阻络;H:热深厥深;I:痰饮化热;J:肝失温养",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 心急烦躁;坐立不宁;乱走不停;说话不清;语无伦次;好哭泣;记忆力丧失;不识文字和熟人;失眠;恐惧;无意识动作;手摸头发;捂眼;无食欲;口干不欲饮水;四肢轻度抽搐;面色眺白;身体消瘦;神志呆痴;表情急躁不安;舌苔薄黄少津;舌质淡暗;舌体胖大;脉象细滑而数。",
        "task_2": "余热未清;心脾受伤;痰湿未化\n\n解析：根据孙某的临床资料，她患有乙型脑炎后遗症，表现为心急烦躁，坐立不宁，通宵不眠，说话不清，语无伦次，记忆力丧失，不认识文字和熟人，无食欲，四肢有时轻度抽搐，面色眺白，身体消瘦，神志呆痴，表情急躁不安，舌苔薄黄少津，舌质淡暗，舌体胖大，脉象细滑而数。这些症状提示存在余热未清，心脾受伤，以及痰湿未化的情况。余热未清表现为持续的低烧和烦躁不安，心脾受伤表现为记忆力丧失、不认识人和文字，以及食欲不振，而痰湿未化则表现为舌苔薄黄少津、舌质淡暗和脉象细滑而数，这些都是中医辨证中与心脾功能受损和痰湿内阻相关的病机表现。",
        "task_3": "痰蒙清窍;热深厥深;肝失温养\n\n解析：根据临床资料，患者有心急烦躁，坐立不宁，乱走不停，说话不清，问答语无伦次，好哭泣，记忆力丧失，一般文字和熟人均不识，失眠，恐惧，无意识动作不休等症状，这些症状与痰蒙清窍（C）的证候特征相符，表现为神志不清，语言错乱，情绪异常等症状。同时，患者有乙型脑炎后遗症，且有高烧昏迷、抽搐的病史，提示有热深厥深（H）的可能，热邪深入，损伤心神，导致神志异常。此外，患者面色眺白，身体消瘦，神志呆痴，表情急躁不安，舌苔薄黄少津，舌质淡暗，舌体胖大，脉象细滑而数，这些症状提示肝失温养（J），肝血不足，不能滋养心神，导致神志异常。因此，综合分析，本例的证候为痰蒙清窍，热深厥深，肝失温养。",
        "task_4": "临证体会：患者孙某，因患乙型脑炎后遗症，出现了一系列复杂的症状，包括心急烦躁、坐立不宁、通宵不眠、言语不清、记忆力丧失、不认识文字和熟人、失眠、恐惧、无意识动作、手摸头发、捂眼、食欲不振、口干不欲饮水、四肢轻度抽搐、面色眺白、身体消瘦、神志呆痴、表情急躁不安、舌苔薄黄少津、舌质淡暗、舌体胖大、脉象细滑而数。\n\n从中医角度分析，乙型脑炎后遗症导致的这些症状，多与心、肝、脾、肾功能失调有关。心急烦躁、坐立不宁、通宵不眠、恐惧、无意识动作等，反映心神不宁，心火上炎，心神失养。言语不清、记忆力丧失、不认识文字和熟人，提示心脾两虚，心神失养，脾失健运，气血生化乏源。四肢轻度抽搐、面色眺白、身体消瘦，反映肝肾阴虚，筋脉失养，肾精不足。口干不欲饮水、舌苔薄黄少津、舌质淡暗、舌体胖大，提示脾虚湿困，津液不布。脉象细滑而数，反映气血两虚，心脾不足，兼有湿热内蕴。\n\n治疗上，应以调和心神、补益心脾、滋养肝肾、清热化湿为原则，采用中药方剂如归脾汤、天王补心丹、六味地黄丸等，结合针灸、推拿等中医特色疗法，以期恢复患者的心神安定、改善记忆力、增强体质、促进康复。同时，注意饮食调理，避免辛辣刺激食物，多食清淡易消化之品，保持心情舒畅，避免过度劳累，以助于病情的恢复。"
    },
    {
        "input": {
            "案例编号": "病例34",
            "临床资料": "薛某，男，51岁。初诊:1985年2月4日。主诉及病史:平时血压低，白细胞减少，经服中药后，恙情已有好转。近因工作劳累，血压又见下降，且多在晚间或夜间发病，初感腰酸，继而少腹膜胀、气多，约半小时缓解。西医确诊为:腹型癫痫，但治疗效果不显。诊查:兹诊脉象缓弦无力，舌质淡白少苔。",
            "病机答案": "",
            "病机选项": "A:肝气横逆;B:脾阳司运化之职;C:血虚;D:肝气不疏;E:气化无力;F:风温之邪侵袭肺卫;G:气阴两虚;H:命火衰微;I:痰热结聚;J:外感疫毒入里",
            "证候答案": "",
            "证候选项": "A:肾水无制;B:心包肝胆热迫;C:肾气不足;D:气滞血瘀;E:脾阳虚;F:脾肾阳虚;G:脾失统摄;H:肝郁痰浊;I:阴虚肺燥;J:气化不利",
            "临证体会": ""
        },
        "task_1": "血压低;白细胞减少;腰酸;少腹膜胀;气多;脉象缓弦无力;舌质淡白少苔",
        "task_2": "E:气化无力;G:气阴两虚\n\n解析:根据临床资料，患者血压低，白细胞减少，且在劳累后症状加重，表现为腰酸、少腹胀、气多，脉象缓弦无力，舌质淡白少苔，这些症状和体征提示患者可能存在气化无力和气阴两虚的情况。气化无力指的是气的推动和转化功能减弱，导致气血运行不畅，气阴两虚则表示气和阴液的不足，常见于慢性疾病或过度劳累后。因此，E和G选项最符合患者的病机。",
        "task_3": "C:肾气不足",
        "task_4": "临证体会：本例患者以血压低、白细胞减少为背景，加之工作劳累后出现腰酸、少腹胀满、气多等症状，且症状多在晚间或夜间发作，西医诊断为腹型癫痫。从中医角度分析，患者脉象缓弦无力，舌质淡白少苔，提示气血两虚，肾气不足。肾为先天之本，主藏精，肾气虚损则腰酸乏力；气血不足则脉象无力，舌质淡白。夜间发病，多与肾阳虚衰，不能温煦脏腑，导致气机升降失常有关。少腹胀满、气多，可能与脾肾阳虚，运化失司，气机不畅有关。治疗上应以补肾益气、温阳健脾为主，调和气机，以期改善症状，提高患者生活质量。"
    },
    {
        "input": {
            "案例编号": "病例317",
            "临床资料": "周某，女，50岁。初诊：1978年10月9日。主诉及病史：干咳，入夜尤甚，咳时无痰，胸中闷胀。诊查：唇舌及咽喉灼干，声音略带嘶哑，心烦，食欲减退，无苔，脉数无力。",
            "病机答案": "",
            "病机选项": "A:气血两虚;B:肾亏;C:寒湿之邪乘虚侵袭;D:虚热内灼;E:心火又灼肺;F:湿聚痰生;G:气血两虚;H:气虚血衰;I:肺阴虚;J:脾失健运",
            "证候答案": "",
            "证候选项": "A:上热下寒;B:肝肾阴虚;C:肝肾亏虚;D:湿热内蕴;E:气郁血虚;F:命火虚衰;G:肝火犯肺;H:肝肾两损;I:燥热伤津;J:上焦肺失肃降",
            "临证体会": ""
        },
        "task_1": "干咳，入夜尤甚，咳时无痰，胸中闷胀，唇舌及咽喉灼干，声音略带嘶哑，心烦，食欲减退，无苔，脉数无力。",
        "task_2": "病机答案: 虚热内灼;肺阴虚",
        "task_3": "燥热伤津;上焦肺失肃降",
        "task_4": "临证体会：本例患者干咳无痰，入夜尤甚，胸中闷胀，唇舌及咽喉灼干，声音略带嘶哑，心烦，食欲减退，无苔，脉数无力，这些症状提示存在肺阴不足，燥热伤肺的情况。肺为娇脏，喜润恶燥，燥热之邪侵袭肺部，耗伤肺阴，导致肺失滋润，气道干燥，故出现干咳无痰，咽喉灼干，声音嘶哑。夜间为阴盛之时，燥热之邪在阴盛之时更易伤阴，故干咳入夜尤甚。心烦、食欲减退、无苔、脉数无力，均为阴虚内热的表现。治疗上应以滋阴润肺、清热止咳为主，可选用麦门冬汤、沙参麦冬汤等方剂加减，以达到滋阴润燥、清热止咳的目的。"
    },
    {
        "input": {
            "案例编号": "病例163",
            "临床资料": "卢某，女，65岁。初诊：1962年11月8日。主诉及病史：病员于1951年曾患肺结核吐血，经治疗后，吐血止而咳嗽频发。1959年喉头部位开始生一小包，辗转求医，未见效验。最近喉头包块已渐大如核桃，吞咽和发音困难，经西医诊断为喉结核。诊查：就诊时，病员项下生瘰，按之甚坚硬，右手小指亦有核肿现象，其胁下亦有肿块，但时聚时散。声音嘶哑，咳吐稠痰，脉象细数，舌苔白厚。",
            "病机答案": "",
            "病机选项": "A:湿浊凝滞;B:脾运失健;C:肝气不疏;D:表里不清;E:痰阻肺道;F:热结膀胱;G:气滞血瘀;H:阴虚生热;I:阴精消烁;J:浊阴不降",
            "证候答案": "",
            "证候选项": "A:少阳阳明合病;B:肝血瘀阻;C:阴虚生热夹痰;D:肝阳上亢;E:风寒湿痹;F:内夹积滞;G:肠胃湿热;H:阴亏之体;I:湿热中阻;J:内伤阳络",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 项下生瘰;喉头包块如核桃;右手小指核肿;胁下肿块时聚时散;声音嘶哑;咳吐稠痰;脉象细数;舌苔白厚。",
        "task_2": "痰阻肺道;气滞血瘀;阴虚生热\n\n解析：根据临床资料，患者有长期咳嗽和喉头包块的病史，近期喉头包块增大，吞咽和发音困难，诊断为喉结核。中医认为，喉结核属于阴虚生热的范畴，长期的咳嗽和吐血导致肺阴受损，阴虚则生内热。喉头包块和右手小指的核肿现象，以及胁下时聚时散的肿块，提示有痰阻肺道和气滞血瘀的情况。痰阻肺道导致声音嘶哑和咳吐稠痰，气滞血瘀则表现为包块的形成。因此，综合分析，病机为痰阻肺道、气滞血瘀和阴虚生热。",
        "task_3": "C:阴虚生热夹痰;H:阴亏之体\n\n解析：根据临床资料，患者有长期咳嗽、喉头包块、声音嘶哑、咳吐稠痰等症状，结合脉象细数、舌苔白厚的体征，可以判断患者属于阴虚生热夹痰的证候。同时，患者有长期的肺结核病史，说明其体质属于阴亏之体，这也是导致其出现上述症状的重要原因。因此，证候答案为C和H。",
        "task_4": "临证体会：本例患者长期患有肺结核病史，病程迁延，导致肺阴受损，加之痰瘀互结，上壅于喉，形成瘰疬。喉头部位包块渐大，影响吞咽和发音，右手小指亦出现核肿，提示痰瘀不仅局限于喉部，还可能波及其他部位。其胁下肿块时聚时散，可能与气滞血瘀有关。声音嘶哑，咳吐稠痰，脉象细数，舌苔白厚，均为痰湿内阻，肺气不利的表现。治疗上需兼顾清热化痰、软坚散结、养阴润肺，以期改善症状，控制病情发展。"
    },
    {
        "input": {
            "案例编号": "病例176",
            "临床资料": "张某，男，3岁。主诉及病史:患儿受凉伤食，发热汗出，气逆咳嗽，病已7日。曾服疏表宣肺之剂多付，病有增无减，每日午后壮热尤甚，彻夜咳嗽不休，不能合目。诊查:小便黄少，大便秘结3日。舌苔微黄而燥，指纹色紫，脉滑数。",
            "病机答案": "",
            "病机选项": "A:肝阳上扰清窍;B:外邪袭肺;C:入里化热;D:阳明热炽;E:湿热内蕴;F:热毒水湿上攻;G:胃中失和;H:神不守舍;I:炼液为痰;J:损伤中气",
            "证候答案": "",
            "证候选项": "A:热利伤津;B:气血两虚;C:阳明燥实;D:清窍失灵;E:湿热闭于气分;F:外感夹滞;G:胃热炽盛;H:移热于小肠;I:脾湿内盛;J:气滞血瘀",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 发热汗出;气逆咳嗽;午后壮热;彻夜咳嗽;小便黄少;大便秘结3日;舌苔微黄而燥;指纹色紫;脉滑数。",
        "task_2": "病机答案: 外邪袭肺;入里化热;阳明热炽\n\n解析: 根据临床资料，患儿受凉伤食后出现发热汗出、气逆咳嗽等症状，且服药后病情未见好转，反而加重，表现为午后壮热、彻夜咳嗽、小便黄少、大便秘结、舌苔微黄而燥、指纹色紫、脉滑数等。这些症状提示病机为外邪袭肺后入里化热，导致阳明热炽。外邪袭肺表现为气逆咳嗽，入里化热表现为午后壮热，阳明热炽表现为舌苔微黄而燥、指纹色紫、脉滑数，以及小便黄少、大便秘结等热盛症状。",
        "task_3": "C:阳明燥实;F:外感夹滞\n\n解析: 根据临床资料，患儿受凉伤食后出现发热汗出、气逆咳嗽等症状，且服药后病情未见好转，反而加重，表现为午后壮热、彻夜咳嗽、小便黄少、大便秘结、舌苔微黄而燥、指纹色紫、脉滑数等。这些症状提示存在阳明燥实和外感夹滞的证候。阳明燥实表现为大便秘结、小便黄少、舌苔黄燥、脉滑数等，是由于阳明经热盛，津液被耗，导致燥热内结。外感夹滞则表现为发热、咳嗽、舌苔微黄等，是由于外感邪气与体内滞留的食滞相夹，导致病情加重。因此，综合分析，本例患儿的证候为阳明燥实和外感夹滞。",
        "task_4": "临证体会：患儿因受凉伤食，导致外感风寒，内有食滞，表里同病。初起发热汗出，气逆咳嗽，是风寒外束，肺气不宣之象。然而，治疗过程中，虽用疏表宣肺之剂，但病势反而加重，午后壮热尤甚，彻夜咳嗽不休，提示病邪已入里化热，且有食滞内热之象。小便黄少，大便秘结3日，舌苔微黄而燥，指纹色紫，脉滑数，均为里热实证的表现，说明患儿体内有明显的热毒和食积。治疗上应清热解毒，消食导滞，同时兼顾解表，以达到表里同治的目的。"
    },
    {
        "input": {
            "案例编号": "病例207",
            "临床资料": "李某，女，4岁半。初诊：1984年2月27日。主诉及病史：患儿于1983年11月2日始发热，伴小便频数，短涩疼痛。某医院诊为急性肾炎、急性尿路感染，经中西药治疗，症状稍缓，但未痊愈。1984年2月23日夜间，突发神昏，失语，摇头等症状，经中西药治疗无效，于2月27日请张老会诊。诊查：身热不退，朝轻暮重，神识昏蒙，时清时昧，失语，摇头，呵欠频作，肢体萎软，呕恶厌食，二便失禁。舌淡红、苔白腻脉细弦。",
            "病机答案": "",
            "病机选项": "A:脾不健运;B:湿热蒙蔽心窍;C:湿热留恋气分;D:脾胃虚弱;E:营血不足;F:肝肾之阴不足;G:痰浊内蕴;H:瘀血阻于经隧脉络;I:气血虚损;J:冲气上逆",
            "证候答案": "",
            "证候选项": "A:痰郁化热;B:春温夹湿;C:热伤胃阴;D:脾阳虚;E:湿热内蕴;F:风痰窜络;G:酒湿阻络;H:疏泄失于条达;I:气滞血瘀;J:卫外不固",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 身热不退;神识昏蒙;失语;摇头;肢体萎软;呕恶厌食;二便失禁;脉细弦",
        "task_2": "湿热蒙蔽心窍;痰浊内蕴\n\n解析：根据临床资料，患儿有发热、小便频数、短涩疼痛等症状，提示存在湿热之邪。突发神昏、失语、摇头、肢体萎软、呕恶厌食、二便失禁等症状，提示湿热之邪上蒙心窍，影响心神，导致神志异常。舌淡红、苔白腻、脉细弦，提示湿邪内蕴，痰浊生成，故病机为湿热蒙蔽心窍和痰浊内蕴。",
        "task_3": "B:春温夹湿;E:湿热内蕴;F:风痰窜络\n\n解析：根据临床资料，患儿有发热、小便频数、短涩疼痛等症状，提示存在湿热内蕴的情况。同时，突发神昏、失语、摇头等症状，结合舌淡红、苔白腻、脉细弦的诊查结果，提示存在风痰窜络的情况。此外，发热朝轻暮重，提示春温夹湿的可能性。因此，综合分析，证候答案为B:春温夹湿;E:湿热内蕴;F:风痰窜络。",
        "task_4": "临证体会：本例患儿李某，4岁半，病程迁延，初起为急性肾炎、急性尿路感染，后出现神昏、失语、摇头等神经系统症状，表现为身热不退，朝轻暮重，神识昏蒙，时清时昧，肢体萎软，二便失禁等，此乃湿热内蕴，蒙蔽心包，热毒扰动肝风之象。湿热下注膀胱，导致小便频数，短涩疼痛，是为急性尿路感染之表现。热毒上扰心神，蒙蔽清窍，故见神昏、失语、摇头等症。肝风内动，加之湿热困脾，脾胃运化失常，故见肢体萎软、呕恶厌食。舌淡红、苔白腻、脉细弦，提示湿热蕴结，气机不畅，心神受扰。治疗当以清热利湿、解毒开窍、平肝熄风为法，方选清营汤合安宫牛黄丸，以清心开窍，解毒凉血，配合五苓散加减，以利湿热下行，调和脾胃。同时，注意观察患儿神志变化，及时调整治疗方案，以防病情进一步恶化。"
    },
    {
        "input": {
            "案例编号": "病例119",
            "临床资料": "张某，男，40岁。主诉及病史：患者平素嗜好烟酒，于5年前开始出现肛门周围皮肤阵发性发痒，每次发作约2～3分钟，未进行治疗。近1年来痒痛逐渐加剧，痒比痛重，常用手搔抓止痒，经西药外用无效。伴见胸闷不适，纳谷不香，坐卧不安。诊查：口苦，舌质淡，苔黄腻，脉弦数。肛门周围皮肤粗糙变厚，苔藓样变，有抓痕，皲裂，分泌物多色黄而腥臭。",
            "病机答案": "",
            "病机选项": "A:下元虚寒;B:心阴;C:虚热上蒸;D:心神亏虚;E:湿热内生;F:热邪伤阴;G:肝郁;H:湿郁生痰;I:脾胃虚弱;J:痰湿未化",
            "证候答案": "",
            "证候选项": "A:肾水不足;B:湿热郁结;C:上热下寒;D:心肺脾(胃)积热;E:浊湿阻滞中焦;F:虚风内动;G:湿痰化燥;H:湿热下注膀胱;I:脾虚湿热下注;J:脾胃虚弱",
            "临证体会": ""
        },
        "task_1": "肛门周围皮肤阵发性发痒;肛门周围皮肤粗糙变厚;苔藓样变;抓痕;皲裂;分泌物多色黄而腥臭;口苦;舌质淡;苔黄腻;脉弦数;胸闷不适;纳谷不香;坐卧不安。",
        "task_2": "湿热内生;湿郁生痰\n\n解析：根据临床资料，患者有长期烟酒嗜好，肛门周围皮肤瘙痒并逐渐加剧，伴有胸闷不适，纳谷不香，坐卧不安，口苦，舌质淡，苔黄腻，脉弦数。这些症状提示存在湿热内生和湿郁生痰的病机。湿热内生导致肛门周围皮肤病变，湿郁生痰则表现为胸闷不适，纳谷不香等症状。",
        "task_3": "湿热郁结\n\n### 解析\n根据患者临床表现，肛门周围皮肤阵发性发痒，痒痛逐渐加剧，痒比痛重，口苦，舌质淡，苔黄腻，脉弦数，肛门周围皮肤粗糙变厚，苔藓样变，有抓痕，皲裂，分泌物多色黄而腥臭，这些症状符合湿热郁结的证候特征。湿热下注，郁结于肛门周围，导致皮肤病变，痒痛不适，分泌物黄而腥臭，是湿热郁结的典型表现。",
        "task_4": "临证体会：本案患者症状表现为肛门周围皮肤瘙痒、苔藓样变、抓痕、皲裂及分泌物，伴有胸闷、纳差、口苦、舌质淡、苔黄腻、脉弦数等，中医辨证为湿热下注、肝胆湿热之证。患者长期嗜好烟酒，导致湿热内生，湿热下注于肛门周围，刺激皮肤，引起瘙痒、苔藓样变及分泌物增多。湿热久蕴，可致皮肤粗糙变厚，形成抓痕、皲裂，且分泌物色黄而腥臭，均为湿热蕴结之象。胸闷不适、纳谷不香，提示湿热影响脾胃运化功能，导致气机不畅。治疗上应以清热利湿、疏肝理气为主，可选用龙胆泻肝汤加减，以清利湿热，疏肝解郁，同时注意饮食调理，戒烟限酒，避免辛辣刺激食物，保持大便通畅，以助湿热之邪排出。"
    },
    {
        "input": {
            "案例编号": "病例256",
            "临床资料": "陈某，男，46岁。初诊：1976年11月25日。主诉及病史：1976年11月10日起畏寒发热，头痛身痛，咳嗽吐稀白痰。前医认为感冒而用发散药未效，仍然畏冷寒战，咳嗽咯痰增多。11月18日晨起咯吐咖啡色脓样痰约100ml，且右胸疼痛，食欲减退，全身乏力，口干尿黄，大便结。11月22日在某医院胸透发现右侧第1前肋间有较大的厚壁透光区。11月24日又拍胸片，证实为右上肺脓疡。于1976年11月25日急诊住入我院，邀余会诊。诊查：患者舌质红，苔白腻，脉弦数，体温38.6℃。",
            "病机答案": "",
            "病机选项": "A:脾胃不健;B:血虚生热;C:痰热壅肺;D:阴虚肺燥;E:肾病及脾;F:脾气虚;G:下元亏损;H:肝肺被伤;I:湿滞未净;J:痰瘀交阻",
            "证候答案": "",
            "证候选项": "A:血溢气虚;B:风痰阻络;C:肝郁气滞;D:痰热壅肺;E:痰热结聚;F:灼伤阳络;G:肾水无制;H:湿热结滞肠道;I:肺气郁闭;J:伤寒夹食之证",
            "临证体会": ""
        },
        "task_1": "畏寒发热;头痛身痛;咳嗽吐稀白痰;咯吐咖啡色脓样痰;右胸疼痛;食欲减退;全身乏力;口干尿黄;大便结;舌质红;苔白腻;脉弦数;体温38.6℃;右上肺脓疡",
        "task_2": "痰热壅肺",
        "task_3": "D:痰热壅肺;E:痰热结聚\n\n解析：根据陈某的临床资料，他有畏寒发热、头痛身痛、咳嗽吐稀白痰的症状，后转为咯吐咖啡色脓样痰，伴有右胸疼痛、食欲减退、全身乏力、口干尿黄、大便结等症状，且体温高达38.6℃。这些症状与痰热壅肺和痰热结聚的证候特征相符。痰热壅肺表现为咳嗽、咯痰、胸痛、发热等症状，痰热结聚则表现为痰多、色黄或脓样、胸痛等症状，且舌质红、苔白腻、脉弦数也支持痰热的诊断。因此，陈某的证候为痰热壅肺和痰热结聚。",
        "task_4": "临证体会：患者陈某之症，初起为外感风寒，肺卫受邪，未能及时疏散，邪气内传，化热成痰，痰热壅肺，肺失宣降，故见咳嗽、咯痰。痰色由白转咖啡色脓样，提示痰热蕴结，化脓成疡。右胸疼痛，乃痰热阻滞，气血运行不畅，加之肺痈脓疡形成，局部炎症反应所致。畏寒发热，口干尿黄，大便结，舌质红，苔白腻，脉弦数，均为痰热内盛，热邪伤津，气机不畅之象。治疗当以清热解毒，化痰排脓，宣肺止咳为法，同时注意调和营卫，扶正固本，以期邪去正复，病愈身安。"
    },
    {
        "input": {
            "案例编号": "病例60",
            "临床资料": "费某，男，30岁。初诊:1970年3月20日。主诉及病史:患者于某日晚11时，突发呼嚎，自诉喉中有痰梗塞，呼吸不利，旋即不语，陷入昏迷，次日清晨送往本院抢救，在来院途中四肢抽搐，发作频繁，约有6次之多，体温37.9℃，血压140/90mmHg，二氧化碳结合力26容积%，非蛋白氮164mg%，肌酐8.4mg%。西医诊断为急性肾功能衰竭，用西药治疗3天，神识仍未清醒，乃延中医会诊。诊查:症见意识障碍，神志昏迷，瞳孔等大，对光反射迟钝，项颈稍有强直，腹胀满，大便已七八日未行，尿量减少，色黄赤，舌苔焦黑而干，质红。脉象弦数。",
            "病机答案": "",
            "病机选项": "A:热毒水湿上攻;B:郁久化热生痰;C:清窍受蒙;D:累及中、下二焦;E:阴虚;F:湿热流注于下;G:阳明受累;H:脾气不运;I:三焦不利;J:命火衰微",
            "证候答案": "",
            "证候选项": "A:热结阳明;B:风水相搏;C:三焦决渎不通;D:内伤阳络;E:瘀血凝滞;F:湿热结滞肠道;G:邪蒙心窍;H:脾胃不和;I:湿热下注;J:痰湿阻滞经络",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 喉中有痰梗塞;呼吸不利;四肢抽搐;发作频繁;腹胀满;大便已七八日未行;尿量减少;色黄赤;舌苔焦黑而干;质红;脉象弦数。",
        "task_2": "热毒水湿上攻;三焦不利\n\n解析: 根据临床资料，患者突发呼嚎，喉中有痰梗塞，呼吸不利，旋即不语，陷入昏迷，四肢抽搐，发作频繁，西医诊断为急性肾功能衰竭。中医诊查见意识障碍，神志昏迷，瞳孔等大，对光反射迟钝，项颈稍有强直，腹胀满，大便已七八日未行，尿量减少，色黄赤，舌苔焦黑而干，质红，脉象弦数。这些症状表明患者体内有热毒水湿上攻，影响了神志，同时三焦不利，导致水湿不能正常代谢，热毒与水湿上攻清窍，导致神志昏迷，同时影响了中、下二焦的功能，表现为腹胀满，大便未行，尿量减少等症状。因此，病机答案为热毒水湿上攻和三焦不利。",
        "task_3": "热结阳明;邪蒙心窍\n\n### 解析\n费某的临床表现符合中医的“热结阳明”和“邪蒙心窍”证候。热结阳明表现为高热、腹胀满、大便不通、尿量减少等症状，这与费某的腹胀满、大便七八日未行、尿量减少、色黄赤的症状相符。邪蒙心窍表现为意识障碍、神志昏迷、瞳孔反应迟钝等症状，这与费某的意识障碍、神志昏迷、瞳孔等大、对光反射迟钝的症状相符。因此，结合费某的临床表现，其证候为热结阳明和邪蒙心窍。",
        "task_4": "临证体会：本例患者突发昏迷，喉中痰鸣，呼吸不利，四肢抽搐，且有急性肾功能衰竭的西医诊断，中医辨证为热毒内闭，痰浊上蒙清窍之证。患者神志昏迷，项颈强直，提示热邪深陷，痰热蒙蔽心包，影响神明。腹胀满，大便七八日未行，尿量减少，色黄赤，舌苔焦黑而干，质红，脉象弦数，均为热毒炽盛，腑气不通，肾气受损之象。热毒内盛，耗伤津液，导致肾气受损，肾功能衰竭，故见尿量减少，色黄赤。治疗上应以清热解毒，通腑泄热，开窍醒神为主，同时兼顾保护肾气，促进肾功能恢复。需密切观察病情变化，及时调整治疗方案，以防病情进一步恶化。"
    },
    {
        "input": {
            "案例编号": "病例130",
            "临床资料": "宋君，25岁。初诊：1958年1月14日。主诉及病史：高堕撞跌头脑山骨已两天，当时有短暂昏迷；局部血肿，形若半球，按之柔软；神志时明时昧，伴有呕恶不思食。诊查：左侧手足软弱无力，视物不清，微有身热。苔薄腻，脉细。",
            "病机答案": "",
            "病机选项": "A:脾胃健运力差;B:肝气不疏;C:清阳浊阴升降失调;D:气血凝滞;E:心之气阴两虚;F:顽痰阻络;G:湿热郁阻中焦;H:热结阳明;I:胃失和降;J:瘀凝脑髓",
            "证候答案": "",
            "证候选项": "A:风湿内侵;B:湿阻血瘀;C:脾肾两虚;D:阳亢风动;E:痰浊壅遏;F:统率无权;G:瘀血凝滞;H:肾阴不充;I:肝肾阴虚;J:热入血室",
            "临证体会": ""
        },
        "task_1": "高堕撞跌头脑山骨;局部血肿;神志时明时昧;左侧手足软弱无力;视物不清;微有身热;苔薄腻;脉细。",
        "task_2": "D:气血凝滞;J:瘀凝脑髓",
        "task_3": "G:瘀血凝滞;\n\n解析：根据临床资料，患者有高堕撞跌头脑山骨的外伤史，伴有局部血肿，按之柔软，神志时明时昧，左侧手足软弱无力，视物不清，微有身热，苔薄腻，脉细。这些症状提示存在明显的瘀血凝滞，故选G。",
        "task_4": "临证体会：本例患者因高处坠落撞击头部，导致脑部损伤，出现短暂昏迷，局部形成血肿，神志状态不稳定，伴有恶心呕吐，食欲不振，左侧肢体软弱无力，视力模糊，微有发热。从中医角度分析，此为外伤后气血逆乱，血瘀脑络，清窍受蒙，故见神志时明时昧，视物不清。血肿按之柔软，提示血瘀未化，加之手足软弱无力，为气血两虚之象。苔薄腻，脉细，亦为气血不足之征。治疗上应以活血化瘀，清脑开窍，补气养血为主，以期恢复脑部气血运行，改善神志状态，促进肢体功能恢复。"
    },
    {
        "input": {
            "案例编号": "病例212",
            "临床资料": "周某，女，25岁。初诊：1978年8月14日。主诉及病史：患者剧烈头痛、呕吐，腰穿为血性脑脊液，诊断为蛛网膜下腔出血。入院后用降压、止血及对症诸疗法，病情加重，于1978年8月14日邀我会诊治疗。诊查：患者神昏谵语。舌质红绛，苔干黄，脉弦数。",
            "病机答案": "",
            "病机选项": "A:冲任受损;B:复感寒邪;C:心移热于小肠;D:肾气不足;E:气血运行不畅;F:肝阳上亢化火;G:气血两虚;H:湿热郁阻中焦;I:脾运失健;J:肝郁",
            "证候答案": "",
            "证候选项": "A:痰热扰神;B:水邪上凌心肺;C:肝肾阴虚;D:肝肾两损;E:腠理开阖不利;F:肝阳上亢;G:脾虚湿滞;H:足太阳湿热;I:心胆亏虚;J:脾肾不足",
            "临证体会": ""
        },
        "task_1": "剧烈头痛;呕吐;神昏谵语;舌质红绛;苔干黄;脉弦数",
        "task_2": "F:肝阳上亢化火",
        "task_3": "痰热扰神\n\n解析：根据患者剧烈头痛、呕吐，以及诊断为蛛网膜下腔出血，结合舌质红绛，苔干黄，脉弦数的临床表现，可以判断患者属于痰热扰神的证候。痰热扰神是中医中的一种病理状态，表现为痰热内扰，影响心神，常见于脑血管疾病、中风等病症。",
        "task_4": "本例患者因蛛网膜下腔出血，病情危急，西医治疗效果不佳，病情反而加重。从中医角度分析，患者神昏谵语，舌质红绛，苔干黄，脉弦数，这些症状提示了热毒炽盛，血热妄行，导致血溢脉外，形成出血。热毒上扰心神，故见神昏谵语。舌质红绛，苔干黄，脉弦数均为热盛之象，热邪入血分，迫血妄行，故见出血症状。治疗上应以清热解毒，凉血止血为主，同时兼顾安神定志，以期达到控制病情，挽救生命的目的。"
    },
    {
        "input": {
            "案例编号": "病例24",
            "临床资料": "孙某，男，64岁。初诊:1972年9月13日。主诉及病史:8月21日晚，突感舌根发硬，说话吐字不清。次日，自觉步态不稳，左手持物不紧，有时自行落地，口中流涎，舌稍向左偏。在某医院检查，诊为闭塞性脑血管病。用血管舒缓素、烟酸、针灸等治疗，病情略有好转。诊查:体形稍胖，右侧眼裂较小，鼻唇沟变浅，口角略向左侧歪斜，左手握力较差。伸舌向左偏斜，舌苔根部稍厚，脉弦紧。",
            "病机答案": "",
            "病机选项": "A:阴虚;B:阴血亏;C:宿瘀未化;D:肾水不足;E:痰湿内阻;F:心阴;G:食郁于胃;H:肝阳上亢;I:气血不畅;J:本大虚而标实盛",
            "证候答案": "",
            "证候选项": "A:肝肾阴虚;B:脾失健运;C:热深厥深;D:风痰阻闭经络;E:心肾阴虚;F:肝阴不足;G:脾胃虚弱;H:湿热;I:肝郁气滞;J:肝胆湿热郁滞",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 突感舌根发硬;说话吐字不清;步态不稳;左手持物不紧;口中流涎;舌稍向左偏;体形稍胖;右侧眼裂较小;鼻唇沟变浅;口角略向左侧歪斜;左手握力较差;伸舌向左偏斜;舌苔根部稍厚;脉弦紧。",
        "task_2": "肝阳上亢;痰湿内阻;气血不畅\n\n解析: 根据临床资料，患者出现舌根发硬，说话吐字不清，步态不稳，左手持物不紧，口中流涎，舌稍向左偏等症状，这些症状与中医理论中的肝阳上亢、痰湿内阻和气血不畅的病机相符合。肝阳上亢可导致头部症状，如舌根发硬、说话不清；痰湿内阻可影响肢体协调，如步态不稳、手持物不紧；气血不畅则可引起口中流涎、舌偏等症状。因此，结合患者的具体症状，病机答案为肝阳上亢、痰湿内阻和气血不畅。",
        "task_3": "D:风痰阻闭经络",
        "task_4": "临证体会：本例患者突感舌根发硬，说话不清，步态不稳，左手持物无力，口中流涎，舌向左偏，结合医院诊断为闭塞性脑血管病，中医辨证为中风。患者体形稍胖，脉弦紧，舌苔根部稍厚，提示痰湿内盛，气滞血瘀。中风病机多由肝阳上亢，痰湿阻络，或气血两虚，脉络空虚，风邪乘虚而入所致。本例患者可能因肝阳上亢，痰湿内阻，导致气血运行不畅，脑络受阻，出现中风症状。治疗上应以平肝熄风，化痰通络为主，辅以活血化瘀，调和气血。针灸治疗可选用百会、风池、合谷、太冲等穴，以疏通经络，调和气血。同时，应指导患者调整生活方式，控制体重，避免情绪激动，保持大便通畅，以减少中风的复发风险。"
    },
    {
        "input": {
            "案例编号": "病例200",
            "临床资料": "汤某，女，7岁。初诊：1979年10月13日诊查：患儿双下肢紫斑，成块成片，足肿，小便黄，口干，心烦。苔白，舌质红，脉细数。",
            "病机答案": "",
            "病机选项": "A:风邪闭于肌表;B:痰湿内阻;C:热伤血络;D:郁热;E:湿热下注;F:正气已衰;G:肾阳虚;H:肾元不固;I:阴血亏;J:水不涵木",
            "证候答案": "",
            "证候选项": "A:阻滞肠道;B:气滞血瘀;C:痰热结聚;D:营卫失和;E:痰热互结;F:湿热伤血;G:血虚生风;H:肝脾两虚;I:清窍失灵;J:阴虚肝郁",
            "临证体会": ""
        },
        "task_1": "双下肢紫斑;成块成片;足肿;小便黄;口干;心烦;苔白;舌质红;脉细数",
        "task_2": "热伤血络;湿热下注",
        "task_3": "湿热伤血",
        "task_4": "临证体会：此例患儿双下肢出现紫斑，成块成片，足部肿胀，小便黄，口干，心烦，舌质红，脉细数，苔白，这些症状提示存在血热内蕴，热毒炽盛，迫血妄行，导致血溢脉外，形成紫斑。同时，热邪伤津，故见口干，心烦。治疗上应以清热解毒，凉血止血，养阴生津为原则，方可用犀角地黄汤加减，以清热凉血，解毒散瘀，同时配伍生津养阴之品，如麦冬、生地黄等，以缓解口干心烦等症状。在治疗过程中，还需注意观察患儿的尿色、舌象及脉象变化，及时调整治疗方案。"
    },
    {
        "input": {
            "案例编号": "病例81",
            "临床资料": "徐某，男，4个月。初诊:1977年3月12日。主诉及病史:患儿出生后1个月脸面部即起红斑丘疹，渐向额部及头部扩展，糜烂流水，遇热痒甚，晚上常哭闹不安，小便短赤。曾在中医内科治疗半月无效。诊查:营养中等，面色红润，脸面、头皮成片红斑，伴有密集水疱，部分皮损显露出鲜红色的糜烂面，渗出液较多，伴有较多的痂皮。",
            "病机答案": "",
            "病机选项": "A:火热内扰心神;B:暑湿束表;C:胎毒湿热;D:脾肾阳虚;E:血瘀水停;F:热邪伤阴;G:风湿热邪;H:气血双亏;I:痰热互结;J:热盛化火",
            "证候答案": "",
            "证候选项": "A:热灼营阴;B:脾虚运化不及;C:湿热蕴肤;D:肝脾两虚;E:痰热上扰;F:脾虚生湿;G:饮热蕴结;H:营卫不和;I:热入血室;J:痰热互结",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 脸面部红斑丘疹;红斑向额部及头部扩展;糜烂流水;遇热痒甚;晚上哭闹不安;小便短赤;脸面头皮成片红斑;密集水疱;鲜红色糜烂面;渗出液较多;较多的痂皮。",
        "task_2": "C:胎毒湿热;\n\n解析: 根据临床资料，患儿出生后1个月即出现面部红斑丘疹，渐向额部及头部扩展，伴有糜烂流水，遇热痒甚，晚上常哭闹不安，小便短赤。这些症状提示存在湿热之邪，且由于患儿年龄较小，可以考虑为胎毒湿热。胎毒湿热是指胎儿在母体内受到湿热之邪的影响，出生后湿热之邪未能及时清除，导致皮肤出现红斑、丘疹、糜烂、流水等症状。因此，病机答案为C:胎毒湿热。",
        "task_3": "C:湿热蕴肤",
        "task_4": "本例患儿所患之病属于中医“湿疮”范畴，主要由于先天禀赋不足，加之后天调护不当，导致湿热内蕴，外感风邪，内外合邪，湿热之邪上犯肌肤，故见脸面部起红斑丘疹，渐向额部及头部扩展，糜烂流水，遇热痒甚。湿热之邪上扰心神，故晚上常哭闹不安。小便短赤为湿热下注膀胱之象。患儿营养中等，面色红润，说明体质尚可，但湿热之邪已深入肌肤，需内外兼治，清热解毒，祛湿止痒，调和营卫，以期达到标本兼治之效。"
    },
    {
        "input": {
            "案例编号": "病例246",
            "临床资料": "某女，48岁。初诊：1974年12月6日。主诉及病史：1954年8月患痢疾，时缓时剧，绵延20年，经武汉、北京等地医院治疗未效。后剖腹探查，诊断为“结肠溃疡”。1974年12月6日就诊于余。诊查：患者形体消瘦，精神疲乏，食欲不振，面色少华，常畏寒；大便时下脓血，便色乌黑，下血前常有多汗、小腹急痛，但无后重感，大便无血时则稀溏而色如果酱，或带白色粘液。近来发生上腹部满胀，每于饥饿时刺痛，得食则减，遇寒则剧，口泛酸水。月经时断时潮；潮前小腹刺痛，经色乌黑。脉沉迟细弱。",
            "病机答案": "",
            "病机选项": "A:虚火上炎;B:肠滑不固;C:风邪闭于肌表;D:脾肾虚寒;E:气化无力;F:久咳肺气先虚;G:络伤血瘀;H:清阳不升;I:湿热蒙蔽心窍;J:内有郁热",
            "证候答案": "",
            "证候选项": "A:脾胃虚寒;B:暑温动风;C:春温夹湿;D:虚火上炎;E:慢脾风象;F:少阳经腑同病;G:肝肾亏虚;H:邪蒙心窍;I:肠滑不固;J:湿热闭于气分",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 形体消瘦;精神疲乏;食欲不振;面色少华;畏寒;大便脓血;便色乌黑;小腹急痛;大便稀溏;色如果酱;带白色粘液;上腹部满胀;饥饿时刺痛;遇寒剧痛;口泛酸水;月经时断时潮;潮前小腹刺痛;经色乌黑;脉沉迟细弱。",
        "task_2": "D:脾肾虚寒;G:络伤血瘀;\n\n解析: 根据临床资料，患者长期患有痢疾，表现为形体消瘦、精神疲乏、食欲不振、面色少华、畏寒、大便时下脓血、便色乌黑、下血前多汗、小腹急痛、大便无血时稀溏色如果酱或带白色粘液、上腹部满胀、饥饿时刺痛、遇寒则剧、口泛酸水、月经时断时潮、潮前小腹刺痛、经色乌黑、脉沉迟细弱。这些症状提示脾肾虚寒，脾肾阳气不足，不能温煦和固摄，导致肠滑不固，大便异常，同时络伤血瘀，影响气血运行，导致腹部疼痛和月经异常。",
        "task_3": "脾胃虚寒;肠滑不固\n\n解析：根据临床资料，患者有长期的痢疾史，表现为大便时下脓血，便色乌黑，下血前常有多汗、小腹急痛，大便无血时则稀溏而色如果酱，或带白色粘液，这些都是肠滑不固的表现。同时，患者形体消瘦，精神疲乏，食欲不振，面色少华，常畏寒，脉沉迟细弱，这些都是脾胃虚寒的典型症状。因此，证候答案为脾胃虚寒和肠滑不固。",
        "task_4": "临证体会：患者长期患痢疾，病程长达20年，病情时轻时重，经多方治疗未见明显好转，最终诊断为“结肠溃疡”。从中医角度分析，患者形体消瘦、精神疲乏、食欲不振、面色少华，均为脾胃虚弱、气血不足的表现。畏寒、大便时下脓血、便色乌黑、下血前多汗、小腹急痛，以及大便无血时则稀溏色如果酱或带白色粘液，提示脾肾阳虚，不能固摄，导致大肠湿热下注，血络受损，故见脓血便。上腹部满胀、饥饿时刺痛、遇寒则剧，以及口泛酸水，反映脾胃虚寒，中焦运化失常，寒湿内生，气机不畅。月经时断时潮、潮前小腹刺痛、经色乌黑，提示肝气郁结，血瘀下焦。脉沉迟细弱，为气血两虚、阳气不足之象。\n\n综上所述，本患者病机复杂，涉及脾肾阳虚、脾胃虚寒、肝气郁结、血瘀下焦等多个方面，治疗应以温补脾肾、健脾和胃、疏肝理气、活血化瘀为原则，同时注意调养气血，扶正固本，以期达到标本兼治的效果。"
    },
    {
        "input": {
            "案例编号": "病例38",
            "临床资料": "吴某，男，59岁。初诊:1975年8月3日。主诉及病史:于1974年9月9日经某医院诊为“乳糜血尿”而住院，因不愿手术，于7月15日出院。8月3日来我院门诊求治。诊查:当时面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起。脉象缓细无力，舌苔淡如菜根。",
            "病机答案": "",
            "病机选项": "A:脾弱湿盛;B:兼有湿热;C:肾气不固;D:脾肾阳虚;E:水气搏结;F:耗伤阴血;G:上溢而衄;H:胃气上逆;I:水邪泛滥;J:痰湿内阻",
            "证候答案": "",
            "证候选项": "A:湿热下注;B:湿热化燥;C:热入营血;D:脾虚湿热下注;E:脾胃不和;F:肝郁血滞;G:湿阻血瘀;H:下元虚损;I:血虚阳弱;J:气滞血瘀",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 面貌呈严重贫血状;尿中有箸状血条;脉象缓细无力;舌苔淡如菜根。",
        "task_2": "脾肾阳虚;耗伤阴血\n\n解析: 根据吴某的临床资料，他有严重的贫血状，尿中有箸状血条，行动腿抬不起，脉象缓细无力，舌苔淡如菜根。这些症状提示他可能存在脾肾阳虚，导致气血生化不足，出现贫血和血尿。同时，由于脾肾阳虚，不能固摄血液，导致血液耗伤，出现血尿和贫血的症状。因此，病机答案为脾肾阳虚和耗伤阴血。",
        "task_3": "下元虚损;脾虚湿热下注\n\n理由:根据吴某的临床资料，他有严重的贫血状，尿中有箸状血条，行动不便，脉象缓细无力，舌苔淡如菜根。这些症状提示存在下元虚损，即肾气不足，肾精亏损，导致血尿和贫血。同时，脉象缓细无力和舌苔淡如菜根也提示脾虚湿热下注，脾虚不能运化水湿，湿热下注于下焦，导致血尿。因此，结合吴某的临床表现，证候应为下元虚损和脾虚湿热下注。",
        "task_4": "临证体会：本例患者吴某，男，59岁，主诉为“乳糜血尿”，面貌呈严重贫血状，尿中有箸状血条，行动腿抬不起，脉象缓细无力，舌苔淡如菜根。从中医理论分析，此为肾气亏虚，气血两亏之象。肾主水，藏精，肾气亏虚则不能固摄精微，导致乳糜血尿；气血两亏则面色苍白，行动无力。脉象缓细无力，舌苔淡如菜根，均为气血不足的表现。治疗上应以补肾益气，固摄精微，调和气血为主。可选用补中益气汤合六味地黄丸加减，以补益肾气，固摄精微，调和气血，改善患者症状。同时，饮食上应加强营养，避免过度劳累，保持良好的生活习惯，以助于病情的恢复。"
    },
    {
        "input": {
            "案例编号": "病例108",
            "临床资料": "朱某，女，67岁。初诊：1970年9月.主诉及病史：口中常有甜味已2个多月，饮水亦觉水有甜味，食管和胃部有不适感，经常恶心，胃纳很差，胃中饱滞，每天只能在晨间吃1个鸡蛋和半杯白粥，整天不再进食。近10多天发热，体温在37.5～39℃之间，伴尿频尿急。有胃病史，发作时要服用苏打片，大便常秘结，十几年来靠服芦荟丸才能解出大便。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感。精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，不愿进食。过去嗜食糖。患此病后拒绝食糖，不肯服食甜味、苦味和辣味的药品，也拒绝住院治疗。曾请西医治疗未效，特请中医诊治。",
            "病机答案": "",
            "病机选项": "A:血瘀水停;B:脾胃亏损;C:气化不利;D:血枯火秘证;E:清窍被蒙;F:脾胃不健;G:肾气虚;H:肝经湿热下注;I:三焦不利;J:心气虚",
            "证候答案": "",
            "证候选项": "A:督脉瘀阻;B:肝肾亏虚;C:肝肾阴虚;D:心脾肾虚;E:外感风温;F:三焦决渎不通;G:冲任受损;H:肝失温养;I:风温时邪;J:脾虚不运",
            "临证体会": ""
        },
        "task_1": "口中常有甜味;饮水有甜味;食管不适;胃部不适;恶心;胃纳差;胃中饱滞;发热;体温37.5～39℃;尿频;尿急;胃病史;大便秘结;夜睡不宁;易惊醒;睡眠中遗尿;黎明前恐怖感;精神疲乏;嗜卧床;头脑不清醒;讲话词不达意;拒绝食糖;拒绝服食甜味、苦味和辣味药品;拒绝住院治疗;嗜食糖史。",
        "task_2": "脾胃亏损;气化不利\n\n解析: 根据临床资料，患者口中常有甜味，饮水亦觉水有甜味，食管和胃部有不适感，经常恶心，胃纳很差，胃中饱滞，这些都是脾胃功能失调的表现。患者大便常秘结，十几年来靠服芦荟丸才能解出大便，说明其脾胃亏损，气化功能受到影响，导致大便不畅。此外，患者精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，这些都是脾胃亏损，气血生化不足，清窍被蒙的表现。因此，病机答案为脾胃亏损和气化不利。",
        "task_3": "脾虚不运\n\n解析: 根据临床资料，患者口中常有甜味，饮水亦觉水有甜味，食管和胃部有不适感，经常恶心，胃纳很差，胃中饱滞，这些都是脾胃功能失调的表现。患者大便常秘结，十几年来靠服芦荟丸才能解出大便，说明脾虚不能运化，导致大便干燥。患者精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，这些都是脾虚不运的典型症状。因此，证候答案为脾虚不运。",
        "task_4": "临证体会：本例患者口中常有甜味，饮水亦觉水有甜味，此为脾胃湿热内蕴，上蒸于口，故口甜。食管和胃部不适，经常恶心，胃纳很差，胃中饱滞，乃脾胃运化失常，湿热阻滞中焦，气机不畅所致。长期服用芦荟丸以解大便，虽能暂时缓解便秘，但长期使用苦寒之品，易伤脾胃之阳，导致脾胃功能进一步受损。近10多天发热，体温在37.5～39℃之间，伴尿频尿急，提示湿热下注，膀胱气化不利，湿热蕴结下焦。夜睡不宁，易惊醒，有时睡眠中遗尿，黎明前有恐怖感，此为心肾不交，心神失养，肾气不固之象。精神疲乏，嗜卧床，头脑欠清醒，讲话词不达意，不愿进食，皆为脾胃虚弱，气血生化乏源，心神失养之表现。过去嗜食糖，患此病后拒绝食糖，不肯服食甜味、苦味和辣味的药品，也拒绝住院治疗，说明患者对甜食的嗜好可能与脾胃湿热有关，而对苦辣味的药品的拒绝，可能是因为苦寒之品易伤脾胃，辣味之品易助湿热。治疗上应以清热利湿，健脾和胃，调和心肾为主，同时注意调养心神，固摄肾气。"
    },
    {
        "input": {
            "案例编号": "病例243",
            "临床资料": "张某，男，65岁。主诉及病史：患者平素逸多劳少，体弱而肥，动则喘气，善太息，心慌，心悸不安，稍事劳动即感体力不支，尤以汗出为甚，稍动则汗出淋漓，虽在冬月，头项亦汗出蒸蒸，额鼻冒出汗珠，常导致感冒。近3个月来，症状转化，由白天出汗转为晚间出汗，寐则汗出，寤则汗收，衣被常湿，形寒畏冷，弱不禁风，伴之以胸闷心痛，四肢厥冷，气短不足以息。西医诊断：冠状动脉供血不足，伴自主性神经功能紊乱。诊查：脉沉细，舌质暗淡、苔淡黄。体胖而皮肤反枯，衣物内冒出汗臭气，口唇带紫而干。",
            "病机答案": "",
            "病机选项": "A:肺气虚;B:肝气不疏;C:阴虚素质;D:风寒湿邪留注肌骨;E:水邪泛滥;F:气不行湿;G:肝气有余;H:化热伤阴;I:脾胃受损;J:邪在阳明",
            "证候答案": "",
            "证候选项": "A:血虚生风;B:肺胃失养;C:阴气失固;D:阴虚内热;E:气滞血瘀;F:痰蒙心窍;G:脾胃不和;H:肾水无制;I:肺金失养;J:阳明积热",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 体弱而肥;动则喘气;善太息;心慌;心悸不安;体力不支;汗出淋漓;冬月头项汗出;寐则汗出;寤则汗收;衣被常湿;形寒畏冷;胸闷心痛;四肢厥冷;气短不足以息;脉沉细;舌质暗淡;苔淡黄;体胖而皮肤反枯;衣物内冒出汗臭气;口唇带紫而干。",
        "task_2": "肺气虚;阴虚素质\n\n解析：根据张某的临床资料，他有体弱而肥、动则喘气、心慌心悸、稍动则汗出淋漓、形寒畏冷、胸闷心痛、四肢厥冷、气短等症状，这些症状与中医理论中的肺气虚和阴虚素质的病机相符合。肺气虚表现为气短、动则喘气、易汗出、畏冷等症状，而阴虚素质则表现为夜间出汗、形寒畏冷、口唇干等症状。因此，张某的病机可以诊断为肺气虚和阴虚素质。",
        "task_3": "C:阴气失固;E:气滞血瘀\n\n解析：患者体弱而肥，动则喘气，心慌心悸，稍动则汗出淋漓，且由白天出汗转为晚间出汗，寐则汗出，寤则汗收，形寒畏冷，弱不禁风，伴胸闷心痛，四肢厥冷，气短不足以息，脉沉细，舌质暗淡、苔淡黄，体胖而皮肤反枯，衣物内冒出汗臭气，口唇带紫而干。这些症状表明患者存在阴气失固，气不摄津，导致汗出异常，同时伴有气滞血瘀，气血运行不畅，影响心肺功能，故选C:阴气失固;E:气滞血瘀。",
        "task_4": "临证体会：本病主要责之心肺脾三脏。患者体胖而逸多劳少，导致脾虚运化失常，肺气不足，心阳不振。脾虚则生湿，湿盛则化热，热蒸于内，故汗出多而臭；肺气虚则卫外不固，腠理不密，故动则汗出，且易感外邪；心阳虚则血行不畅，故口唇带紫，胸闷心痛。入夜则阳气内敛，心阳更虚，故汗出转为夜间，且畏冷肢厥。此乃心肺脾三脏功能失调，气阴两虚，阳气不固之象。治疗当以益气固表，温阳化湿，养心安神为法。"
    },
    {
        "input": {
            "案例编号": "病例31",
            "临床资料": "关某，女，20岁。初诊：1977年11月15日。主诉及病史：患者1年前丧父，悲恸至极，又因工作、生活不顺心，情志怫郁。2个月前，开始头晕头痛，多梦失眠，心烦易怒。1周前其父逝世周年，亲属毕至，悲恸异常，当晚睡中突然精神错乱，语无伦次，哭闹不休。经山东某医院神经科诊为精神分裂症。11月15日查房时，患者正阵发性发作烦躁，精神错乱，语无伦次，哭闹不休，躁动不宁，不知秽洁，时欲出走。俟神志略清时，自诉头晕、头重、巅顶有压迫感，胸闷，善太息，善惊，恶闻人声，失眠、多梦，饮食喜冷，大便干、数日一行，小便黄赤。诊查：六脉洪滑数、100次/分，舌苔黄褐厚、舌红、舌尖绛。",
            "病机答案": "",
            "病机选项": "A:阴虚阳亢;B:清阳失展;C:瘀阻血络;D:脏腑气血功能紊乱;E:情志失调;F:清阳浊阴升降失调;G:痰热结聚;H:生湿成痰;I:肝气郁结;J:火升风动",
            "证候答案": "",
            "证候选项": "A:肝肾不足;B:心火内炽;C:肝气犯胃;D:水邪凌胸;E:气血两虚;F:肝郁化火;G:迫血妄行;H:阳亢风动;I:暑湿内伏;J:痰火迷神",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 悲恸;情志怫郁;头晕;头痛;多梦;失眠;心烦易怒;精神错乱;语无伦次;哭闹不休;躁动不宁;头晕;头重;巅顶压迫感;胸闷;善太息;善惊;恶闻人声;失眠;多梦;饮食喜冷;大便干;数日一行;小便黄赤;六脉洪滑数;舌苔黄褐厚;舌红;舌尖绛。",
        "task_2": "阴虚阳亢;情志失调;肝气郁结;火升风动\n\n解析: 关某的临床表现和病史显示了中医病机的多个方面。首先，她有明显的阴虚阳亢症状，如头晕、头痛、心烦易怒、舌红、舌尖绛、脉洪滑数，这些都是阴虚不能制阳，导致阳亢的表现。其次，她的情志失调，表现为悲恸、工作生活不顺心，这是导致疾病的重要因素。再者，肝气郁结，表现为胸闷、善太息、善惊、恶闻人声，这些都是肝气不舒的表现。最后，火升风动，表现为精神错乱、语无伦次、哭闹不休、躁动不宁，这是肝火上炎，扰动心神的表现。因此，综合分析，关某的病机为阴虚阳亢、情志失调、肝气郁结、火升风动。",
        "task_3": "肝郁化火;痰火迷神\n\n解析：根据临床资料，患者有明显的情志怫郁史，表现为精神错乱、语无伦次、哭闹不休、躁动不宁等症状，同时伴有头晕、头重、巅顶有压迫感、胸闷、善太息、善惊、恶闻人声、失眠、多梦、饮食喜冷、大便干、小便黄赤等。六脉洪滑数、舌苔黄褐厚、舌红、舌尖绛，这些症状和体征提示存在肝郁化火和痰火迷神的证候。肝郁化火表现为情绪波动大、易怒、头晕头痛、失眠多梦等症状，而痰火迷神则表现为精神错乱、语无伦次、烦躁不安等症状，两者结合可以解释患者的临床表现。",
        "task_4": "临证体会：本案患者因情志内伤，悲恸过度，加之生活工作压力，导致肝气郁结，久而化火。肝火上炎，扰动心神，故见头晕头痛，多梦失眠，心烦易怒。悲恸异常后，肝火炽盛，上扰清窍，致精神错乱，语无伦次，哭闹不休，此为肝火犯心，心神失守之象。患者胸闷，善太息，善惊，恶闻人声，皆为肝气郁结，气机不畅所致。饮食喜冷，大便干结，小便黄赤，六脉洪滑数，舌苔黄褐厚，舌红，舌尖绛，均为肝火内盛，热伤津液之征。治疗当以清肝泻火，养心安神为主，辅以疏肝解郁，调畅气机。"
    },
    {
        "input": {
            "案例编号": "病例221",
            "临床资料": "高某，男，42岁。初诊：1963年4月8日。主诉及病史：病起于7年前，因工作常常熬夜，甚至通宵达旦，继因工作不顺心，日夜思考，逐渐形成失眠。即便能睡，但合目即梦，头昏不清，神疲肢软。诊查：形体消瘦，食少纳差，胸痞肠鸣，大便稀溏。舌边红绛，舌心苔薄乏津，脉弦细。",
            "病机答案": "",
            "病机选项": "A:肝阳偏亢;B:气血瘀滞;C:阳气乃奋;D:伤及心阴;E:心气虚;F:外感温毒壅于少阳经;G:肝郁;H:脾虚;I:饮邪郁遇;J:伤瘀留滞",
            "证候答案": "",
            "证候选项": "A:气血两亏;B:热伏于里之温热重症;C:血瘀津亏;D:痰湿阻滞经络;E:肝郁脾虚;F:肝旺脾弱;G:虚风内动;H:咳久脾虚;I:肝肾阴虚;J:痰热扰神",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 失眠;合目即梦;头昏;神疲肢软;形体消瘦;食少纳差;胸痞;肠鸣;大便稀溏;舌边红绛;舌心苔薄乏津;脉弦细。",
        "task_2": "D:伤及心阴;H:脾虚\n\n解析：根据临床资料，患者长期熬夜，工作压力大，导致失眠、头昏、神疲肢软等症状，这些都是心阴受损的表现。同时，患者形体消瘦，食少纳差，胸痞肠鸣，大便稀溏，舌边红绛，舌心苔薄乏津，脉弦细，这些都是脾虚的典型症状。因此，病机为心阴受损和脾虚。",
        "task_3": "E:肝郁脾虚;F:肝旺脾弱\n\n解析：根据高某的临床资料，他有长期熬夜、工作压力大、失眠、合目即梦、头昏、神疲肢软等症状，这些都是肝郁的表现。同时，他还有形体消瘦、食少纳差、胸痞肠鸣、大便稀溏等脾虚的症状。舌边红绛、舌心苔薄乏津、脉弦细也支持肝郁脾虚的诊断。因此，证候答案为E:肝郁脾虚;F:肝旺脾弱。",
        "task_4": "临证体会：此例属于心脾两虚兼有肝郁之证。长期熬夜及精神压力导致心脾受损，心主神明，脾主运化，心脾两虚则神不守舍，运化失常，故见失眠、头昏、神疲肢软、食少纳差、胸痞肠鸣、大便稀溏等症状。舌边红绛，舌心苔薄乏津，脉弦细，均为心脾两虚，肝气郁结之象。肝主疏泄，肝郁则气机不畅，影响心脾功能，故治疗上需兼顾养心安神、健脾和胃、疏肝解郁。"
    },
    {
        "input": {
            "案例编号": "病例352",
            "临床资料": "尹某，男，41岁.初诊:1972年8月。主诉及病史:自1964年以后经常肝区疼痛，同时伴有低烧(37.5~38.0℃)，肝功能正常，未确诊。1972年5月感冒发热，肝区疼痛突然加重，呈针刺样痛，难以忍受，经多个医院同位素、胎甲球蛋白等检查，诊断为肝癌。一直住院治疗，虽经多方处理，但发热、肝区疼痛始终未见改善，全身情况亦逐日恶化。遂来我处就诊。诊查:患者仍有肝区疼痛，胃脘胀满，低热，大便偏溏，纳差，日食半斤左右。形体消瘦，面色青暗，神乏气短。脉沉细弦数，舌青赤有瘀斑，苔薄白。肝肋下5cm，表面不甚平滑，中等硬度，压痛明显。",
            "病机答案": "",
            "病机选项": "A:风热犯肺;B:化热生痰;C:热邪下注;D:精血亏损;E:气血两虚;F:络道阻塞;G:脾虚气虚;H:气滞血瘀;I:固摄失司;J:寒凝血滞",
            "证候答案": "",
            "证候选项": "A:气血失和;B:肝阴虚;C:真阴亏损;D:肝脾不和;E:迫血妄行;F:感暑邪;G:脾肾两虚;H:肝脾两虚;I:气滞血瘀;J:肝肾阴虚",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 肝区疼痛;低烧;胃脘胀满;大便偏溏;纳差;形体消瘦;面色青暗;神乏气短;脉沉细弦数;舌青赤有瘀斑;苔薄白;肝肋下5cm;表面不甚平滑;中等硬度;压痛明显。",
        "task_2": "病机答案: 气滞血瘀;精血亏损\n\n解析: 根据尹某的临床资料，他有肝区疼痛、低烧、胃脘胀满、大便偏溏、纳差、消瘦、面色青暗、神乏气短等症状，脉象为沉细弦数，舌象为青赤有瘀斑，苔薄白。这些症状和体征提示存在气滞血瘀的情况，即气机不畅导致血液运行受阻，形成瘀血，这与肝区疼痛和压痛明显相符合。同时，尹某的消瘦、面色青暗、神乏气短等症状也提示存在精血亏损，即气血不足，这与他的长期疾病消耗和营养不良有关。因此，综合分析，尹某的病机为气滞血瘀和精血亏损。",
        "task_3": "I:气滞血瘀",
        "task_4": "临证体会：尹某之病情，主要表现为肝区疼痛、低热、胃脘胀满、大便溏薄、纳差、形体消瘦、面色青暗、神乏气短等症状，结合脉象沉细弦数、舌象青赤有瘀斑、苔薄白，以及肝大、表面不平滑、中等硬度、压痛明显的体征，中医辨证为肝郁脾虚、气滞血瘀、湿热内蕴之证。\n\n肝区疼痛、低热、面色青暗、舌青赤有瘀斑，提示肝气郁结，血行不畅，瘀血内停。胃脘胀满、大便偏溏、纳差，反映脾虚湿困，运化失常。脉沉细弦数，舌苔薄白，说明湿热内蕴，气机不畅。气短、神乏，是气虚之象，与长期疾病消耗有关。\n\n治疗上，应以疏肝理气、活血化瘀、健脾利湿、清热解毒为原则。可选用柴胡疏肝散加减，以疏肝解郁、理气止痛；配以桃红四物汤加减，以活血化瘀、调和气血；同时，加入四君子汤加减，以健脾益气、化湿止泻；并可酌情加入清热解毒之品，如黄连、黄芩等，以清热利湿。\n\n在治疗过程中，应注意调摄情志，避免情绪波动，保持心情舒畅，以利于肝气的疏泄。同时，饮食上宜清淡，避免油腻、辛辣之品，以免加重脾胃负担，影响湿热的运化。此外，应适当增加营养，以改善患者消瘦、乏力的状态，提高机体抵抗力。"
    },
    {
        "input": {
            "案例编号": "病例189",
            "临床资料": "梅某，女，36岁。初诊：1961年8月19日。主诉及病史：头晕心烦，腹痛。诊查：面微赤，手足心发热，脉濡数，苔薄白质红。",
            "病机答案": "",
            "病机选项": "A:脾肾亏虚;B:郁久化热;C:瘀热蕴结;D:伤阴灼液;E:痰浊中阻;F:气血两亏;G:风湿之邪胶结;H:脾胃受伤;I:伤暑;J:脾虚",
            "证候答案": "",
            "证候选项": "A:伤脾胃;B:感暑邪;C:上焦肺失肃降;D:痰热内蕴;E:肝旺脾弱;F:心肾两亏;G:湿热中阻;H:阳明腑经湿热内攘;I:肝郁脾虚;J:积热膀胱",
            "临证体会": ""
        },
        "task_1": "面微赤;手足心发热;脉濡数;苔薄白质红;头晕心烦;腹痛",
        "task_2": "郁久化热;脾胃受伤\n\n解析：根据梅某的临床资料，她有头晕心烦、腹痛的症状，面微赤，手足心发热，脉濡数，苔薄白质红。这些症状提示存在内热和脾胃功能受损的情况。选项中，“郁久化热”表示情绪或气滞久郁，导致体内热象，与面微赤、手足心发热相符；“脾胃受伤”则直接指向脾胃功能受损，与腹痛、脉象和舌象的异常相吻合。因此，结合梅某的临床表现，病机答案应为“郁久化热”和“脾胃受伤”。",
        "task_3": "肝旺脾弱\n\n解析：根据梅某的临床资料，她有头晕心烦、腹痛的症状，面微赤，手足心发热，脉濡数，苔薄白质红。这些症状和体征提示我们可能存在肝旺脾弱的情况。肝旺可以导致头晕心烦，脾弱则可能导致腹痛。面微赤、手足心发热、脉濡数和苔薄白质红也与肝旺脾弱的证候特征相符。因此，根据给出的证候选项，最符合梅某临床表现的是肝旺脾弱（E）。",
        "task_4": "临证体会：本案患者梅某，女，36岁，主诉头晕心烦，腹痛，面微赤，手足心发热，脉象濡数，舌苔薄白质红。根据中医理论，面微赤、手足心发热、脉濡数提示体内有热象，而舌苔薄白质红则反映湿热内蕴。头晕心烦可能与肝胆湿热上扰清窍有关，腹痛则可能是因为湿热下注，导致气机不畅，气血运行受阻。综合分析，梅某的病情可归结为湿热内蕴，上扰清窍，下注腹痛的证候。治疗上应以清热利湿，调和气机为原则，可选用清热解毒、利湿化浊的方药，如黄连解毒汤加减，以期达到清热除湿，调畅气机，缓解症状的目的。"
    },
    {
        "input": {
            "案例编号": "病例216",
            "临床资料": "唐女，32岁。主诉及病史：高热神昏谵语1天，体温39.8℃(腋窝)。其夫仅谓其妻两天前诉及天热烦渴甚，喉间干燥，仍照常操持家务及在炼铁炉旁协助制作铁器。前日见其精神不振，但未发现有其他情况。至今日黎明忽闻其说胡话，初以为梦语，喊之不应，起而视之，面红汗出，扪其额及皮肤灼手。夜间曾解小便3次。乃急至卫生所求治。诊查：症见全身汗出，面唇红赤，用开口器强张其口，舌红苔黄燥，靠近根部舌边有糜烂点3个，咽喉粘膜充血。脉数。",
            "病机答案": "",
            "病机选项": "A:温病热灼营阴;B:瘀血凝滞;C:脾失健运;D:耗伤气阴;E:复感寒邪;F:瘀血阻滞胞脉;G:心移热于小肠;H:火热内扰心神;I:累及肾阴;J:心火又灼肺",
            "证候答案": "",
            "证候选项": "A:移热于小肠;B:兼感外邪;C:脾气虚;D:肝肾亏虚;E:肾亦受损;F:上热下寒;G:燥结便秘;H:气血两亏;I:痰瘀互结;J:扰及心神",
            "临证体会": ""
        },
        "task_1": "高热;神昏谵语;体温39.8℃;面红汗出;舌红苔黄燥;舌边糜烂点;咽喉粘膜充血;脉数",
        "task_2": "温病热灼营阴;火热内扰心神",
        "task_3": "J:扰及心神;A:移热于小肠\n\n解析：根据临床资料，患者高热神昏谵语，体温高达39.8℃，面红唇赤，舌红苔黄燥，咽喉粘膜充血，这些都是热邪扰心的典型表现，故选J:扰及心神。同时，患者夜间曾解小便3次，说明热邪可能已经影响到小肠，导致小肠功能失常，故选A:移热于小肠。",
        "task_4": "临证体会：本例患者高热神昏，体温高达39.8℃，面红唇赤，全身汗出，舌红苔黄燥，咽喉粘膜充血，脉数，皆为热邪炽盛之象。患者两天前已有烦渴、喉间干燥之症，提示热邪已侵入体内，耗伤津液。至今日高热神昏，说明热邪深入，已影响心神，导致神志不清。舌边有糜烂点，咽喉充血，显示热毒上攻，损伤局部组织。综合分析，此为热邪炽盛，耗伤津液，上扰心神，下损阴液之证。治疗当以清热解毒，养阴生津，安神定志为主。"
    },
    {
        "input": {
            "案例编号": "病例5",
            "临床资料": "张某，女，43岁。初诊:1983年8月1日。主诉及病史(家属代诉):反复高热10余日，体温38~40℃，多汗口渴，便秘，尿少，继而出现尿闭，人工导尿已9天。曾用抗生素及清营汤、白虎汤加减治疗无效。",
            "病机答案": "",
            "病机选项": "A:湿热下注;B:热结膀胱;C:浊湿阻滞中焦;D:气化失调;E:风热犯肺;F:情志失调;G:水不涵木;H:耗伤心神;I:热邪下注;J:虚热上蒸",
            "证候答案": "",
            "证候选项": "A:血瘀气滞;B:肝脾两虚;C:玉关失固;D:肺肾阴亏;E:风痰窜络;F:血瘀;G:暑温;H:督脉瘀阻;I:湿热下注;J:痰热扰心",
            "临证体会": ""
        },
        "task_1": "高热;多汗口渴;便秘;尿少;尿闭;脉象和舌象未在描述中明确给出，但可以根据症状推测可能存在脉数或脉洪大，舌红或舌绛等热象表现。实际信息抽取应包含：高热;多汗口渴;便秘;尿少;尿闭;脉数(推测);舌红(推测)。但基于给出的信息，确切的脉象和舌象无法确定，因此核心临床信息主要为症状描述。在临床实践中，脉象和舌象对于中医诊断非常重要，但在本例中未提供，故只能根据症状进行信息抽取。如果需要完整的核心临床信息，应包括脉象和舌象的描述。在实际临床记录中，中医诊断通常会包括脉象和舌象的描述，以全面反映患者的病情。在本例中，由于高热、多汗口渴、便秘、尿少、尿闭等症状明显，可以推测可能存在热象，但具体脉象和舌象的描述对于确定中医诊断和治疗方案至关重要。在临床实践中，医生会根据患者的脉象和舌象，结合其他症状，综合判断患者的体质和病情，制定个性化的治疗方案。在本例中，由于缺乏脉象和舌象的具体描述，信息抽取的核心临床信息主要基于症状描述，但实际临床诊断和治疗方案的制定需要结合脉象和舌象的详细信息。",
        "task_2": "热结膀胱;气化失调;热邪下注\n\n### 解析\n张某的症状表现为反复高热、多汗口渴、便秘、尿少乃至尿闭，这些症状提示体内有明显的热邪存在。热邪下注至膀胱，导致膀胱气化功能失调，无法正常排尿，故出现尿闭，需要人工导尿。同时，热邪还可能导致中焦（脾胃）功能失调，但根据提供的病机选项，\"浊湿阻滞中焦\"并未被选中，说明主要病机集中在下焦的膀胱和热邪的影响上。因此，\"热结膀胱\"、\"气化失调\"和\"热邪下注\"是与张某病情最为相关的病机。",
        "task_3": "G:暑温\n\n解析: 根据张某的临床资料，她有反复高热、多汗口渴、便秘、尿少等症状，且体温高达38~40℃，这些症状与暑温的证候特征相符。暑温是中医中的一种热病，多发于夏季，由暑热之邪侵袭人体所致，常表现为高热、口渴、汗多、尿少等症状。因此，张某的证候应为暑温。",
        "task_4": "临证体会：患者高热持续，多汗口渴，便秘尿少乃至尿闭，此乃热毒炽盛，耗伤津液，腑实热结之象。热毒内盛，津液被耗，故见多汗口渴；热结于腑，气机不利，故便秘；热毒上扰心神，下迫膀胱，膀胱气化不利，故尿少乃至尿闭。治疗当以清热解毒，通腑泄热，生津止渴为主，同时需注意保护心肾，防止热毒进一步损伤脏腑功能。在治疗过程中，应密切观察患者的生命体征，及时调整治疗方案，以防止病情恶化。"
    },
    {
        "input": {
            "案例编号": "病例229",
            "临床资料": "王某，女，34岁，已婚。初诊：1984年8月9日。主诉及病史：1984年6月2日月经来潮后，至今2个月余未净，曾在某医院住院治疗，诊断为“子宫内膜炎”，用止血药及抗炎药治疗好转出院；出院后阴道仍出血不止，于1984年7月28日住入我院。妇科检查：子宫后倾，略大于正常，双侧附件增厚，压痛(+)。诊查：现阴道仍有少量出血，色暗、无血块；小腹疼痛坠胀，拒按；腹痛甚则出血多，痛缓则血少；有时腰痛；口唇发麻，睡眠多梦易惊。舌淡暗少苔，脉弦软滑(70次/分)。",
            "病机答案": "",
            "病机选项": "A:湿邪阻滞;B:固摄失司;C:脾胃不健;D:肝阳升腾;E:冲任失养;F:宿瘀未化;G:肝阴耗损;H:瘀血阻滞胞脉;I:阳明脉虚;J:湿邪夹热内郁",
            "证候答案": "",
            "证候选项": "A:心肾不交;B:肝旺湿热;C:湿热;D:脾虚不运;E:外感时疫;F:风湿内侵;G:痰瘀交结;H:心火下移小肠;I:上焦肺失肃降;J:瘀血阻络",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 阴道出血2个月余未净;色暗;无血块;小腹疼痛坠胀拒按;腹痛与出血量相关;腰痛;口唇发麻;睡眠多梦易惊;舌淡暗少苔;脉弦软滑",
        "task_2": "冲任失养;瘀血阻滞胞脉\n\n解析：根据临床资料，患者月经来潮后2个月余未净，且有子宫内膜炎的病史，阴道出血色暗、无血块，小腹疼痛坠胀，拒按，腹痛与出血量相关，口唇发麻，睡眠多梦易惊，舌淡暗少苔，脉弦软滑。这些症状提示存在冲任失养和瘀血阻滞胞脉的病机。冲任失养可导致月经不调，瘀血阻滞胞脉则表现为出血不止、色暗、小腹疼痛等症状。",
        "task_3": "瘀血阻络",
        "task_4": "临证体会：本例患者月经来潮后持续出血2个月余，且在医院诊断为“子宫内膜炎”，经过止血药及抗炎药治疗后虽有好转，但出血并未完全停止，说明病情较为复杂，可能涉及冲任不固、瘀血阻滞、湿热蕴结等多方面因素。患者小腹疼痛坠胀、拒按，腹痛与出血量相关，腰痛，口唇发麻，睡眠多梦易惊，舌淡暗少苔，脉弦软滑，这些症状和体征提示存在血瘀、气滞、湿热等病机。\n\n中医认为，子宫内膜炎等妇科炎症常与湿热下注有关，而持续出血、小腹疼痛则提示有瘀血阻滞。舌淡暗、少苔、脉弦软滑，是血瘀、气滞、湿热的典型舌脉表现。口唇发麻可能与血瘀气滞有关，而多梦易惊则可能与心神不宁相关，心主血脉，心神不宁亦可影响血行。\n\n治疗上，应以活血化瘀、清热利湿、调气止痛为主，可选用桃红四物汤加减，以活血化瘀；配伍黄柏、茯苓等清热利湿；加用香附、川楝子等调气止痛。同时，根据患者的具体情况，可适当加入安神定志的药物，如酸枣仁、远志等，以改善睡眠质量，调和心神。在治疗过程中，还需注意观察病情变化，适时调整治疗方案，以达到标本兼治的目的。"
    },
    {
        "input": {
            "案例编号": "病例147",
            "临床资料": "陆某，男，47岁。初诊：1965年12月17日。主诉及病史：血压190/134mmHg。身体素健，因1年前儿子突然死亡而悲伤过度，连续彻夜不眠。嗣后常感头晕胀痛，面赤升火，心悸怔忡，尤以紧张时更甚。曾在某医院治疗，服西药并休息年余。诊查：口舌干燥。脉弦细，苔薄腻。",
            "病机答案": "",
            "病机选项": "A:阴虚火炽;B:肝失温养;C:后天失养;D:伤及心阴;E:肝风夹痰;F:痰热互结;G:寒湿之邪乘虚侵袭;H:胃失和降;I:肾水不足;J:血热夹瘀",
            "证候答案": "",
            "证候选项": "A:相火妄动;B:暑温;C:心火内炽;D:痰热;E:心肾两伤;F:脾失统摄;G:本虚标实;H:真寒假热;I:阴虚阳亢;J:痰浊壅遏",
            "临证体会": ""
        },
        "task_1": "血压190/134mmHg;儿子突然死亡而悲伤过度;彻夜不眠;头晕胀痛;面赤升火;心悸怔忡;紧张时症状加重;口舌干燥;脉弦细;苔薄腻。",
        "task_2": "阴虚火炽;肝风夹痰\n\n解析：根据陆某的临床资料，他有持续的高血压（190/134mmHg），头晕胀痛，面赤升火，心悸怔忡，口舌干燥，脉弦细，苔薄腻等症状。这些症状与中医理论中的“阴虚火炽”和“肝风夹痰”病机相符合。阴虚火炽可以解释他的口舌干燥、面赤升火等症状，而肝风夹痰则可以解释他的头晕胀痛和心悸怔忡。因此，病机答案为阴虚火炽和肝风夹痰。",
        "task_3": "I:阴虚阳亢\n\n解析：根据陆某的临床资料，他有血压190/134mmHg，头晕胀痛，面赤升火，心悸怔忡，口舌干燥，脉弦细，苔薄腻等症状。这些症状与中医理论中的阴虚阳亢证候相符合。阴虚阳亢是指体内阴液亏损，阳气相对亢盛，导致一系列上火症状，如面赤、心悸、口干等。因此，陆某的证候答案为I:阴虚阳亢。",
        "task_4": "临证体会：患者陆某，男，47岁，血压190/134mmHg，此为高血压之象。其病史中提及因儿子突然死亡而悲伤过度，连续彻夜不眠，此后常感头晕胀痛，面赤升火，心悸怔忡，尤以紧张时症状加剧，此乃情志内伤，肝气郁结，久之化火，上扰清窍，下扰心神之故。口舌干燥，脉弦细，苔薄腻，此为肝火上炎，耗伤津液，兼有痰湿内生之象。\n\n肝主疏泄，情志不畅则肝气郁结，郁久化火，火性炎上，故见头晕胀痛，面赤升火；心主血脉，肝火扰心，则心悸怔忡；肝火耗伤津液，故口舌干燥；脉弦细，苔薄腻，为肝火内炽，兼有痰湿之征。治疗当以平肝潜阳，清热化痰，养心安神为主，辅以疏肝解郁，调和情志，以期达到标本兼治之效。"
    },
    {
        "input": {
            "案例编号": "病例27",
            "临床资料": "刘某，男，40岁。初诊:1971年春。主诉及病史:胃痛已3年，经西医确诊为十二指肠球部溃疡，服过不少中西药，均无效果。每日胃痛彻背，连及两胁，饮食减少，大便不爽。从前曾有手足多汗症，自从患胃痛以后，手足出汗自止:诊查:察其脉象，沉取似觉滞涩有力，舌质舌苔无明显变化。阅其前服方药，多为理气、止痛、温中、缓泻等品。",
            "病机答案": "",
            "病机选项": "A:热搏于血;B:气血两虚;C:湿浊内结;D:清阳浊阴升降失调;E:肾阴虚;F:湿浊内盛;G:脾肾交馁;H:气血双亏;I:腐秽留滞;J:痰湿阻滞",
            "证候答案": "",
            "证候选项": "A:肝脾不调;B:血虚生风;C:气血两亏;D:血瘀;E:肾亏阴虚;F:风寒湿痹;G:燥热伤津;H:脾湿内盛;I:燥结便秘;J:肺失肃降",
            "临证体会": ""
        },
        "task_1": "胃痛彻背;连及两胁;饮食减少;大便不爽;手足多汗症自止;脉象沉取滞涩有力",
        "task_2": "D:清阳浊阴升降失调;I:腐秽留滞\n\n解析: 根据刘某的临床资料，他患有十二指肠球部溃疡，表现为胃痛彻背，连及两胁，饮食减少，大便不爽。这些症状提示可能存在清阳浊阴升降失调，即清阳之气不能上升，浊阴之气不能下降，导致胃痛和消化不良。此外，手足多汗症自止可能与体内腐秽留滞有关，即体内湿热或浊气积聚，影响了正常的汗液排泄。因此，病机答案为清阳浊阴升降失调和腐秽留滞。",
        "task_3": "A:肝脾不调\n\n解析:根据刘某的临床资料，他有胃痛、胃痛连及两胁、饮食减少、大便不爽等症状，这些症状与中医理论中的肝脾不调证候相符合。肝主疏泄，脾主运化，肝脾不调时，肝气郁结，影响脾的运化功能，导致胃痛、饮食减少、大便不爽等症状。此外，刘某的脉象沉取似觉滞涩有力，也提示有肝气郁结的情况。因此，刘某的证候为肝脾不调。",
        "task_4": "临证体会：患者胃痛连年，痛连背胁，饮食减少，大便不爽，此乃肝胃不和，气滞血瘀之象。肝气郁结，横逆犯胃，胃失和降，故胃痛连背胁；气机不畅，影响脾胃运化，故饮食减少，大便不爽。从前手足多汗，乃肝胆湿热下注，今胃痛起，汗自止，亦反映肝胆之气上逆，影响脾胃，而汗液生成减少。脉象沉取滞涩有力，反映肝胃气滞血瘀，不通则痛。治疗当以疏肝和胃，行气活血，调和中焦为主。方药宜选用柴胡疏肝散加减，以疏肝解郁，和胃止痛，同时配伍活血化瘀之品，如丹参、桃仁等，以改善局部血液循环，促进溃疡愈合。"
    },
    {
        "input": {
            "案例编号": "病例127",
            "临床资料": "王某，女，33岁。初诊：1975年4月10日。主诉及病史：失眠10余年，今年尤为严重。近3个月来虽临睡前服安眠药，但入睡不到3小时，甚至仅睡1小时。醒后心悸不宁，烦躁，不能再入睡。上午头昏，下午头胀痛，晚上头痛尤甚，头部筋脉紧张，颈部板紧不舒，食欲不振，嗳气，健忘，精神不易集中，情绪抑郁，以往便秘，近1个月来大便日行二三次，精神疲乏，怕冷，腰酸带下。诊查：脉弦细，舌质淡青，苔薄腻。",
            "病机答案": "",
            "病机选项": "A:心失所养;B:胃阴受伤;C:胃气不降;D:精血不能濡养筋膜;E:脾不健运;F:肾气不足;G:固摄失司;H:内热;I:脾阳司运化之职;J:肾阳虚弱",
            "证候答案": "",
            "证候选项": "A:脾肾阳虚;B:脾运不畅;C:营卫失和;D:虚火内扰;E:肝脾失调;F:心脾两亏;G:胃气上逆;H:脾胃受制;I:心肝阳虚;J:脾湿内盛",
            "临证体会": ""
        },
        "task_1": "核心临床信息: 失眠;心悸;烦躁;头昏;头胀痛;头痛;头部筋脉紧张;颈部板紧不舒;食欲不振;嗳气;健忘;精神不易集中;情绪抑郁;便秘;大便日行二三次;精神疲乏;怕冷;腰酸;带下;脉弦细;舌质淡青;苔薄腻。",
        "task_2": "心失所养;胃气不降;精血不能濡养筋膜;脾不健运;肾气不足;固摄失司\n\n解析：根据临床资料，患者有失眠、心悸、头昏、头痛、颈部不适、食欲不振、嗳气、健忘、抑郁、便秘、怕冷、腰酸带下等症状。结合脉象弦细、舌质淡青、苔薄腻的诊断，可以分析病机如下：\n\n1. 心失所养：失眠、心悸、健忘、精神不易集中、情绪抑郁等症状，提示心神失养，心血不足。\n\n2. 胃气不降：食欲不振、嗳气等症状，提示胃气不降，胃失和降。\n\n3. 精血不能濡养筋膜：头部筋脉紧张、颈部板紧不舒等症状，提示精血不能濡养筋膜，导致筋膜紧张。\n\n4. 脾不健运：食欲不振、嗳气、大便日行二三次等症状，提示脾不健运，脾失健运。\n\n5. 肾气不足：精神疲乏、怕冷、腰酸带下等症状，提示肾气不足，肾阳虚弱。\n\n6. 固摄失司：带下症状，提示固摄失司，肾气不足导致固摄功能失常。",
        "task_3": "D:虚火内扰;F:心脾两亏\n\n解析：根据临床资料，患者有长期失眠、心悸、烦躁、头昏、头痛、颈部不适、食欲不振、嗳气、健忘、精神不易集中、情绪抑郁、便秘转为大便日行二三次、精神疲乏、怕冷、腰酸带下等症状。脉弦细，舌质淡青，苔薄腻，这些症状和舌脉表现提示可能存在心脾两亏和虚火内扰的情况。心脾两亏表现为精神疲乏、健忘、精神不易集中、情绪抑郁、食欲不振等症状，而虚火内扰则表现为失眠、心悸、烦躁、头昏、头痛、颈部不适等症状。因此，结合临床表现和舌脉特征，D和F选项最为符合。",
        "task_4": "此例患者长期失眠，近况尤甚，表现为入睡困难，睡眠浅，易醒，醒后难以再眠，伴有心悸、烦躁、头痛、头昏、颈部不适等症状，同时有消化系统不适如食欲不振、嗳气，以及精神状态不佳如健忘、注意力不集中、情绪抑郁。近来还出现大便次数增多、精神疲乏、怕冷、腰酸和带下等症。从中医角度分析，脉弦细、舌质淡青、苔薄腻，提示肝气郁结，脾肾阳虚，心脾两虚的病机。\n\n临证体会：患者长期失眠，心神失养，心脾两虚，心主神明，脾主运化，心脾功能失调，不能正常运化水谷精微，滋养心神，导致睡眠质量下降。肝气郁结，气机不畅，影响心神安宁，故有心悸、烦躁、情绪抑郁等表现。脾肾阳虚，脾失健运，肾阳不足，不能温煦四肢，故有怕冷、腰酸等症状。肝气郁结，横逆犯脾，脾失健运，故有食欲不振、嗳气、大便次数增多等消化系统症状。肝肾同源，肝血不足，肾精亏损，带下增多，反映肝肾阴虚。综合分析，本例患者病机为心脾两虚，肝气郁结，脾肾阳虚，治疗应以调和肝脾，补益心脾，温肾助阳为原则。"
    },
    {
        "input": {
            "案例编号": "病例36",
            "临床资料": "宋某，女，17岁。初诊：1982年10月21日。主诉及病史：患“重症肌无力”，左眼睑下垂，影响视力，气短，全身无力，朝轻暮重，劳累加重。诊查：舌淡光红，苔白，脉极细弱。",
            "病机答案": "",
            "病机选项": "A:络伤血瘀;B:湿热郁阻中焦;C:素体阳虚;D:肝经郁热;E:热聚于阳明胃腑;F:毒邪侵袭;G:阴虚阳盛;H:心神亏虚;I:脾肾不足;J:气虚不能固卫腠理",
            "证候答案": "",
            "证候选项": "A:脾虚清气下陷;B:气滞血瘀;C:伏风夹瘀;D:真阴亏损;E:气阴亏损;F:阴虚阳浮;G:湿痰阻滞经络;H:痰浊内阻;I:厥阳升扰;J:血虚",
            "临证体会": ""
        },
        "task_1": "左眼睑下垂;气短;全身无力;朝轻暮重;劳累加重;舌淡光红;苔白;脉极细弱",
        "task_2": "I:脾肾不足;J:气虚不能固卫腠理\n\n解析：根据临床资料，患者表现为左眼睑下垂，气短，全身无力，朝轻暮重，劳累加重，舌淡光红，苔白，脉极细弱。这些症状提示患者可能存在脾肾不足，导致气虚不能固卫腠理，从而出现重症肌无力的症状。脾肾不足会导致气血生化不足，气虚则不能固摄肌肉，导致肌肉无力，眼睑下垂等症状。同时，气虚不能固卫腠理，使得患者容易感到疲劳，朝轻暮重，劳累加重。因此，病机答案为I:脾肾不足;J:气虚不能固卫腠理。",
        "task_3": "E:气阴亏损",
        "task_4": "临证体会：本例重症肌无力表现为左眼睑下垂，全身无力，朝轻暮重，劳累后加重，是典型的气虚下陷，脾肺两虚之象。气虚则无力托举，故见眼睑下垂；脾肺气虚，不能正常运化和输布精微，导致肌肉失养，全身无力。朝轻暮重，劳累加重，是气虚日久，不能随劳逸而调节所致。舌淡光红，苔白，脉极细弱，均为气虚之象。治疗当以补益脾肺，升举清阳，益气固脱为法。"
    }
]