[{"input": {"案例编号": "病例247", "临床资料": "某女，62岁。初诊：1957年1月。主诉及病史：发病十数天，咳逆不能平卧，唾白色泡沫痰。诊查：短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口。脉浮细数而无力。", "病机答案": "", "病机选项": "A:痰浊;B:耗损心气和心阴;C:食郁于胃;D:少阴伤寒;E:心移热于小肠;F:气阴两亏;G:脾胃湿热;H:阴虚内热;I:肾水不足;J:心气虚", "证候答案": "", "证候选项": "A:风湿内侵;B:气虚血瘀;C:血虚生风;D:肾元不固;E:虚火牙痛;F:肝气横逆;G:阴亏之体;H:感暑邪;I:复感外邪;J:阴寒内盛", "临证体会": ""}, "task_1": "核心临床信息: 咳逆不能平卧;唾白色泡沫痰;短气;语音低微;神识昏愦不清;时妄言语;身有微热;手足厥冷;脉浮细数而无力。", "task_2": "F:气阴两亏;J:心气虚\n\n解析：根据临床资料，患者有咳逆不能平卧，唾白色泡沫痰，短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口，脉浮细数而无力。这些症状提示患者可能存在气阴两亏和心气虚的情况。气阴两亏表现为气短、乏力、脉细数无力，心气虚则表现为心悸、短气、神识昏愦不清等症状。因此，病机答案为F:气阴两亏;J:心气虚。", "task_3": "G:阴亏之体;I:复感外邪\n\n解析：根据临床资料，患者有咳逆不能平卧，唾白色泡沫痰，短气，语音低微，神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，偶饮热一二口，脉浮细数而无力等症状。这些症状提示患者可能有阴液亏损，复感外邪的情况。阴亏之体表现为阴液不足，复感外邪则表现为新感病邪，两者结合导致病情加重。因此，证候答案为G:阴亏之体;I:复感外邪。", "task_4": "### 临证体会\n\n本例患者年高体弱，病程虽短，但病情危重。咳逆不能平卧，唾白色泡沫痰，提示肺气上逆，水饮内停。短气，语音低微，神识昏愦不清，时妄言语，这些症状表明患者正气大衰，心肺功能受损，且有神志异常，可能为痰蒙心窍或心肺气虚，神明失养所致。身有微热，手足厥冷，偶饮热一二口，提示阳气虚衰，阴寒内盛，阳气不能温煦四肢，故见手足厥冷，微热可能为虚阳外越之象。脉浮细数而无力，为阳气虚脱，阴液不足之象。综合分析，本病为肺气虚衰，心阳不振，水饮内停，痰蒙心窍之危重证候。治疗当以温阳化饮，开窍醒神为主，同时扶正固本，以期挽回危局。", "task_5": "### 辨证\n辨证：此乃肺肾两虚，水饮凌心所致。患者年事已高，肺气虚弱，肾阳不足，导致水液代谢失常，水饮上凌于心，影响心肺功能，出现咳逆不能平卧，唾白色泡沫痰等症状。同时，患者神识昏愦不清，时妄言语，终又复言，身有微热，手足厥冷，脉浮细数而无力，均为心肺功能衰弱，阳气虚脱的表现。治疗应以温补肺肾，化饮降逆，固脱救逆为原则。"}, {"input": {"案例编号": "病例142", "临床资料": "万某，男，45岁。初诊：1977年11月6日。主诉及病史：1个月前因左副鼻窦炎连续注射链霉素7g，引起眩晕耳鸣，走路时摇晃如醉人，并有复视(不走路时没有复视)，至今未愈。经常嗳气上逆，大便干结。已经3个医院神经科检查，无异常发现。诊查：血压100/70mmHg。脉弦细带滑，舌胖，苔微黄而润。", "病机答案": "", "病机选项": "A:风热外袭;B:络道阻塞;C:脾胃运化失常;D:幽门塞阻;E:肺阴亏损;F:损及肾阴;G:生湿成痰;H:痰浊内蕴;I:心肝血虚火旺;J:清阳失展", "证候答案": "", "证候选项": "A:下元虚损;B:痰浊上逆;C:湿热蕴积;D:肝郁气滞;E:肝肾阴虚;F:寒热互结;G:心肝阳虚;H:真阴亏损;I:清气不升;J:伤脾胃", "临证体会": ""}, "task_1": "眩晕;耳鸣;走路时摇晃如醉人;复视(不走路时没有复视);嗳气上逆;大便干结;脉弦细带滑;舌胖;苔微黄而润", "task_2": "脾胃运化失常;生湿成痰;痰浊内蕴\n\n解析：根据万某的临床资料，他有眩晕、耳鸣、走路摇晃、复视、嗳气上逆和大便干结等症状。脉象弦细带滑，舌胖，苔微黄而润，这些症状和体征提示病机可能涉及脾胃运化失常，导致生湿成痰，痰浊内蕴。脾胃为后天之本，主运化水湿，脾胃功能失调可致湿浊内生，进而化为痰浊，上扰清窍，导致眩晕、耳鸣等症状。同时，痰浊阻滞，影响清阳之气的升发，也可导致走路摇晃、复视等表现。", "task_3": "痰浊上逆;肝郁气滞\n\n解析：根据万某的临床资料，他有眩晕耳鸣、走路摇晃如醉、复视等症状，这些症状与痰浊上逆相关，痰浊上逆可以导致头晕、眩晕等症状。同时，他还有嗳气上逆和大便干结的症状，这与肝郁气滞有关，肝郁气滞可以导致嗳气、大便干结等症状。因此，万某的证候为痰浊上逆和肝郁气滞。", "task_4": "临证体会：本案患者因连续使用链霉素治疗左副鼻窦炎后出现眩晕、耳鸣、走路不稳及复视等症状，中医辨证分析，此乃肝胆之气上逆，清阳不升，浊阴不降之象。链霉素为西药，其性寒凉，易伤脾胃，脾胃为后天之本，主运化水谷精微，若脾胃受损，清阳不升，则可见眩晕、耳鸣；浊阴不降，则见嗳气上逆，大便干结。脉弦细带滑，舌胖，苔微黄而润，提示肝胆气郁，脾胃运化失常，湿热内生。治疗当以疏肝理气，健脾和胃，清化湿热为法，以期恢复清阳上升，浊阴下降之正常生理状态。", "task_5": "辨证：肝胃不和，痰湿中阻\n\n解析：根据万某的临床表现，可以分析如下：\n\n1. 眩晕耳鸣：眩晕是肝阳上亢或痰湿中阻的常见症状，耳鸣多与肝胆火旺或肾精不足有关。但结合其他症状，更倾向于痰湿中阻导致的眩晕耳鸣。\n\n2. 走路时摇晃如醉人：这与痰湿中阻，清阳不升，影响平衡感有关。\n\n3. 复视：复视在中医中多与肝风内动或痰湿阻络有关，但万某仅在走路时出现，可能与痰湿中阻，影响气血运行，进而影响视觉有关。\n\n4. 嗳气上逆：嗳气是胃气上逆的表现，多与肝胃不和有关。\n\n5. 大便干结：大便干结多与津液不足或湿热内蕴有关，结合脉象和舌象，更倾向于湿热内蕴。\n\n6. 脉弦细带滑，舌胖，苔微黄而润：脉弦细带滑提示肝胃不和，痰湿内阻；舌胖，苔微黄而润提示湿热内蕴，痰湿中阻。\n\n综上所述，万某的辨证为肝胃不和，痰湿中阻。治疗上应以疏肝和胃，化痰祛湿为主。"}, {"input": {"案例编号": "病例23", "临床资料": "吴某，男，52岁。初诊:1985年1月10日。主诉及病史:患高血压病十余载。1月3日晚暴怒之后昏然入睡，晨起醒来，即见口眼歪斜(歪向左侧)，嘴角抽搐时作，流涎不止，左半身不利，手指麻木不仁，步履拖拉，膝软无力，言语睿涩，头目眩晕，耳鸣，嗜睡，面红目赤，口苦咽干，心烦易躁，纳可，便干、二日一行，虽经治疗，收效甚微。脉弦劲略滑，舌红体胖且左偏，边有齿痕，苔白腻满布，血压210/110mmHg。", "病机答案": "", "病机选项": "A:肝风夹痰;B:湿热交蒸肝胆;C:痰湿内盛;D:肝阳化火;E:阴虚阳亢;F:伏湿内蕴;G:神明受扰,;H:气血逆乱;I:气化失调;J:火升风动", "证候答案": "", "证候选项": "A:肝肾阴虚;B:肝风内动;C:心肾不交;D:卫外不固;E:气阴两伤;F:肝火亢盛;G:湿热郁遏;H:热在气分;I:热伤胃阴;J:风痰窜络", "临证体会": ""}, "task_1": "核心临床信息: 高血压病史;口眼歪斜(歪向左侧);嘴角抽搐;流涎;左半身不利;手指麻木不仁;步履拖拉;膝软无力;言语睿涩;头目眩晕;耳鸣;嗜睡;面红目赤;口苦咽干;心烦易躁;便干、二日一行;脉弦劲略滑;舌红体胖且左偏;边有齿痕;苔白腻满布;血压210/110mmHg。", "task_2": "A:肝风夹痰;D:肝阳化火;J:火升风动\n\n解析:根据吴某的临床资料，我们可以分析其病机如下:\n1. 口眼歪斜、嘴角抽搐、流涎不止、左半身不利、手指麻木不仁、步履拖拉、膝软无力等症状，提示存在肝风内动，夹有痰湿，故选A:肝风夹痰。\n2. 头目眩晕、耳鸣、面红目赤、口苦咽干、心烦易躁、脉弦劲略滑、舌红体胖且左偏、边有齿痕、苔白腻满布等，提示肝阳化火，故选D:肝阳化火。\n3. 脉弦劲略滑、舌红体胖且左偏、边有齿痕、苔白腻满布等，提示火升风动，故选J:火升风动。\n\n综上所述，吴某的病机为肝风夹痰、肝阳化火、火升风动。", "task_3": "B:肝风内动;F:肝火亢盛;J:风痰窜络\n\n### 解析\n吴某的临床表现符合中医辨证中的“肝风内动”和“肝火亢盛”，以及“风痰窜络”。暴怒之后出现的口眼歪斜、嘴角抽搐、流涎、半身不利、手指麻木、步履拖拉、膝软无力、言语不清、头目眩晕、耳鸣、面红目赤、口苦咽干、心烦易躁等症状，均与肝风内动和肝火亢盛的病理机制相关。肝风内动是由于肝阳上亢，肝风内动，导致气血运行不畅，影响到肢体和语言功能。肝火亢盛则表现为面红目赤、口苦咽干、心烦易躁等肝火上炎的症状。风痰窜络则是指风邪与痰湿相互作用，影响经络，导致肢体麻木、步履拖拉等症状。此外，便干、二日一行，以及脉弦劲略滑、舌红体胖且左偏、边有齿痕、苔白腻满布等舌脉表现，也支持了上述辨证。", "task_4": "临证体会：患者长期患有高血压，加之暴怒之后，肝阳暴亢，风火上扰，导致突然发作的中风症状。表现为口眼歪斜，嘴角抽搐，流涎，左半身不利，手指麻木，步履拖拉，膝软无力，言语不清，头目眩晕，耳鸣，嗜睡，面红目赤，口苦咽干，心烦易躁，这些都是肝阳上亢，风火相煽，痰湿内阻，经络受阻的典型表现。脉弦劲略滑，舌红体胖且左偏，边有齿痕，苔白腻满布，均为肝阳上亢，痰湿内阻，气血运行不畅的征象。血压210/110mmHg，显示血压控制不佳，病情严重。治疗应以平肝熄风，化痰通络，清热解毒，活血化瘀为主，同时控制血压，防止病情进一步恶化。", "task_5": "辨证：肝阳暴亢，风火上扰，兼有痰湿阻络。\n\n吴某的临床表现符合中医辨证中肝阳上亢的特征，表现为暴怒之后出现的口眼歪斜、嘴角抽搐、流涎、半身不利、手指麻木、步履拖拉、膝软无力、言语不清、头目眩晕、耳鸣、嗜睡、面红目赤、口苦咽干、心烦易躁等症状。这些症状与肝阳上亢，风火上扰有关，肝阳上亢导致风火内生，上扰清窍，影响肢体功能和言语表达。同时，脉弦劲略滑、舌红体胖且左偏、边有齿痕、苔白腻满布，提示体内有痰湿阻络，痰湿与肝阳上亢相互影响，加重病情。便干、二日一行也反映了体内燥热和津液不足的情况。血压210/110mmHg进一步证实了高血压的严重程度。综合以上，辨证为肝阳暴亢，风火上扰，兼有痰湿阻络。"}]